#include <a_samp>
#include <ASAN>
#include <core>
#include <float>
#include <streamer>
#include <crp>
#include <sscanf2>
#include <a_mysql>
#include <md5>
#include <mapandreas>
#include <mxINI>
#include <a_http>
#include <a_zones>
#include <DLDiag>

#define DIALOG_SOE			1050
#define DIALOG_CREATE		DIALOG_SOE + 1
#define DIALOG_SELECT   	DIALOG_SOE + 2
#define DIALOG_TUTORIAL 	DIALOG_SOE + 3
#define DIALOG_SAVE_1		DIALOG_SOE + 4
#define DIALOG_SAVE_2       DIALOG_SOE + 5

#define GetRank(%1) rName[PI[%1][Rank]-1][PI[%1][Faction]-1]
#define Name(%1) PI[%1][Nick]

#define MAX_HOUSES 3000
#define PLAYERS 500

#define 	SQL_HOST 			"localhost"
#define 	SQL_USER 			"samper"
#define 	SQL_PASS 			"123123"
#define 	SQL_DB 	 			"samp"

#define COLOR_SYSTEM 0xC0C0C0FF
#define COLOR_ADMIN_P 0x80FF80FF
#define COLOR_ADMIN_A 0xFFFF80FF
#define COLOR_ADMIN 0x008000FF
#define COLOR_ERROR 0xFF0000FF
#define COLOR_SUCCESS 0x00CC4AFF
#define COLOR_DONATE 0xFFA042FF

#define r_hour 4
#define r_min 30

#define gmtext 		"Role Play 0.3.4"
#define hostname	"Georgia Role Play"

#define NICK_COST 			5.00
#define CASH_COST 		2000

// Players Move Speed
#define MOVE_SPEED              100.0
#define ACCEL_RATE              0.03

// Players Mode
#define CAMERA_MODE_NONE    	0
#define CAMERA_MODE_FLY     	1

// Key state definitions
#define MOVE_FORWARD    		1
#define MOVE_BACK       		2
#define MOVE_LEFT       		3
#define MOVE_RIGHT      		4
#define MOVE_FORWARD_LEFT       5
#define MOVE_FORWARD_RIGHT      6
#define MOVE_BACK_LEFT          7
#define MOVE_BACK_RIGHT         8

main(){}

enum noclipenum
{
	cameramode,
	flyobject,
	mode,
	lrold,
	udold,
	lastmove,
	Float:accelmul
}
new noclipdata[MAX_PLAYERS][noclipenum];

enum SavedEnums {
	Float:foX,
	Float:foY,
	Float:foZ,
	Float:roX,
	Float:roY,
	Float:roZ
};

new O[SavedEnums];

enum {
	MN_admin,MN_stats, MN_gps, MN_options, MN_report, MN_donate, MN_inf, MN_heal, MN_frac, MN_phone, MN_phone_cont, MN_phone_112, MN_phone_112_02, MN_phone_112_03, MN_phone_serv_taxi, MN_phone_serv, MN_phone_radio, MN_phone_radio_LS, MN_phone_radio_SF, MN_phone_radio_LV, MN_phone_radio_OFF, MN_phone_selfie,
	PMN_admin, PMN_spec, PMN_stats, PMN_passport, PMN_money, PMN_report, PMN_eject, PMN_frac, PMN_statsex,
	FPMN_heal1,FPMN_heal2,FPMN_heal3,FPMN_arest,FPMN_wanted1,FPMN_wanted2,FPMN_disDlic,FPMN_bHand1,FPMN_bHand2,FPMN_inCar1,FPMN_inCar2,FPMN_jail,
	FPMN_iView,FPMN_Sex,FPMN_Form,FPMN_invite,FPMN_uninvite,FPMN_Rank,FPMN_gRank,
	H_buy, H_sell, H_rent, H_unrent, H_obuy, H_rentcost, H_safe, H_unlock, H_lock, H_label, H_unsell, H_tosell,
	F_members, F_info, F_leave, F_adv, F_reportage, F_gnews, F_crim,
	D_auth_nick, D_auth_email,
	ADM_veh, ADM_chat, ADM_other, ADM_soe, ADM_info,
	ADM_veh_info,ADM_veh_unlock,ADM_veh_unuseresp,ADM_veh_repair,ADM_veh_fuel,ADM_veh_resp,ADM_veh_adel, ADM_veh_alladminresp,
	ADM_chat_say,ADM_chat_IC,ADM_chat_OOC,ADM_chat_adv,ADM_chat_gl,
	ADM_other_gm,ADM_other_bh,ADM_other_abh,ADM_other_inhs,ADM_other_tpmap,ADM_other_saveall,ADM_other_restart,ADM_other_showkeys,ADM_other_kills,ADM_other_fly,
	ADMLIST,CMDS,KEYS,LEADERS,HELP,NEWS,ANIMS,RECORD,
	HOUSE_BANK_ADD,HOUSE_BANK_REM,
	D_GNEWS, MN_phone_call, MN_phone_sms, MN_phone_C, MN_phone_N,
	
	D_INFO,
	D_REG,
	D_AUT,
		D_AUT_OPT,
		D_AUT_NICK,
	D_SEX,
	D_HISTORY,
	D_NONRPNICK,
	D_STATS,
		D_STATS_INFO,
		D_STATS_ADMIN,
	D_HELP,
		D_HELP_INFO,
	MENU,
	D_CAR, D_CAR_alarm, D_CAR_bonnet, D_CAR_boot, D_CAR_lights, D_CAR_doors, D_CAR_engine,
	D_OPT,
		D_PASS,
		D_EMAIL,
		D_KEY,
			D_CKEY,
	D_REPORT,
	D_DONATE,
		D_DONATE_INFO,
		D_DONATE_NICK,
		D_DONATE_MONEY,
		D_DONATE_PAY,
		D_DONATE_PAY_YESNO,
		DON_pay,
		DON_cash,
		DON_nick,
		DON_money,
	D_TAXI,
	P_MENU,
		P_MENU_INV,
		P_MENU_RANK,
		P_MENU_MONEY,
		P_MENU_REPORT,
		P_MENU_FACTION,
			P_MENU_FACTION_HEAL1,
			P_MENU_FACTION_HEAL2,
			P_MENU_FACTION_WANTED,
			P_MENU_FACTION_INVITE,
			P_MENU_FACTION_IVIEW,
	P_MENU_ADMIN,
		P_MENU_ADMIN_PEN,
			P_MENU_ADM_pen, P_MENU_ADM_pen_mute, P_MENU_ADM_pen_mutecmd, P_MENU_ADM_pen_jail, P_MENU_ADM_pen_cheaters, P_MENU_ADM_pen_kick, P_MENU_ADM_pen_ban, P_MENU_ADM_pen_pban, P_MENU_ADM_pen_report,
				P_MENU_ADM_pen_report_input, P_MENU_ADM_pen_jail_input, P_MENU_ADM_pen_mutecmd_input, P_MENU_ADM_pen_mute_input,
		P_MENU_ADMIN_ACC,
			P_MENU_ADM_acc, P_MENU_ADM_acc_nick, P_MENU_ADM_acc_mutecount, P_MENU_ADM_acc_cheatercount,P_MENU_ADM_acc_alvl, P_MENU_ADM_acc_lvladd, P_MENU_ADM_acc_lvlset, 
				P_MENU_ADM_acc_alvl_input, P_MENU_ADM_acc_lvlset_input, P_MENU_ADM_acc_lvladd_input, P_MENU_ADM_acc_nick_input,
		P_MENU_ADMIN_PL,
			P_MENU_ADM_pl, P_MENU_ADM_pl_sex, P_MENU_ADM_tp, P_MENU_ADM_tpto, P_MENU_ADM_pl_rank, P_MENU_ADM_skill, P_MENU_ADM_faction, P_MENU_ADM_pl_moneyset, P_MENU_ADM_pl_moneyadd, P_MENU_ADM_pl_vw, P_MENU_ADM_pl_interior, P_MENU_ADM_pl_hp, P_MENU_ADM_pl_ar, P_MENU_ADM_pl_offkeys, P_MENU_ADM_pl_passport, P_MENU_ADM_pl_drvlic,
			P_MENU_ADM_faction_select,
	D_PASSPORT,
	D_INF,
		D_ADMINS,
		D_NEWS,
		D_LEADERS,
	D_RESTART,
	D_PHONE,
		D_PHONE_NUBMER,
		D_PHONE_BALANCE,
		DM_PHONE,
		DM_PHONE_D,
		DM_PHONE_ADD_C,
		DM_PHONE_ADD_N,
		DM_PHONE_SMS,
		DM_PHONE_C,
		DM_PHONE_N,
		DM_PHONE_112,
		DM_PHONE_SERV,
		DM_PHONE_RADIO,
 ADMIN,
	 ADMIN_VEH,
	 ADMIN_CHAT,
			ADMIN_CHAT_IN,
			ADMIN_CHAT_ALL,
	ADMIN_OTHER,
	D_HOUSE,
	D_HOUSE_RENT,
	D_HOUSE_BANK,
		D_HOUSE_BANK_G,
		D_HOUSE_BANK_R,
		D_HOUSE_LABEL,
		D_HOUSE_SELL,
	D_BUYCAR,
	D_BUYSKIN,
	D_SELLCAR,
	D_EAT,
	D_BANK,
	D_BANK_G,
	D_BANK_R,
	D_ATM,
		D_ATM_PHONE_G,
		D_ATM_BANK_R,
		D_ATM_PHONE_R,
	D_OIL,
	D_LICD,
	D_247,
	D_WORK,
	D_HEAL,
	D_WORK_S,
	D_WORK_BUS,
		D_WORK_BUS_COST,
	D_PACKER,
	D_WOODER,
	D_MINER,
	D_GPS,
	D_GPS_JOBS,
	D_GPS_GBUILDS,
	D_GPS_MAGZ,
	D_GPS_CARS,
	D_GPS_HOUSE,
		D_GPS_HOUSE_SEARCH,
	D_FACTION,
	D_FACTION_LIST,
	D_FACTION_GN,
	D_FACTION_1,
	D_FACTION_11,
	O_MAIN,
		O_MAIN_CREATE
}

enum PlayerInfo {
	Cache:Data,
	ID,RegIP[16],LastIP[16],Nick[24],IP[16],SavePosition,
	LoginDate[10],LoginTime[10],
	RegDate[10],RegTime[10],
	Skin,fSkin,
	Money,
	Sex,
	Key[64],
	Email[32],
	Admin,
	Level,
	Exp,
	GameTime,
	Passport,bDay[11],
	House,
	Renter,
	CheatTime, CheatCount,
	Float:Health,Float:Armor,HealthTime,ArmorTime,
	Float:X,Float:Y,Float:Z,Float:A,Interior,VW,
	Faction,Rank,
	ReadNews,
	PhoneNumber,PhoneBalance,PhoneObject,
	LastCar,Adv[64],
	SkillPistol1,SkillPistol2,SkillPistol3,SkillShotgun1,SkillShotgun2,SkillShotgun3,SkillUZI,SkillMP5,SkillAK47,SkillM4,SkillSniper,
	Wanted,
	Eat,Law,
	Bank,Float:Donate,
	DriveLicence,
	Job,HealPacks,
	sZone,AFK,BH,GodMode,OpenHouses,TPMap, ShowKeys, ShowKills,
	Event1[64],Event2[64],Event3[64],Event4[64],Event5[64],Event6[64],Event7[64],Event8[64],Event9[64],Event10[64]
}

enum PenaltyInfo
{
	MuteTime,
	MuteCount,
	Cheater,
	CheaterCount,
	JailTime,
	MuteCMD,
	MuteReport
}

enum CarInfo
{
	CarGUID,
	CarID,
	Color1,
	Color2,
	NumberPlate[32],
	HealPacks,
	PaintJob,
	VehSlot0,
	VehSlot1,
	VehSlot2,
	VehSlot3,
	VehSlot4,
	VehSlot5,
	VehSlot6,
	VehSlot7,
	VehSlot8,
	VehSlot9,
	VehSlot10,
	VehSlot11,
	VehSlot12,
	VehSlot13,
	Object1,
	Object2,
	Float:cFuel
}

enum HouseInfo {
	ID,PickID,IconID,Text3D:InfoID,LockID,MarkerID,
	Float:StreetX,Float:StreetY,Float:StreetZ,Float:StreetA,
    Float:VehX,Float:VehY,Float:VehZ,Float:VehA,
    Owner,Interior,Cost,Level,
    CostRent,
	Bank,
	Label[64],
	CostSell,World,WorldInterior,
	bool:Locked
}

enum NewsInfo {
	Date[11],Version[7],Added[512],Fixed[1536],Admins[512],Helpers[512],Type
}

enum Record {
	Date[10],
	Time[10],
	Players
}

new
	query1[1536],
	PI[PLAYERS][PlayerInfo],
	PIcar[PLAYERS][CarInfo],
	PIpen[PLAYERS][PenaltyInfo],
	PIwp[PLAYERS][12],
	HI[MAX_HOUSES][HouseInfo],
	NI[NewsInfo],
	R[Record],
	GetSpeedModeIptimized,
	online,
	NowWeather,
	PhoneC[PLAYERS][20],
	PhoneN[PLAYERS][20][32],
	PlayerText: HPinfo[PLAYERS],
	PlayerText: ARinfo[PLAYERS],
	PlayerText: main_info[PLAYERS],
	AdminCarID[PLAYERS][10],
	AdminCarCount[PLAYERS],
	AdminsCarsCount = 0,
	bool:globalchat,
	bool:Bunny,
	housecount,
	nAdm[PLAYERS],
	nAdv[PLAYERS],
	nTaxi[PLAYERS],
	bool:LockRegSkin[PLAYERS],
	Float:DonatePay[PLAYERS],
	Text:ServerLabel,
	Text:txtTimeDisp,
	glhour, glmins,
	Text:CarShopBox,
	PlayerText:NameCar[PLAYERS],
	PlayerText:PrevCar[PLAYERS],
	PlayerText:NextCar[PLAYERS],
	PlayerText:LevelCar[PLAYERS],
	PlayerText:CostCar[PLAYERS],
	PlayerText:BuyCar[PLAYERS],
	PlayerText:SellCar[PLAYERS],
	NowCarShop[PLAYERS],
	ShopCar[PLAYERS],
	Float:ShopCarAngle[PLAYERS],
	PlayerText:AngleCarLeft[PLAYERS],
	PlayerText:AngleCarRight[PLAYERS],

	NowSkinShop[PLAYERS],
	PlayerText:SkinShopNext[PLAYERS],
	PlayerText:SkinShopPrev[PLAYERS],
	PlayerText:SkinShopBuy[PLAYERS],

	NowSkinReg[PLAYERS],
	PlayerText:SkinRegNext[PLAYERS],
	PlayerText:SkinRegPrev[PLAYERS],
	PlayerText:SkinRegEnter[PLAYERS],

	Text:SpeedCarBox,
	PlayerText:SpeedNameCar[PLAYERS],
	PlayerText:FuelCarLabel[PLAYERS],
	PlayerText:FuelCarLevel[PLAYERS],
	PlayerText:HPCar[PLAYERS],
	PlayerText:LockedCar[PLAYERS],
	PlayerText:SpeedCarLabel[PLAYERS],
	PlayerText:SpeedCar[PLAYERS],

	PlayerText:MenuBG[PLAYERS],
	PlayerText:MenuButton[PLAYERS][23],
	MenuButtonModel[PLAYERS][23],
	
	PlayerText:S_Joystick[PLAYERS],
	PlayerText:S_UP[PLAYERS],
	PlayerText:S_DOWN[PLAYERS],
	PlayerText:S_LEFT[PLAYERS],
	PlayerText:S_RIGHT[PLAYERS],
	PlayerText:S_BACK[PLAYERS],
	Float:S_Radius = 0.7,
	Float:S_Height[PLAYERS] = 0.65,
	Float:S_Angle[PLAYERS],
	
	Gate_FRAC12[2],
	bool:gate_FRAC12[2] = false,	
	Gate_FRAC11[3],
	bool:gate_FRAC11[3] = false,
	Gate_FRAC10[3],
	bool:gate_FRAC10[3] = false,
	Gate_Lic[1],
	bool:gate_nicky = false,
	Gate_Nicky[1],

	Gate_LSPD[2],
	bool:gate_LSPD[2] = false,
	Gate_SFPD[2],
	bool:gate_SFPD[2] = false,
	Gate_LVPD[2],
	bool:gate_LVPD[2] = false,
	
	Lift[1],
	LiftDoor[2],
	bool:Lifted[1] = false,
	bool:Lifting[1] = false,

	EatCP[1],
	ArmsEat[1],
	CP247[1],
	HealCP[2],
	PackerCP[2],
	WooderCP[4],
	MinerCP[6],
	DriverCP[1],
	CP_112[PLAYERS],
	CP_HOUSE[PLAYERS],

	EndJobTimer[PLAYERS],
	bool:Engine[MAX_VEHICLES] = false, engine,
	bool:Lights[MAX_VEHICLES] = false, lights,
	bool:Alarm[MAX_VEHICLES] = false, alarm,
	bool:CarLocked[MAX_VEHICLES] = false, doors,
	bool:Bonnet[MAX_VEHICLES] = false, bonnet,
	bool:Boot[MAX_VEHICLES] = false, boot,
	objective,
	bool:VehUsed[MAX_VEHICLES] = false,
	bool:VehOfPlayer[MAX_VEHICLES] = false,
	bool:VehOfAdmin[MAX_VEHICLES] = false,
	Float:Fuel[MAX_VEHICLES],
	glstr[256],
	allflood,
	bool:flood[PLAYERS] = false,
	packer,
	wooder,
	miner,
	spawneat,
	spawnhelp,
	works,
	OtherVeh[50],
	LSPDcars[27],
	LSPDweap[3],
	SFPDcars[19],
	SFPDweap[3],
	LVPDcars[31],
	LVPDweap[3],
	ArmsWeap[4],
	LSHPcars[9],
	SFHPcars[25],
	LVHPcars[8],
	LSNcars[9],
	SFNcars[13],
	LVNcars[6],
	SVcars[16],
	VMFcars[22],
	VVScars[15],
	LicCars[8],
	TaxiCars[34],
	MiniTaxi[34],
	Bus[24],
	MiniBus[24],
	Text3D:BusLabel[MAX_VEHICLES],
	MySQL:mysql1;

new HouseInt[27] = {1,2,3,8,5,12,2,4,5,5,9,10,5,5,10,5,2,4,6,6,1,2,6,11,6,10,6};
new Float:HouseCoord[27][4] = {
{244.1276,304.9007,999.1484,270.0},
{266.7771,304.9217,999.1484,270.0},
{2495.8896,-1692.6499,1014.7422,180.0},
{2807.6628,-1174.4562,1025.5703,360.0},
{318.6601,1115.2936,1083.8828,360.0},
{2324.5227,-1149.1566,1050.7101,360.0},
{2468.6343,-1698.1779,1013.5078,90.0},
{-261.1545,1456.6892,1084.3672,90.0},
{22.7800,1403.4600,1084.4370,360.0},
{140.3074,1366.9340,1083.8594,0.0},
{83.1111,1322.4213,1083.8662,360.0},
{23.9533,1340.5935,1084.3750,360.0},
{1261.3134,-785.3924,1091.9063,276.2146},
{2233.6792,-1114.2806,1051.21,359.9612},
{2260.5823,-1135.8806,1051.6328,273.9038},
{227.1613,1114.2213,1080.9973,267.0062},
{446.9713,1397.7134,1084.3047,0.4750},
{261.0671,1284.7126,1080.2578,0.0424},
{344.1049,304.8762,999.1484,266.5687},
{234.1400,1064.4841,1084.2112,1.2477},
{2217.5574,-1076.0642,1050.4844,89.8445},
{2237.5674,-1081.3199,1049.0234,0.3790},
{2196.8501,-1204.3671,1049.0234,85.6567},
{2282.9495,-1140.2864,1050.8984,1.2028},
{2333.0398,-1077.2990,1049.0234,358.1293},
{2270.3950,-1210.4878,1047.5625,88.0660},
{2308.7927,-1212.8822,1049.0234,353.9906}
};

new Float:HospitalZone[2][2] = {
	{-280.1027, 220.7632},
	{-864.2944, 220.7632}
};
new bool:Bed[17];
new Float:HospitalBed[17][4] = {
	{142.2654,-117.9839,845.8475,358.8594 }, 
	{146.2283,-117.8267,845.8475,355.9361 }, 
	{149.7193,-117.8230,845.8475,357.5423 }, 
	{153.6550,-117.8181,845.8475,358.2758 }, 
	{157.8383,-118.0392,845.8475,0.0305 }, 
	{162.3538,-118.0879,845.8475,357.6910 }, 
	{166.0963,-117.9420,845.8475,358.1295 }, 
	{169.4972,-117.7923,845.8475,359.8820 }, 
	{170.2424,-108.5285,845.8475,175.6403 }, 
	{166.8800,-108.3829,845.8475,176.0791 }, 
	{163.5223,-108.5091,845.8475,176.6641 }, 
	{160.0511,-108.6090,845.8475,179.0038 }, 
	{156.7410,-108.4658,845.8475,174.0323 }, 
	{153.3940,-108.5128,845.8475,174.7635 }, 
	{149.9594,-108.6333,845.8475,176.6645 }, 
	{146.6341,-108.4101,845.8475,178.8577 }, 
	{143.2079,-108.6985,845.8475,178.1266 }
};

new MeriaPassport, EnterMeria[4], Float:MeriaEnter[4][] = {
	{390.1217,173.8953,1008.3828},
	{1479.3864,-1771.9471,18.7958},
	{-2765.7097,375.5869,6.3359},
	{2388.1018,2465.9277,10.8203}
};

new EnterArms[4], Float:ArmsEnter[4][] = {
	{1000.0214,34.0610,957.2239,-90.0},
	{206.9777,1923.0940,17.6406,178.3735},
	{-1284.5096,445.8364,7.3797,0.2964},
	{410.7166,2551.7573,16.6287,180.0}
};

new EnterHospital[8], Float:HospitalEnter[8][] = {
	{159.6960,-98.0736,845.2156,359.7400},
	{1172.0944,-1323.3309,15.4030,271.2697},
	{-2655.0747,640.1642,14.4545,180.5349},
	{1876.0425,2233.5054,11.1250,359.7552},
	{137.0309,-82.0321,845.2156,268.3466},
	{1145.0258,-1321.2953,13.5829,89.5117},
	{-2637.4446,694.9525,27.9348,0.7772},
	{1844.4517,2224.6926,11.1250,90.0798}
};

new Enter247[26], Float:Enter_247[26][] = {
	{-27.4067,-58.2508,1003.5469,358.9314},
	{1352.4010,-1759.2048,13.5078,357.2688},
	{1833.7281,-1842.5371,13.5781,89.5900},
	{1928.5834,-1776.3280,13.5469,268.2662},
	{2424.2434,-1742.7588,13.5459,49.5898},
	{1315.5321,-897.6831,39.5781,177.6388},
	{-2032.9454,161.4413,29.0461,269.6107},
	{-2442.6602,755.4183,35.1719,177.1244},
	{-78.3905,-1169.9354,2.1355,65.1686},
	{-179.1240,1177.5800,19.8909,89.3518},
	{-1676.0874,432.1319,7.1797,227.4773},
	{638.9814,1683.4197,7.1875,36.7514},
	{-1320.4741,2698.5405,50.2663,198.8621},
	{171.9249,-200.9310,1.5703,232.6782},
	{1294.8141,235.5439,19.5547,16.6959},
	{2334.3831,14.5378,26.4842,277.2406},
	{-2231.5759,-2558.2759,31.9219,76.9104},
	{-1623.5920,-2693.2966,48.7427,156.5185},
	{-1465.7820,1873.3146,32.6328,177.7495},
	{2117.5090,896.8804,11.1797,358.2344},
	{2637.1050,1129.5720,11.1797,178.1497},
	{2187.8147,2469.6272,11.2422,271.0382},
	{2247.6897,2396.2737,10.8203,357.4843},
	{1937.7672,2307.2551,10.8203,89.4028},
	{2097.6418,2224.7014,11.0234,177.9982},
	{661.3468,-573.4165,16.3359,90.0674}
};

new EnterEat[22], Float:EatEnter[22][] = {
	{364.9733,-11.7875,1001.8516,359.0619},
	{928.8600,-1352.9816,13.3438,90.3319},
	{810.4852,-1616.1697,13.5469,270.0650},
	{-2767.7698,788.8112,52.7813,280.9528},
	{-227.3544,2711.8503,62.9766,178.1697},
	{-1271.4272,2713.2258,50.2663,120.8772},
	{1158.0225,2072.2607,11.0625,275.1301},
	{203.4187,-202.0443,1.5781,180.5152},
	{1367.4978,248.1686,19.5669,65.0758},
	{2331.9136,75.0971,26.6210,270.3516},
	{2323.3054,7.6490,26.5641,261.8020},
	{-2155.2256,-2460.2200,30.8516,229.9331},
	{2472.6909,2034.1528,11.0625,86.1495},
	{-1213.7628,1830.4456,41.9297,313.5900},
	{-2672.2976,257.9233,4.6328,358.3635},
	{-1912.3514,827.9187,35.2235,318.9185},
	{2105.4502,-1806.5327,13.5547,87.5467},
	{2101.9077,2228.8237,11.0234,269.2685},
	{-19.2139,1175.2649,19.5634,358.8203},
	{-1816.6146,618.6354,35.1719,179.7207},
	{-2355.8574,1008.0900,50.8984,88.9870},
	{-1720.9807,1359.7946,7.1853,86.8492}
};

new EnterBank[11], Float:BankEnter[11][] = {
	{2304.7517,-16.1467,26.7422,268.0016},
	{1498.4426,-1580.9346,13.5498,180.8443},
	{-179.2425,1133.1390,19.7422,90.3347},
	{-1492.2368,920.1335,7.1875,87.2681},
	{-1951.0341,1345.1621,7.1875,176.3356},
	{-2384.0486,493.6162,29.8485,16.8743},
	{663.0396,1716.4036,7.1875,44.2278},
	{2331.3032,-37.8518,26.4844,2.7021},
	{-2079.4548,-2447.9775,30.6250,136.9842},
	{-1566.6234,-2730.2297,48.7435,57.2371},
	{648.7397,-519.3182,16.5537,179.1986}
};

new EnterHeal[3], Float:HealEnter[3][] = {
	{1996.6824,-2806.8184,1034.3130,89.3771},
	{1047.0361,-1419.1494,13.5469,315.0260},
	{419.8435,-1428.6061,32.4750,126.5311}
};

new EnterNews[4], Float:NewsEnter[4][] = {
	{1700.5284,-1667.7970,20.2188,277.2823},
	{1699.6305,-1667.9298,20.2053,86.9932},
	{-2521.1260,-624.9520,132.7841,359.3496},
	{2127.6152,2379.6575,10.8203,179.0658}
};

new EnterLSPD[4], Float:LSPDEnter[4][] = {
	{246.7645,62.3823,1003.6406,2.5405},
	{1555.4503,-1675.6365,16.1953,89.3992},
	{246.4181,87.9987,1003.6406,178.1311},
	{1568.6663,-1689.9708,6.2188,180.6701}
};

new EnterSFPD[4], Float:SFPDEnter[4][] = {
	{246.3688,107.2996,1003.2188,0.8041},
	{-1605.6157,710.3154,13.8672,1.8716},
	{228.2804,114.5602,999.0156,89.6688},
	{-1594.2100,716.1990,-4.9063,267.7969}
};


new EnterLVPD[6], Float:LVPDEnter[6][] = {
	{238.7242,138.6252,1003.0234,353.8579},
	{2287.0325,2432.3677,10.8203,180.2708},
	{288.8206,166.9211,1007.1719,356.3968},
	{2337.1477,2459.3127,14.9742,177.3309},
	{189.3048,179.3495,1003.0234,270.0732},
	{2268.0730,2449.2900,3.5313,179.2034}
};

new EnterCarShop[1], Float:CarShopEnter[1][3] = {
	{-1964.5717,293.9128,35.4739}
};

new EnterSkinShop[5], Float:SkinShopEnter[5][] = {
	{227.5392,-8.0925,1002.2109,90.3704},
	{208.8289,-3.5261,1001.2178,1.1057},
	{461.6891,-1500.8297,31.0455,99.1900},
	{-1694.2351,951.2882,24.8906,138.4404},
	{2802.8933,2430.6858,11.0625,133.6298}
};

new EnterLic[5], Float:LicEnter[5][] = {
	{-2026.9034,-103.6017,1035.1835,177.3516},
	{-2026.5833,-102.0645,35.1641,358.4210},
	{-2029.7496,-119.6231,1035.1719,1.3609},
	{-2029.7786,-120.5186,35.1692,179.0895},
	{-2032.6836,-117.0456,1035.1719,88.8884}
};

new Float:OilShop[14][3] = {
	{1939.2813,-1772.6681,13.3828},
	{-2026.7982,156.7993,29.0391},
	{-91.2318,-1169.2262,2.4254},
	{-1676.2755,413.4599,7.1797},
	{608.4686,1699.7107,6.9922},
	{618.9923,1684.8293,6.9922},
	{-1328.0400,2677.2769,50.0625},
	{-2244.2253,-2560.8813,31.9219},
	{-1605.3407,-2714.5852,48.5335},
	{-1471.2662,1863.7311,32.6328},
	{2114.8967,920.2439,10.8203},
	{2638.6284,1106.5261,10.8203},
	{2202.2200,2474.3464,10.8203},
	{655.6334,-564.9380,16.3359}
};

new Float:ATM[23][4] = {
 {1491.64, -1279.95, 14.27,90.00},
 { 1641.49, -1172.26, 23.59, 270.00},
 {2250.82, -1667.82, 15.13,255.48},
 {461.87, -1512.79, 30.63,1.38},
 {2820.09, -1468.37, 15.97, 90.00},
 { -1892.44, -844.35, 31.67, 90.00},
 { -107.03, -305.86, 1.13, 180.00},
 { -2636.56, 634.06, 14.15, 0.00},
 {-1980.34, 121.55, 27.29,0.00},
 {-2033.51, 164.61, 28.55, 180.00},
 {-2636.56, 634.06, 14.15,00.00},
 {-1829.21, -6.14, 14.84,180.00},
 {-2241.86, 170.92, 34.97,0.00},
 {-1823.97, 1284.36, 16.03,110.70},
 {1738.96, -1942.80, 13.25, 90.00},
 {1810.93, -1905.23, 13.25,0.00},
 { 1711.05, -1887.95, 13.25,90.00},
 {1918.69, -1766.31, 13.25,-90.00},
 {1364.10, -1751.19, 13.25, 0.00},
 {1225.59, -1811.40, 16.25,90.00},
 {1147.24, -1773.07, 16.25,-90.00},
 {1232.28, -1415.86, 13.11,-90.00},
 {1367.62, -1290.17, 13.11,0.00}
};

new LicWayCP[14];
new Float:LicWay[14][3] = {
	{-2046.9586,-86.5694,35.1641},
	{-2007.0529,-69.7360,35.1719},
	{-2003.9113,320.0869,35.0156},
	{-2251.5447,324.1804,35.1719},
	{-2388.4590,564.3949,24.7422},
	{-2526.5471,565.7004,14.4615},
	{-2606.0664,468.2997,14.4752},
	{-2606.6196,348.5225,4.1797},
	{-2539.9114,340.4572,19.7831},
	{-2706.0703,217.7127,4.1797},
	{-2706.2205,-70.8156,4.2969},
	{-2371.8567,-70.2986,35.2813},
	{-2256.2361,-190.2787,35.1719},
	{-2056.8123,-84.1440,33.8962}
};

new SpeedLimit[212]=
 {
     100,
     100,
     110,
     75,
     90,
     105,
     65,
     85,
     60,
     105,
     90,
     130,
     105,
     90,
     65,
     115,
     100,
     200,
     85,
     100,
     95,
     100,
     95,
     65,
     80,
     200,
     110,
     105,
     105,
     120,
     100,
     100,
     100,
     90,
     105,
     200,
     100,
     100,
     100,
     105,
     100,
     100,
     100,
     100,
     90,
     105,
     100,
     200,
     100,
     200,
     200,
     115,
     100,
     100,
     100,
     100,
     100,
     100,
     100,
     100,
     200,
     125,
     90,
     125,
     200,
     200,
     95,
     95,
     125,
     200,
     100,
     100,
     100,
     100,
     100,
     105,
     200,
     115,
     90,
     100,
     110,
     60,
     100,
     95,
     100,
     100,
     100,
     200,
     200,
     95,
     100,
     100,
     95,
     100,
     125,
     110,
     105,
     200,
     85,
     100,
     95,
     200,
     125,
     125,
     100,
     95,
     110,
     105,
     100,
     70,
     70,
     200,
     200,
     200,
     100,
     100,
     105,
     105,
     105,
     200,
     200,
     130,
     130,
     125,
     100,
     100,
     100,
     100,
     110,
     100,
     60,
     80,
     80,
     105,
     105,
     95,
     110,
     150,
     150,
     110,
     100,
     120,
     105,
     100,
     100,
     100,
     100,
     100,
     200,
     100,
     100,
     105,
     100,
     200,
     100,
	 95,
	 100,
	 100,
     105,
     110,
     105,
     100,
     110,
     200,
     200,
     105,
     105,
     110,
     95,
     200,
     200,
     75,
	 80,
	 100,
	 70,
     105,
     100,
     200,
     100,
     100,
     100,
     125,
     95,
     70,
     200,
     100,
     125,
     105,
     100,
     105,
     200,
     200,
     200,
     200,
     200,
     100,
     110,
     110,
     110,
     100,
     100,
     90,
     110,
     110,
     110,
     110,
     200,
     200,
     200,
     100,
     200,
     200
 };

new BusWay1CP[56];
new Float:BusWay1[56][3] = {
{1172.8124,-1795.3539,13.3984}, //остановка вокзал
{1172.1591,-1851.2037,13.3984}, //
{1062.9664,-1848.2230,13.4070}, //
{1031.5898,-1801.4495,13.6808}, //
{634.5229,-1726.6913,13.9320}, //
{618.4576,-1675.5269,15.9786}, //
{451.7307,-1649.8584,25.3436}, //
{416.1343,-1577.3604,26.3045}, //остановка зона нубов
{242.5642,-1564.2067,33.0469}, //
{288.8510,-1489.2726,32.6405}, //
{175.5464,-1514.1666,12.3063}, //
{135.3396,-1547.6410,9.0824}, //
{26.8942,-1520.2712,4.7021}, //
{-149.4385,-1362.5981,2.6953}, //
{-106.8014,-1163.4254,2.4543}, //остановка заправка
{-88.6031,-1028.8054,24.2301}, //
{-333.2401,-854.9522,46.9382}, //
{-832.3474,-1015.5784,84.9238}, //
{-1229.9556,-767.1780,63.9075}, //
{-1761.1101,-576.9548,16.3359}, //
{-1796.7521,-572.9200,16.1471}, //остановка аэропорт СФ
{-1998.8528,-577.0858,25.7189}, //
{-2207.5566,-435.5313,50.7888}, //
{-2251.7510,-190.1991,35.1719}, //
{-2164.0791,-71.5822,35.1719}, //
{-2027.5519,-74.9074,35.1719}, //остановка автошкола
{-2004.0858,29.1035,32.8200}, //
{-1988.4919,148.8784,27.539}, //остановка вокзал СФ
{-2004.2308,192.2453,27.5391}, //
{-1998.0333,342.5042,35.0156}, //
{-1884.7451,355.0289,24.6404}, //
{-1856.9990,413.0086,17.0078}, //
{-1751.4121,305.9853,7.0378}, //
{-1812.6744,185.7728,14.9545}, //
{-1800.6273,-113.9021,5.5065}, //
{-1820.3352,-559.7001,16.2089}, //
{-1764.6848,-618.6217,16.2089}, //
{-1471.6593,-822.6177,69.4837}, //
{-1025.7311,-451.0928,36.1467}, //остановка лес
{-837.1931,-460.3019,19.7632}, //
{-594.3066,-393.0822,22.5427}, //
{-414.0499,-650.7055,13.1884}, //остановка лес 2
{-353.4687,-781.0530,29.9236}, //
{-299.4134,-875.5771,46.7555}, //
{-138.8707,-977.9880,26.2650}, //
{-126.4457,-1184.6281,2.6953}, //остановка заправка 2
{-26.0111,-1520.8589,1.8203}, //
{77.7899,-1542.7198,5.4155}, //
{142.5287,-1573.4247,11.0393}, //
{590.7148,-1233.0121,17.7381}, //остановка ЛС1
{623.8369,-1220.2034,18.1094}, //
{636.2307,-1405.5137,13.4003}, //
{917.3973,-1404.3241,13.2604}, //
{917.2328,-1574.2738,13.3828}, //
{1037.4573,-1575.5863,13.3906}, //
{1173.1506,-1720.0890,13.6530} //last
};

new BusWay2CP[47];
new Float:BusWay2[47][3] = {
{1172.7560,-1790.0682,13.3984}, //Автовокзал ЛС - Шахта [Остановка, начало].
{1171.5629,-1850.2317,13.3984}, //Автовокзал ЛС - Шахта [вперёд].
{1062.9846,-1839.6010,13.3984}, //Автовокзал ЛС - Шахта [вперёд].
{632.0657,-1725.1920,13.3984}, //Автовокзал ЛС - Шахта [вперёд].
{633.5782,-1583.5798,15.5159}, //Автовокзал ЛС - Шахта [вперёд].
{527.4247,-1411.8955,15.9609}, //Автовокзал ЛС - Шахта [вперёд].
{416.1343,-1577.3604,26.3045}, //Автовокзал ЛС - Шахта [вперёд, остановка].
{242.4567,-1567.6064,33.0469}, //Автовокзал ЛС - Шахта [вперёд,].
{291.5942,-1489.7882,32.6328}, //Автовокзал ЛС - Шахта [вперёд,].
{174.4332,-1513.0138,12.2980}, //Автовокзал ЛС - Шахта [вперёд,].
{145.7362,-1554.4149,10.1600}, //Автовокзал ЛС - Шахта [вперёд,].
{-24.9694,-1514.6318,1.8203}, //Автовокзал ЛС - Шахта [вперёд,].
{-56.2009,-1592.5242,2.8049}, //Автовокзал ЛС - Шахта [вперёд,остановка].
{-262.7597,-2078.1731,37.3770}, //Автовокзал ЛС - Шахта [вперёд,].
{-412.0474,-2196.2671,56.1868}, //Автовокзал ЛС - Шахта [вперёд,].
{-652.6133,-2203.6963,10.9417}, //Автовокзал ЛС - Шахта [вперёд,].
{-909.4551,-2576.6526,90.5975}, //Автовокзал ЛС - Шахта [вперёд,].
{-1162.6802,-2534.2981,67.5377}, //Автовокзал ЛС - Шахта [вперёд,].
{-1155.2069,-2316.9329,39.3561}, //Автовокзал ЛС - Шахта [вперёд,].
{-967.4182,-1903.6266,80.5674}, //Автовокзал ЛС - Шахта [вперёд,]
{-1229.1490,-1761.4152,46.7733}, //Автовокзал ЛС - Шахта [вперёд,]
{-1561.2462,-1603.6075,37.6014}, //Автовокзал ЛС - Шахта [вперёд,]
{-1948.4923,-1802.8661,33.3022}, //Автовокзал ЛС - Шахта [вперёд,остановка [конец уже шахта кароч]]
{-2111.1594,-2080.4346,62.7150}, //Автовокзал ЛС - Шахта [назад]
{-2274.0330,-2214.6174,29.8240}, //Автовокзал ЛС - Шахта [назад]
{-2154.9583,-2316.0576,30.4688}, //Автовокзал ЛС - Шахта [назад]
{-2194.9568,-2367.2808,30.4688}, //Автовокзал ЛС - Шахта [назад]
{-2135.1169,-2425.7605,30.4679}, //Автовокзал ЛС - Шахта [назад, остановка]
{-1889.8102,-2699.7737,54.0938}, //Автовокзал ЛС - Шахта [назад, ]
{-1659.5231,-2728.1423,46.9236}, //Автовокзал ЛС - Шахта [назад, ]
{-1197.4600,-2869.0144,67.5188}, //Автовокзал ЛС - Шахта [назад, ]
{-925.9229,-2873.4299,66.1056}, //Автовокзал ЛС - Шахта [назад, ]
{-461.0765,-2812.8828,47.3825}, //Автовокзал ЛС - Шахта [назад, ]
{-102.1841,-2875.4199,39.1871}, //Автовокзал ЛС - Шахта [назад, ]
{9.5317,-2662.2532,40.2624}, //Автовокзал ЛС - Шахта [назад, ]
{-103.4904,-2446.4006,33.5668}, //Автовокзал ЛС - Шахта [назад, ]
{-294.2041,-2166.9790,28.3660}, //Автовокзал ЛС - Шахта [назад, остановка]
{-299.1349,-1790.9738,16.3041}, //Автовокзал ЛС - Шахта [назад, ]
{-93.2886,-1439.2714,12.6560}, //Автовокзал ЛС - Шахта [назад, ]
{95.1576,-1282.9722,13.9752}, //Автовокзал ЛС - Шахта [назад, ]
{613.1348,-1210.8169,18.1094}, //Автовокзал ЛС - Шахта [назад, ]
{794.4287,-1054.8755,24.6742}, //Автовокзал ЛС - Шахта [назад, ]
{796.4398,-1321.6128,13.3828}, //Автовокзал ЛС - Шахта [назад, ]
{768.6549,-1586.7654,13.3828}, //Автовокзал ЛС - Шахта [назад, ]
{948.4907,-1572.5338,13.3828}, //Автовокзал ЛС - Шахта [назад, ]
{1038.9674,-1712.6021,13.3906}, //Автовокзал ЛС - Шахта [назад, ]
{1172.9412,-1712.5641,13.6152} //Автовокзал ЛС - Шахта [назад, ]
};

new BusWay3CP[62];
new Float:BusWay3[62][3] = {
{-1990.8595,141.8284,27.0882}, // SF-LV 1 остановка
{-2003.3416,225.4615,27.5427}, // SF 1
{-1968.8982,342.3442,33.7743}, // SF 1
{-1868.1058,403.3581,16.5784}, // SF 1
{-1825.2825,381.0478,16.5671}, // SF 1
{-1795.2860,381.0595,16.6211}, // SF 1
{-1692.8931,504.5988,37.8234}, // SF 1
{-1499.2548,705.9402,45.1175}, // SF 1
{-1248.7758,969.1033,44.0531}, // SF 1
{-1056.7657,1177.8210,38.4651}, // SF 1
{-914.6689,957.4551,17.7449}, // SF 1
{-809.9587,724.3736,18.0885}, // SF 1 остановка
{-592.4773,623.3843,16.1776}, // SF 1
{-394.2008,554.4457,16.3075}, // SF 1
{-206.8979,554.6874,15.4962}, // SF 1
{46.8461,636.1328,6.3865}, // SF 1
{243.8143,736.2823,5.6824}, // SF 1
{518.0807,688.4302,3.0015}, // SF 1
{938.3864,721.5280,10.2535}, // SF 1
{1322.1335,830.6735,6.7760}, // SF 1
{1599.0989,831.7397,6.2959}, // SF 1
{1889.2107,831.2679,7.8757}, // SF 1
{2138.0591,831.4192,6.2887}, // SF 1
{2275.2412,763.9557,10.2086}, // SF 1
{2289.1042,867.1279,12.7342}, // SF 1
{2290.1321,958.4311,10.2246}, // SF 1
{2349.2585,996.1227,10.3762}, // SF 1
{2480.9116,1071.3127,10.2316}, // SF 1
{2609.4336,1089.5491,10.2241}, // SF 1
{2609.8567,1230.6749,10.2263}, // SF 1
{2629.4734,1300.3207,10.2263}, // SF 1
{2787.5676,1311.2920,10.3044}, // SF 1
{2805.5703,1271.7849,10.3028}, // SF-LV 1 остановка
{2828.7935,1273.2805,10.3342}, // LV-SF 2
{2829.5388,1384.8187,10.3014}, // LV 2
{2810.1482,1475.4434,10.2268}, // LV 2
{2799.2576,1488.8718,10.2174}, // LV 2
{2728.6169,1676.5261,6.2888}, // LV 2
{2705.5820,1871.0105,6.2897}, // LV 2
{2705.6006,1673.5664,6.2965}, // LV 2
{2705.3374,1482.3838,6.2888}, // LV 2
{2704.6448,1316.7666,6.2887}, // LV 2
{2666.0083,982.7618,6.2889}, // LV 2
{2514.1921,866.3497,6.2888}, // LV 2
{2270.3057,854.7201,6.2890}, // LV 2
{1963.0859,855.6766,6.2888}, // LV 2
{1553.4552,854.6754,6.3641}, // LV 2 остановка
{1339.9230,920.2668,9.9849}, // LV 2
{1125.0372,854.0715,10.2264}, // LV 2
{473.7981,742.1688,4.2100}, // LV 2
{104.7299,697.6450,5.2431}, // LV 2
{-837.3538,887.9962,24.1298}, // LV 2
{-875.7713,1143.0646,27.5279}, // LV 2
{-1023.0518,1284.8820,39.6654}, // LV 2
{-1187.7139,1065.7623,40.3983}, // LV 2
{-1536.4631,698.2032,44.5227}, // LV 2
{-1720.5616,513.6122,37.9529}, // LV 2 Остановка
{-1845.4368,410.3215,16.5685}, // LV 2
{-1884.4779,381.7485,19.9367}, // LV 2
{-1980.9962,349.8148,34.2000}, // LV 2
{-2009.9744,132.1836,27.0906}, // LV 2
{-1990.5718,122.2476,27.0910} // LV-SF 2
};

new BusWay4CP[104];
new Float:BusWay4[104][3] = {
{1171.5367,-1764.6722,13.3984}, // прямо начало Автовокзал Лос-Сантос
{1174.5341,-1854.4078,13.3984}, // налево
{1313.1389,-1853.9850,13.3828}, // налево
{1349.8649,-1486.1635,13.3828}, // остановка - город Лос-Сантос
{1380.9713,-948.9398,34.1875}, // направо
{1438.6246,-958.0419,36.1103}, // прямо
{1503.4082,-991.1022,38.6307}, // налево
{1707.5061,-792.8298,55.0801}, // прямо
{1715.5735,-494.1959,33.7726}, // остановка - Вайнвуд
{1679.7882,-215.9453,41.3093}, // прямо
{1621.3013,79.7979,37.4542}, // остановка Туманный округ
{1637.0209,171.3534,33.9872}, // прямо
{1806.8042,850.6791,10.6719}, // налево
{1492.2131,854.7557,6.8125}, // прямо
{1229.0901,1196.6672,6.8201}, // прямо
{1234.1752,1412.9181,6.7968}, // остановка Военкомат
{1229.2908,1638.9471,6.7344}, // прямо
{1229.1107,1915.6931,6.7344}, // прямо
{1234.5670,2075.1228,6.8032}, // остановка город Лас-Вентурас
{1231.8429,2165.2454,6.7322}, // направо
{1135.7864,2476.4297,10.5938}, // прямо
{832.9174,2643.8792,12.5446}, // налево
{616.7515,2422.1370,30.2654}, // остановка База ВВС
{652.3896,2126.5713,18.5956}, // прямо
{660.6614,1917.5760,5.4523}, // налево
{728.0634,1912.7813,5.5432}, // прямо
{807.0814,1912.8198,5.5912}, // направо
{803.4636,1857.7159,4.1793}, // остановка Аммуниция
{808.5961,1818.9714,3.6063}, // прямо
{818.4614,1743.8154,4.5265}, // остановка Стрельбище ЛВ
{857.9393,1605.3373,13.8407}, // прямо
{786.5284,1313.4502,24.9907}, // прямо
{752.5970,1122.4445,28.3435}, // остановка Карьер
{549.1507,1062.4658,28.3488}, // прямо
{382.5381,1019.4789,28.4043}, // прямо
{229.7375,976.3882,28.1985}, // направо
{187.1840,1143.8436,14.6690}, // налево
{121.3815,1197.7913,17.8624}, // прямо
{-67.8355,1264.2196,11.4877}, // прямо
{-119.7190,1256.9504,18.0527}, // прямо
{-165.1759,1252.5626,21.0713}, // остановка Форт Карсон
{-299.8282,1251.4303,23.4449}, // прямо
{-434.2424,1429.2164,33.1418}, // прямо
{-440.9047,1519.3510,35.0477}, // остановка Шахта ЛВ
{-450.4685,1597.3883,35.7136}, // прямо
{-398.7126,1744.6490,42.1393}, // прямо
{-400.1481,1917.7140,58.0591}, // прямо
{-440.4884,1763.8127,72.0137}, // прямо
{-466.2252,1962.2617,83.2076}, // прямо
{-381.7823,2076.7620,60.7871}, // прямо
{-437.3651,2058.9409,61.3481}, // остановка Дамба
{-453.4352,2034.9032,60.6354}, // прямо
{-552.4039,2016.8472,60.1875}, // прямо
{-872.2288,2005.5400,60.1865}, // прямо
{-863.1266,1882.2052,60.2756}, // прямо
{-943.3944,1808.0164,60.6386}, // прямо
{-1166.9771,1798.0576,40.0002}, // налево
{-1093.8438,1739.8168,32.8084}, // остановка Тьерра Робада
{-918.9678,1707.4832,27.3892}, // прямо
{-859.6197,1611.7637,26.9088}, // прямо
{-850.9847,1556.4548,24.3012}, // остановка Лас-Барранкас
{-849.9731,1491.8464,18.1757}, // прямо
{-772.5269,1284.7063,13.6029}, // прямо
{-577.8066,1112.2632,10.9377}, // прямо
{-401.8378,1007.0869,10.8613}, // прямо
{-306.7384,873.2795,9.4907}, // остановка Форт Карсон Амуниция
{-295.8213,811.3220,14.6597}, // прямо
{-124.5559,819.6336,20.7173}, // прямо
{50.0233,884.0092,24.0745}, // прямо
{222.8621,965.6207,28.1953}, // направо
{259.7074,887.3636,22.2099}, // прямо
{386.5923,653.1882,14.4337}, // прямо
{617.1341,314.0141,19.6599}, // направо
{511.7259,236.0303,13.9245}, // налево
{518.2139,145.8706,23.9645}, // прямо
{528.5486,-20.3800,28.2069}, // прямо
{524.1663,-137.4631,37.8584}, // прямо
{466.6447,-406.4734,28.0867}, // прямо
{416.7831,-582.9189,37.5815}, // прямо
{339.6236,-827.9775,10.8657}, // прямо
{249.8282,-1019.8699,56.6830}, // прямо
{153.5286,-1205.5427,48.6447}, // прямо
{166.0750,-1403.3745,46.6364}, // направо
{91.1895,-1543.5619,5.9204}, // налево
{144.6835,-1569.0822,10.9400}, // налево
{185.2294,-1522.5171,12.4186}, // направо
{285.9365,-1493.2190,32.6328}, // направо
{240.7941,-1569.0166,33.0469}, // налево
{321.7283,-1587.5078,33.1094}, // прямо
{397.1686,-1597.2783,28.4761}, // остановка отель Лос-Сантос
{441.8901,-1593.3827,25.3047}, // прямо
{527.7913,-1593.5065,16.0078}, // прямо
{635.0415,-1588.0699,15.5258}, // налево
{642.2968,-1490.2092,14.5999}, // остановка Причал Лос-Сантос
{641.5861,-1409.2844,13.5116}, // направо
{793.2867,-1407.7059,13.3760}, // прямо
{914.8438,-1408.2942,13.2253}, // прямо
{1020.5044,-1410.5480,13.0423}, // остановка Маркет Лос-Сантос
{1058.0544,-1408.5636,13.3867}, // направо
{1048.5663,-1492.2472,13.3896}, // прямо
{1035.2122,-1570.7897,13.3906}, // прямо
{1036.7708,-1713.1725,13.3906}, // налево
{1170.2275,-1714.6497,13.6729}, // направо
{1170.0852,-1763.6837,13.3984} // конец маршрута Автовокзал Лос-Сантос
};

new sName[][] = {
	"Пистолет 9мм",
	"Пистолет 9мм с глушителем",
	"Пустынный орёл",
	"Дробовик",
	"Обрез",
	"Боевой дробовик",
	"УЗИ",
	"МП5",
	"АК-47",
	"М4",
	"Снайперская винтовка"};

new wName[][] = {
	"Кулак","Кастет","Клюшка","Полицейская дубинка","Нож",
	"Бейсбольная бита","Лопата","Кий","Катана","Бензопила",
	"Фиолетовый вибратор","Белый вибратор","Длинный белый вибратор","Серебряный вибратор","Цветы",
	"Трость","Граната","Слезоточивый газ","Коктейль Молотова","","","","9ММ","9ММ с глушителем",
	"Пустынный орел","Дробовик","Обрез","Боевой дробовик","УЗИ",
	"МП5","АК-47","М4","ТЕК-9","Винтовка",
	"Снайперская винтовка","РПГ","Самонаводящийся гранатомет","Огнемет","Миниган",
	"C4","Детонатор","Балончик с краской","Огнетушитель","Камера",
	"Очки ночного видения","Тепловизор","Парашют","","",
	"Задавил","Зарезал винтом","Взрыв"};

new vName[][] = {
	"Landstalker","Bravura","Buffalo","Linerunner","Pereniel","Sentinel","Dumper","Firetruck","Trashmaster","Stretch",
	"Manana","Infernus","Voodoo","Pony","Mule","Cheetah","Ambulance","Leviathan","Moonbeam","Esperanto","Taxi","Washington",
	"Bobcat","Mr. Whoopee","BF Injection","Hunter","Premier","Enforcer","Securicar","Banshee","Predator","Bus","Rhino",
	"Barracks","Hotknife","Trailer","Previon","Coach","Cabbie","Stallion","Rumpo","RC Bandit","Romero","Packer","Monster",
	"Admiral","Squalo","Seasparrow","Pizzaboy","Tram","Trailer","Turismo","Speeder","Reefer","Tropic","Flatbed","Yankee",
	"Caddy","Solair","Berkley's RC Van","Skimmer","PCJ-600","Faggio","Freeway","RC Baron","RC Raider","Glendale","Oceanic",
	"Sanchez","Sparrow","Patriot","Quad","Coastguard","Dinghy","Hermes","Sabre","Rustler","ZR350","Walton","Regina","Comet",
	"BMX","Burrito","Camper","Marquis","Baggage","Dozer","Maverick","News Chopper","Rancher","FBI Rancher","Virgo","Greenwood",
	"Jetmax","Hotring Racer","Sandking","Blista Compact","Police Maverick","Boxville","Benson","Mesa","RC Goblin","Hotring Racer A",
	"Hotring Racer B","Bloodring Banger","Rancher","Super GT","Elegant","Journey","Bike","Mountain Bike","Beagle","Cropdust",
	"Stunt","Tanker","Road Train","Nebula","Majestic","Buccaneer","Shamal","Hydra","FCR-900","NRG-500","HPV1000","Cement Truck",
	"Tow Truck","Fortune","Cadrona","FBI Truck","Willard","Forklift","Tractor","Combine","Feltzer","Remington","Slamvan",
	"Blade","Freight","Streak","Vortex","Vincent","Bullet","Clover","Sadler","Firetruck","Hustler","Intruder","Primo",
	"Cargobob","Tampa","Sunrise","Merit","Utility","Nevada","Yosemite","Windsor","Monster","Monster","Uranus","Jester",
	"Sultan","Stratum","Elegy","Raindance","RC Tiger","Flash","Tahoma","Savanna","Bandito","Freight","Trailer","Kart","Mower",
	"Duneride","Sweeper","Broadway","Tornado","AT-400","DFT-30","Huntley","Stafford","BF-400","Newsvan","Tug","Trailer",
	"Emperor","Wayfarer","Euros","Hotdog","Club","Trailer","Trailer","Andromada","Dodo","RC Cam","Launch","Police Car LSPD",
	"Police Car SFPD","Police Car LVPD","Police Ranger","Picador","S.W.A.T. Van","Alpha","Phoenix","Glendale","Sadler",
	"Luggage Trailer","Luggage Trailer","Stair Trailer","Boxville","Farm Plow","Utility Trailer"};

new City[][] = {"Лос Сантос", "Сан Фиерро", "Лас Вентурас"};
	
new CarsForShop[][3] = {
{411, 3000000, 30},
{494, 2000000, 25},
{502, 2000000, 25},
{503, 2000000, 25},
{541, 1500000, 20},
{451, 1500000, 20},
{415, 1200000, 20},
{477, 800000, 12},
{402, 800000, 15},
{480, 800000, 12},
{506, 750000, 10},
{562, 700000, 10},
{495, 600000, 10},
{475, 300000, 8},
{567, 400000, 8},
{426, 350000, 7},
{522, 1000000, 15},
{536, 250000, 5},
{603, 350000, 5},
{560, 500000, 15},
{602, 450000, 7},
{534, 100000, 3},
{439, 150000, 5},
{412, 100000, 5},
{434, 150000, 3},
{507, 200000, 5},
{587, 250000, 5},
{565, 400000, 5},
{542, 50000, 1},
{518, 30000, 1},
{405, 100000, 3},
{445, 150000, 5},
{589, 150000, 3},
{496, 125000, 3},
{521, 700000, 15},
{461, 500000, 10},
{566, 200000, 3},
{535, 200000, 3},
{555, 150000, 3},
{570, 100000, 2},
{576, 100000, 3},
{526, 150000, 3},
{575, 75000, 2},
{409, 300000, 5},
{551, 100000, 4},
{517, 50000, 2},
{516, 100000, 1},
{458, 100000, 4},
{558, 200000, 2},
{549, 25000, 1},
{561, 150000, 5},
{421, 100000, 2},
{580, 150000, 5},
{581, 300000, 5},
{585, 150000, 1},
{527, 100000, 1},
{474, 100000, 2},
{419, 100000, 3},
{436, 125000, 1},
{529, 125000, 1},
{491, 50000, 1},
{540, 150000, 3},
{545, 250000, 3},
{400, 100000, 3},
{466, 75000, 2},
{401, 100000, 2},
{550, 100000, 4},
{463, 350000, 8},
{586, 300000, 5},
{468, 300000, 6},
{547, 75000, 1},
{492, 100000, 2},
{467, 75000, 2},
{479, 100000, 2},
{489, 150000, 4},
{404, 75000, 2},
{410, 50000, 1},
{462, 10000, 1},
{471, 15000, 1},
{508, 50000, 2},
{572, 10000, 1}
};

new symbols[][] = {"0","1","2","3","4","5","6","7","8","9","A","B","C","D","E","F","G","H","I","K","L","M","N","O","P","Q","R","S","T","V","U","X","J","Y","W","Z"};

new vMaxSeats[212] = {
4,2,2,2,4,4,1,2,2,4,2,2,2,4,2,2,4,2,4,2,4,4,2,2,2,1,4,4,4,2,1,9,1,2,2,1,2,9,4,2,
4,1,2,2,2,4,1,2,1,6,1,2,1,1,1,2,2,2,4,4,2,2,2,2,2,2,4,4,2,2,4,2,1,1,2,2,1,2,2,4,
2,1,4,3,1,1,1,4,2,2,4,2,4,1,2,2,2,4,4,2,2,2,2,2,2,2,2,4,2,1,1,2,1,1,2,2,4,2,2,1,
1,2,2,2,2,2,2,2,2,4,1,1,1,2,2,2,2,0,0,1,4,2,2,2,2,2,4,4,2,2,4,4,2,1,2,2,2,2,2,2,
4,4,2,2,1,2,4,4,1,0,0,1,1,2,1,2,2,2,2,4,4,2,4,1,1,4,2,2,2,2,6,1,2,2,2,1,4,4,4,2,
2,2,2,2,4,2,1,1,1,4,1,1
};

stock IsSeatTaken(vehicleid, seatid)
{
    for(new i;i<PLAYERS;i++)
    {
        if(GetPlayerVehicleID(i) == vehicleid && GetPlayerVehicleSeat(i) == seatid) return true;
    }
    return false;
}

stock CheckPlayerSeat(playerid)
{
	new vid = GetPlayerVehicleID(playerid);
	new model = GetVehicleModel(vid);
	new maxs = vMaxSeats[model-400];
	new seat = GetPlayerVehicleSeat(playerid);
	//format(glstr,sizeof(glstr),"Model ID: %d | MaxSeats: %d | Your seat: %d", model, maxs, seat+1);
	//SendClientMessage(playerid, -1, glstr);
	if(maxs < seat+1) 
	{
		switch(model)
		{
			case 401,410,412,419,424,436,439,449,475,477,491,500,517,518,526,527,533,534,536,542,545,549,559,562,565,575,576,587,589,602: 
			{
				return true;
			}
			default: 
			{
				RemovePlayerFromVehicle(playerid);
				return SendClientMessage(playerid, COLOR_ERROR, "Ты сел на несуществующее место в транспорте");
			}
		}
	}
	return true;
}

stock IsNumeric(const string[]) {
    new length=strlen(string);
    if (length==0) return false;
    for (new i = 0; i < length; i++) {
        if (
        (string[i] > '9' || string[i] < '0' && string[i]!='-' && string[i]!='+')
        || (string[i]=='-' && i!=0)
        || (string[i]=='+' && i!=0)
        ) return false;
    }
    if (length==1 && (string[0]=='-' || string[0]=='+')) return false;
    return true;
}

new fPay[10][12] = {
	{1000,1000,1000,900,900,900,1000,1000,1000,900,900,900}, // 12 фракций зп 1 рангов
	{1400,1400,1400,1300,1300,1300,1300,1300,1300,1200,1200,1200}, // 12 фракций зп 2 рангов
	{1700,1700,1700,1800,1800,1800,1700,1700,1700,1400,1400,1400}, // 12 фракций зп 3 рангов
	{2000,2000,2000,2200,2200,2200,2200,2200,2200,1600,1600,1600}, // 12 фракций зп 4 рангов
	{2400,2400,2400,2500,2500,2500,2500,2500,2500,2200,2200,2200}, // 12 фракций зп 5 рангов
	{2750,2750,2750,2700,2700,2700,2650,2650,2650,2500,2500,2500}, // 12 фракций зп 6 рангов
	{2900,2900,2900,3200,3200,3200,2800,2800,2800,2800,2800,2800}, // 12 фракций зп 7 рангов
	{3250,3250,3250,3600,3600,3600,3450,3450,3450,3300,3300,3300}, // 12 фракций зп 8 рангов
	{3750,3750,3750,3900,3900,3900,3850,3850,3850,3800,3800,3800}, // 12 фракций зп 9 рангов
	{4500,4500,4500,4300,4300,4300,4400,4400,4400,4300,4300,4300}// 12 фракций зп 10 рангов
};

new fName[][] = {"Не состоит",
	"Больница Лос-Сантоса",
	"Больница Сан-Фиерро",
	"Больница Лас-Вентураса",
	"Полиция Лос-Сантоса",
	"Полиция Сан-Фиерро",
	"Полиция Лас-Вентураса",
	"Радиоцентр Лос-Сантоса",
	"Радиоцентр Сан-Фиерро",
	"Радиоцентр Лас-Вентураса",
	"Сухопутные войска",
	"Военно-морской флот",
	"Военно-воздушные силы"
};

static rName[10][12][32] = {
{{"Интерн"},{"Интерн"},{"Интерн"},{"Рядовой"},{"Рядовой"},{"Рядовой"},{"Помощник редакции"},{"Помощник редакции"},{"Помощник редакции"},{"Рядовой"},{"Матрос"},{"Рядовой"}},
{{"Младший мед. работник"},{"Младший мед. работник"},{"Младший мед. работник"},{"Сержант"},{"Сержант"},{"Сержант"},{"Верстальщик новостей"},{"Верстальщик новостей"},{"Верстальщик новостей"},{"Сержант"},{"Старший матрос"},{"Сержант"}},
{{"Старший мед. работник"},{"Старший мед. работник"},{"Старший мед. работник"},{"Старший сержант"},{"Старший сержант"},{"Старший сержант"},{"Радиотехник"},{"Радиотехник"},{"Радиотехник"},{"Старший сержант"},{"Старшина второй статьи"},{"Старший сержант"}},
{{"Участковый врач"},{"Участковый врач"},{"Участковый врач"},{"Лейтенант"},{"Лейтенант"},{"Лейтенант"},{"Журналист"},{"Журналист"},{"Журналист"},{"Старшина"},{"Старшина первой статьи"},{"Лейтенант"}},
{{"Врач терапевт"},{"Врач терапевт"},{"Врач терапевт"},{"Старший лейтенант"},{"Старший лейтенант"},{"Старший лейтенант"},{"Старший журналист"},{"Старший журналист"},{"Старший журналист"},{"Лейтенант"},{"Мичман"},{"Старший лейтенант"}},
{{"Хирург"},{"Хирург"},{"Хирург"},{"Капитан"},{"Капитан"},{"Капитан"},{"Корректор"},{"Корректор"},{"Корректор"},{"Старший лейтенант"},{"Лейтенант"},{"Капитан"}},
{{"Младший специалист"},{"Младший специалист"},{"Младший специалист"},{"Майор"},{"Майор"},{"Майор"},{"Помощник редактора"},{"Помощник редактора"},{"Помощник редактора"},{"Капитан"},{"Капитан 3 ранга"},{"Майор"}},
{{"Старший специалист"},{"Старший специалист"},{"Старший специалист"},{"Подполковник"},{"Подполковник"},{"Подполковник"},{"Редактор"},{"Редактор"},{"Редактор"},{"Майор"},{"Капитан 2 ранга"},{"Подполковник"}},
{{"Заведующий отделением"},{"Заведующий отделением"},{"Заведующий отделением"},{"Полковник"},{"Полковник"},{"Полковник"},{"Зам. директора"},{"Зам. директора"},{"Зам. директора"},{"Полковник"},{"Капитан 1 ранга"},{"Полковник"}},
{{"Глав. врач"},{"Глав. врач"},{"Глав. врач"},{"Генерал"},{"Генерал"},{"Генерал"},{"Директор"},{"Директор"},{"Директор"},{"Генерал"},{"Адмирал"},{"Генерал"}}
};

new Float:jailspawn[4][3] = {{215.6840,110.0987,999.0156}, {219.7480,109.6028,999.0156}, {223.7151,109.8798,999.0156}, {227.6056,110.0132,999.0156}};
new Float:outjailspawn[3][5] = {{264.3620,81.5238,1001.0391,270.0}, {201.1496,168.1520,1003.0234,90.0}, {222.4222,114.9915,999.0156,90.0}};
new outjailint[3] = {6,3,10};

stock SetPlayerFactionColor(playerid)
{
	switch(PI[playerid][Faction])
	{
	    case 1,2,3: SetPlayerColor(playerid, 0xCD5C5CFF);
	    case 4,5,6: SetPlayerColor(playerid, 0x0000FFFF);
	    case 7,8,9: SetPlayerColor(playerid, 0xFF8000FF);
	    case 10,11,12: SetPlayerColor(playerid, 0x804000FF);
	    case 0: SetPlayerColor(playerid, 0xFFFFFF70);
	}
}

stock specOff(playerid)
{
	TogglePlayerSpectating(playerid, false);
	spawnPlayer(playerid);
}

stock specPrev(playerid)
{
	for(new i=GetPVarInt(playerid, "SpecID");i>=0;i--)
	{
		if(i < 0) 
		{
			i = PLAYERS-1;
			continue;
		}
		if(i == GetPVarInt(playerid, "SpecID") || GetPVarInt(i, "InSpec") == 1 || i == playerid || !InGame(i)) continue;
		else if(GetPVarType(i, "FlyMode") == 1) continue;
		else if(GetPVarType(i, "InCarShop") == 1) continue;
		else if(GetPVarType(i, "InSkinShop") == 1) continue;
		specPlayer(playerid, i);
		break;
	}
}

stock specNext(playerid)
{
	for(new i=GetPVarInt(playerid, "SpecID");i<=PLAYERS;i++)
	{
		if(i == PLAYERS-1) 
		{
			i = -1; 
			continue;
		}
		if(i == GetPVarInt(playerid, "SpecID") || GetPVarInt(i, "InSpec") == 1 || i == playerid || !InGame(i)) continue;
		else if(GetPVarType(i, "FlyMode") == 1) continue;
		else if(GetPVarType(i, "InCarShop") == 1) continue;
		else if(GetPVarType(i, "InSkinShop") == 1) continue;
		specPlayer(playerid, i);
		break;
	}
}

stock specPlayer(playerid, specid)
{
	if(GetPVarInt(specid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в наблюдении");
	else if(GetPVarType(specid, "FlyMode") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в режиме наблюдения");
	else if(GetPVarType(specid, "InCarShop") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в автосалоне");
	else if(GetPVarType(specid, "InSkinShop") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в магазине одежды");
	if(GetPVarInt(playerid, "InSpec") == 0)
	{
		GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
		SetPVarInt(playerid, "InSpecInt", GetPlayerInterior(playerid));
		SetPVarInt(playerid, "InSpecWorld", GetPlayerVirtualWorld(playerid));
		SetPVarInt(playerid, "InSpec", 1);
	}
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(GetPVarInt(i, "SpecID") == playerid) specOff(i);
	}
	SetPVarInt(playerid, "SpecID", specid);
	SetPlayerInterior(playerid,GetPlayerInterior(specid));
	SetPlayerVirtualWorld(playerid,GetPlayerVirtualWorld(specid));
	TogglePlayerSpectating(playerid, true);
	if(IsPlayerInAnyVehicle(specid))
	{
		PlayerSpectateVehicle(playerid, GetPlayerVehicleID(specid));
	} else {
		PlayerSpectatePlayer(playerid, specid);
	}
	return true;
}

stock ApplyAnimationEx(playerid, animlib[], animname[], Float:p1, p2, p3, p4, p5, p6)
{
    ApplyAnimation(playerid, animlib, animname, p1, p2, p3, p4, p5, p6);
    SetPVarString(playerid, "animlib", animlib);
    SetPVarString(playerid, "animname", animname); 
    SetTimerEx("UpdatePlayerAnimation", 200, 0, "ifiiiii", playerid, p1, p2, p3, p4, p5, p6);
    return 1;
}

forward UpdateAnimation(playerid, Float:p1, p2, p3, p4, p5, p6);
public UpdateAnimation(playerid, Float:p1, p2, p3, p4, p5, p6)
{
    new animl[30], animn[30], animlib[30], animname[30];
    GetPVarString(playerid, "animlib", animlib, sizeof(animlib));
    GetPVarString(playerid, "animname", animname, sizeof(animname)); 
    GetAnimationName(GetPlayerAnimationIndex(playerid), animl, sizeof(animl), animn, sizeof(animn));
    if(strcmp(animl, animlib, true) != 0 && strcmp(animn, animname, true) != 0) ApplyAnimation(playerid, animlib, animname, p1, p2, p3, p4, p5, p6);
    return 1;
}

forward RespawnVehicle(vehicleid);
public RespawnVehicle(vehicleid)
{
	SetVehicleToRespawn(vehicleid);
	for(new i;i<PLAYERS;i++)
	{
	    if(!InGame(i)) continue;
	    if(vehicleid == PIcar[i][CarGUID])
	    {
			DestroyPlayerCar(i);
	        SpawnPlayerCar(i);
			Engine[i] = false;
			break;
	    }
	}
}

forward EndJob(playerid);
public EndJob(playerid)
{
	SetPVarInt(playerid, "IsOnJob", 0);
	SendClientMessage(playerid, -1, "Ты окончил рабочий день");
	TogglePlayerAllDynamicRaceCPs(playerid, false);
	DestroyDynamic3DTextLabel(BusLabel[playerid]);
}

forward fKick(playerid);
public fKick(playerid)
{
	Kick(playerid);
}

forward LoginCamera(playerid);
public LoginCamera(playerid)
{
	SetPlayerPos(playerid, 1415.4846,-807.6131,85.0565);
	InterpolateCameraPos(playerid, 1133.0504,-2038.4034,69.0966, 1371.5270,-904.0517,70.0, 3000);
	InterpolateCameraLookAt(playerid, 726.0464,-1788.3375,22.2734, 1415.4846,-807.6131,85.0565, 2000); 
}

forward DeleteAccountSQL();
public DeleteAccountSQL()
{
	new _accountId, _houseId;
	if(cache_num_rows() == 1)
	{
		cache_get_value_name_int(0, "ID", _accountId);
		cache_get_value_name_int(0, "House", _houseId);
		mysql_format(mysql1, query1, sizeof(query1), "DELETE FROM `users` WHERE `ID` = '%d'", _accountId);
		mysql_query(mysql1, query1, false);
		mysql_format(mysql1, query1, sizeof(query1), "DELETE FROM `penalty` WHERE `PlayerID` = '%d'", _accountId);
		mysql_query(mysql1, query1, false);
		mysql_format(mysql1, query1, sizeof(query1), "DELETE FROM `cars` WHERE `PlayerID` = '%d'", _accountId);
		mysql_query(mysql1, query1, false);
		if(_houseId != 0)
		{
			mysql_format(mysql1, query1,sizeof(query1),"UPDATE `houses` SET `Owner` = '0' WHERE `ID` = '%d'", _houseId);
			mysql_query(mysql1, query1, false);
		}
	}
}

stock InSelfie(playerid, Float:angle)
{
	if(IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Чтобы сделать селфи, нужно выйти из транспорта");
	else if(GetPVarInt(playerid, "InSkinShop") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Сейчас ты не можешь этого сделать");
	else if(GetPVarInt(playerid, "InCarShop") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Сейчас ты не можешь этого сделать");
	else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Сейчас ты не можешь этого сделать");
	else if(GetPVarInt(playerid, "FlyMode") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Сейчас ты не можешь этого сделать");
	PlayerPlaySound(playerid, 17001, 0.0, 0.0, 0.0);
	TogglePlayerControllable(playerid, false);
	GetPlayerPos(playerid,PI[playerid][X],PI[playerid][Y],PI[playerid][Z]); 
	static Float: n1X, Float: n1Y; 
	n1X = PI[playerid][X] + S_Radius * floatcos(angle+90.0, degrees); 
	n1Y = PI[playerid][Y] + S_Radius * floatsin(angle+90.0, degrees); 
	SetPlayerAttachedObject(playerid, 0, PI[playerid][PhoneObject], 6, 0.06, 0.01, 0.08, 180.0, 90.0, 0.0); 
	SetPlayerCameraPos(playerid, n1X, n1Y, PI[playerid][Z] + 0.7); 
	SetPlayerCameraLookAt(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z] + S_Height[playerid]); 
	SetPlayerFacingAngle(playerid, angle); 
	ApplyAnimation(playerid, "PED", "gang_gunstand", 4.1, 1, 1, 1, 1, 1, 1);
	PlayerTextDrawShow(playerid, S_Joystick[playerid]); 
	PlayerTextDrawShow(playerid, S_UP[playerid]); 
	PlayerTextDrawShow(playerid, S_DOWN[playerid]); 
	PlayerTextDrawShow(playerid, S_LEFT[playerid]); 
	PlayerTextDrawShow(playerid, S_RIGHT[playerid]); 
	PlayerTextDrawShow(playerid, S_BACK[playerid]); 
	SelectTextDraw(playerid, 0xFFFFFF80);
	SetPVarInt(playerid, "InSelfie", 1);
	return true;
}

stock OutSelfie(playerid)
{
	TogglePlayerControllable(playerid, true); 
	SetCameraBehindPlayer(playerid); 
	RemovePlayerAttachedObject(playerid, 0); 
	ApplyAnimation(playerid, "PED", "ATM", 4.1, 0, 1, 1, 0, 1, 1); 
	PlayerTextDrawHide(playerid, S_Joystick[playerid]); 
	PlayerTextDrawHide(playerid, S_UP[playerid]); 
	PlayerTextDrawHide(playerid, S_DOWN[playerid]); 
	PlayerTextDrawHide(playerid, S_LEFT[playerid]); 
	PlayerTextDrawHide(playerid, S_RIGHT[playerid]); 
	PlayerTextDrawHide(playerid, S_BACK[playerid]); 
	CancelSelectTextDraw(playerid);
	DeletePVar(playerid,"InSelfie");
	S_Angle[playerid] = 0;
}

stock ShowBoxMenu(playerid, items)
{
	SetPVarInt(playerid, "BoxMenuItems", items);
	SelectTextDraw(playerid, 0xFFFFFF50);
	PlayerTextDrawShow(playerid, MenuBG[playerid]);
	PlayerTextDrawShow(playerid, MenuButton[playerid][0]);
	for(new i=1;i<items+1;i++)
	{
		PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][i], MenuButtonModel[playerid][i]);
		PlayerTextDrawShow(playerid, MenuButton[playerid][i]);
	}
}

stock HideBoxMenu(playerid)
{
	PlayerTextDrawHide(playerid, MenuBG[playerid]);
	PlayerTextDrawHide(playerid, MenuButton[playerid][0]);
	for(new i=1;i<=GetPVarInt(playerid, "BoxMenuItems");i++)
	{
		if(MenuButtonModel[playerid][i] == 0) continue;
		MenuButtonModel[playerid][i] = 0;
		PlayerTextDrawHide(playerid, MenuButton[playerid][i]);
	}
	CancelSelectTextDraw(playerid);
}

stock SetLeaderSkin(playerid)
{
	switch(PI[playerid][Faction])
	{
	    case 1,2,3:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 70;
			} else {
				PI[playerid][fSkin] = 40;
			}
		}
	    case 4:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 288;
			} else {
				PI[playerid][fSkin] = 76;
			}
		}
	    case 5,6:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 283;
			} else {
				PI[playerid][fSkin] = 76;
			}
		}
		case 7,8,9:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 223;
			} else {
				PI[playerid][fSkin] = 56;
			}
		}
		case 10,11,12:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 255;
			} else {
				PI[playerid][fSkin] = 191;
			}
		}
	    case 0: PI[playerid][fSkin] = PI[playerid][Skin];
	}
	SetPlayerSkin(playerid, PI[playerid][fSkin]);
}

stock SetPlayerFactionSkin(playerid)
{
	switch(PI[playerid][Faction])
	{
	    case 1,2,3:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 71;
			} else {
				PI[playerid][fSkin] = 219;
			}
		}
	    case 4,5,6:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 280;
			} else {
				PI[playerid][fSkin] = 41;
			}
		}
		case 7,8,9:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 170;
			} else {
				PI[playerid][fSkin] = 91;
			}
		}
		case 10,11:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 287;
			} else {
				PI[playerid][fSkin] = 191;
			}
		}
		case 12:
		{
			if(PI[playerid][Sex] == 1)
			{
				PI[playerid][fSkin] = 121;
			} else {
				PI[playerid][fSkin] = 191;
			}
		}
	    case 0: PI[playerid][fSkin] = PI[playerid][Skin];
	}
	SetPlayerSkin(playerid, PI[playerid][fSkin]);
}

stock FoulPack(playerid)
{
	if(GetPVarInt(playerid, "Packed") == 1)
	{
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
		if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);
		switch(GetPVarInt(playerid, "OutJob"))
		{
			case 1: TogglePlayerDynamicCP(playerid, PackerCP[1], false), TogglePlayerDynamicCP(playerid, PackerCP[0], true);
			case 2: TogglePlayerDynamicCP(playerid, WooderCP[0], false), TogglePlayerDynamicCP(playerid, WooderCP[random(2)+1], true);
			case 3: TogglePlayerDynamicCP(playerid, MinerCP[5], false), TogglePlayerDynamicCP(playerid, MinerCP[random(4)], true);
		}
	}
}

new Float:CarShopSpawn[4][3] = {
	{-1988.8434,273.5651,35.1719},
	{-1988.8434,266.2456,35.1719},
	{-1988.8434,258.7385,35.1719},
	{-1988.8434,248.7450,35.1719}
};

new SkinsForShop[17][4] = {
	{9,1,800,1000},
	{12,2,1000,1000},
	{13,3,5000,1800},
	{31,6,2000,2000},
	{40,7,10000,2800},
	{41,15,8000,2100},
	{53,21,3000,1000},
	{55,23,2300,2800},
	{56,24,45000,5000},
	{63,25,45000,5000},
	{76,28,50000,2000},
	{85,29,200000,10000},
	{90,30,20000,15000},
	{93,46,5000,50000},
	{91,47,100000,65000},
	{169,48,7000,200000},
	{233,299,150000,50000}
};

new Float:CamsRegSkins[5][3] = {
	{2790.6116,-1621.8943,13.9219},
	{2771.6604,-1623.9165,13.2459},
	{2769.8901,-1616.3600,12.5725},
	{2770.0566,-1610.9028,12.5725},
	{2774.5042,-1607.9321,12.5725}
};

new Float:CamsRegSkinsLook[5][4] = {
	{2792.2993,-1625.0845,10.9219,24.3831},
	{2771.3638,-1627.7877,12.1775,356.3069},
	{2766.7700,-1617.6467,11.1028,314.1921},
	{2766.5549,-1609.2701,10.9219,183.6193},
	{2773.3416,-1604.1941,10.9219,219.5927}
};

new SkinsForReg[5][2] = {
	{54, 78},
	{130, 135},
	{88, 230},
	{77, 137},
	{157, 200}
};

stock ClearAccount(playerid)
{
	format(PI[playerid][Email], 32, "NULL");
	format(PI[playerid][Key], 64, "NULL");
	format(PI[playerid][IP], 16, "NULL");
	format(PI[playerid][Event1], 64, "");
	format(PI[playerid][Event2], 64, "");
	format(PI[playerid][Event3], 64, "");
	format(PI[playerid][Event4], 64, "");
	format(PI[playerid][Event5], 64, "");
	format(PI[playerid][Event6], 64, "");
	format(PI[playerid][Event7], 64, "");
	format(PI[playerid][Event8], 64, "");
	format(PI[playerid][Event9], 64, "");
	format(PI[playerid][Event10], 64, "");
	format(PI[playerid][Adv], 64, "");
	for(new i;i<20;i++)
	{
		format(PhoneN[playerid][i], 32, "пусто");
		PhoneC[playerid][i] = 0;
	}
	format(PI[playerid][bDay], 11, "0"); PI[playerid][Passport] = 0;
	PI[playerid][Admin] = 0; PI[playerid][Level] = 1; PI[playerid][Exp] = 0; PI[playerid][GameTime] = 0; PI[playerid][House] = 0; PI[playerid][Renter] = 0; PI[playerid][Money] = 5000; PI[playerid][ReadNews] = 10;
	PIpen[playerid][MuteTime] = 0; PIpen[playerid][MuteCount] = 0; PIpen[playerid][MuteCMD] = 0; PIpen[playerid][MuteReport] = 0; PIpen[playerid][JailTime] = 0; PIpen[playerid][Cheater] = 0; PIpen[playerid][CheaterCount] = 0;
	PIcar[playerid][CarID] = 0; PIcar[playerid][CarGUID] = INVALID_VEHICLE_ID; PIcar[playerid][Color1] = 0; PIcar[playerid][Color2] = 0; PIcar[playerid][PaintJob] = 3; PIcar[playerid][VehSlot0] = 0; PIcar[playerid][VehSlot1] = 0; PIcar[playerid][VehSlot2] = 0;
	PIcar[playerid][VehSlot3] = 0; PIcar[playerid][VehSlot4] = 0; PIcar[playerid][VehSlot5] = 0; PIcar[playerid][VehSlot6] = 0; PIcar[playerid][VehSlot7] = 0; PIcar[playerid][VehSlot8] = 0; PIcar[playerid][VehSlot9] = 0; PIcar[playerid][VehSlot10] = 0;
	PIcar[playerid][VehSlot11] = 0; PIcar[playerid][VehSlot12] = 0; PIcar[playerid][VehSlot13] = 0; PIcar[playerid][Object1] = 0; PIcar[playerid][Object2] = 0; PIcar[playerid][HealPacks] = 0;
	PI[playerid][Wanted] = 0; PI[playerid][HealPacks] = 0;
	PI[playerid][PhoneNumber] = 0; PI[playerid][PhoneBalance] = 0;
	PI[playerid][SkillPistol1] = 0; PI[playerid][SkillPistol2] = 0; PI[playerid][SkillPistol3] = 0; PI[playerid][SkillShotgun1] = 0; PI[playerid][SkillShotgun2] = 0; PI[playerid][SkillShotgun3] = 0; PI[playerid][SkillUZI] = 0; PI[playerid][SkillMP5] = 0; PI[playerid][SkillAK47] = 0; PI[playerid][SkillM4] = 0; PI[playerid][SkillSniper] = 0;
	PI[playerid][Eat] = 20; PI[playerid][Bank] = 0; PI[playerid][Law] = 0;
	PI[playerid][Faction] = 0; PI[playerid][Rank] = 0; PI[playerid][DriveLicence] = 0; PI[playerid][Job] = 0;
	PI[playerid][X] = 395.4662;
	PI[playerid][Y] = -1533.2700;
	PI[playerid][Z] = 32.2663;
	PI[playerid][A] = 225.5074;
	PI[playerid][BH] = 0; PI[playerid][TPMap] = 0; PI[playerid][OpenHouses] = 0; PI[playerid][GodMode] = 0; PI[playerid][ShowKeys] = 0; PI[playerid][ShowKills] = 0; 
	noclipdata[playerid][cameramode] 	= CAMERA_MODE_NONE;
	noclipdata[playerid][lrold]	   	 	= 0;
	noclipdata[playerid][udold]   		= 0;
	noclipdata[playerid][mode]   		= 0;
	noclipdata[playerid][lastmove]   	= 0;
	noclipdata[playerid][accelmul]   	= 0.0;
	PI[playerid][HealthTime] = 0;
	PI[playerid][ArmorTime] = 0;
	PI[playerid][CheatTime] = 0;
	S_Height[playerid] = 0.65;
	ShopCarAngle[playerid] = 250.0;
	DonatePay[playerid] = 0.0;
	SetPVarInt(playerid, "SpecID", PLAYERS);
}

forward OneTimer();
forward FiveTimer();
forward MinTimer();
forward Min5Timer();
forward HourTimer();

new domains[][] = {".ws",".ru",".tk",".com","www.",".org",".net",".cc",".рф",".by",".biz",".su",".info"};
stock CheckPR(str[])
{
	new tmp1[2];
	new n1, n2;
	for(new i; i<strlen(str); i++)
	{
		strcat(tmp1, str[i]);
	    if(IsNumeric(tmp1))
		{
			n1++;
			if(n1>0 && i==strlen(str)-1) n2++;
		} else {
		    if(n1>0)
		    {
		        n2++;
		    	n1 = 0;
			}
		}
		format(tmp1,sizeof(tmp1),"");
	}
	if(n2 > 3) return true;
	for(new i = 0;i<sizeof(domains);i++) if(strfind(str,domains[i],true) != -1) return true;
	return false;
}

stock MTF(time)
{
    new MT[128];
	if(time == 2000000000) format(MT, sizeof(MT), "вечность");
    else if(time < 60) format(MT, sizeof(MT), "%dc", time);
    else if(time == 60) MT = "1м:0с";
    else if(time > 60 && time < 3600)
    {
        new Float: timeM;
        new timeS;
        timeM = time / 60;
        timeS = time % 60;
        format(MT, sizeof(MT), "%.0fм:%dс", timeM, timeS);
    }
    else if(time == 3600) MT = "1ч:0м:0с";
    else if(time > 3600 && time < 86400)
	{
        new Float: timeH;
        new timeMInt;
        new Float: timeM;
        new timeS;
        timeH = time / 3600;
        timeMInt = time % 3600;
        timeM = timeMInt / 60;
        timeS = timeMInt % 60;
        format(MT, sizeof(MT), "%.0fч:%.0fм:%dс", timeH, timeM, timeS);
    }
    else if(time == 86400) MT = "1д:0ч:0м:0с";
    else if(time > 86400)
    {
        new Float: timeD;
        new Float: timeH;
        new timeMInt, timeHInt;
        new Float: timeM;
        new timeS;
        timeD = time / 86400;
        timeHInt = time % 86400;
        timeMInt = time % 3600;
        timeH = timeHInt / 3600;
        timeM = timeMInt / 60;
        timeS = timeMInt % 60;
        format(MT, sizeof(MT), "%.0fд:%.0fч:%.0fм:%dс", timeD, timeH, timeM, timeS);
    }
    return MT;
}

stock JTF(time)
{
    new MT[128];
    if(time < 60) format(MT, sizeof(MT), "0:%d", time);
    else if(time == 60) MT = "1:0";
    else if(time > 60 && time < 3600)
    {
        new Float: timeM;
        new timeS;
        timeM = time / 60;
        timeS = time % 60;
        format(MT, sizeof(MT), "%.0f:%d", timeM, timeS);
    }
    else if(time == 3600) MT = "1:0:0";
    else if(time > 3600 && time < 86400)
	{
        new Float: timeH;
        new timeMInt;
        new Float: timeM;
        new timeS;
        timeH = time / 3600;
        timeMInt = time % 3600;
        timeM = timeMInt / 60;
        timeS = timeMInt % 60;
        format(MT, sizeof(MT), "%.0f:%.0f:%d", timeH, timeM, timeS);
    }
    else if(time == 86400) MT = "1:0:0:0";
    else if(time > 86400)
    {
        new Float: timeD;
        new Float: timeH;
        new timeMInt, timeHInt;
        new Float: timeM;
        new timeS;
        timeD = time / 86400;
        timeHInt = time % 86400;
        timeMInt = time % 3600;
        timeH = timeHInt / 3600;
        timeM = timeMInt / 60;
        timeS = timeMInt % 60;
        format(MT, sizeof(MT), "%.0f:%.0f:%.0f:%d", timeD, timeH, timeM, timeS);
    }
    return MT;
}

stock OTF(time)
{
    new MT[128];
    if(time < 60) format(MT, sizeof(MT), "%d сек", time);
    else if(time == 60) MT = "1:0";
    else if(time > 60)
    {
        new Float: timeM;
        new timeS;
        timeM = time / 60;
        timeS = time % 60;
        format(MT, sizeof(MT), "%.0f:%d", timeM, timeS);
    }
    else if(time == 3600) MT = "1:0:0";
    else if(time > 3600 && time < 86400)
	{
        new Float: timeH;
        new timeMInt;
        new Float: timeM;
        new timeS;
        timeH = time / 3600;
        timeMInt = time % 3600;
        timeM = timeMInt / 60;
        timeS = timeMInt % 60;
        format(MT, sizeof(MT), "%.0f:%.0f:%d", timeH, timeM, timeS);
    }
    return MT;
}

stock SetCarNumberR(playerid)
{
	new tmp[9];
	for(new i;i<=9;i++) strcat(tmp, symbols[random(sizeof(symbols))]);
	format(PIcar[playerid][NumberPlate], 32, "{000000}%s", tmp);
	SetVehicleNumberPlate(PIcar[playerid][CarGUID], PIcar[playerid][NumberPlate]);
	//SetVehicleToRespawn(PI[playerid][CarGUID]);
	//SpawnPlayerCar(playerid);
}

stock ShowInfo(playerid, text[], type = 1)
{
	switch(type)
	{
	    case 1: ShowPlayerDialog(playerid, D_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Информация", text, "ОК", "");
	    case 2: SendClientMessage(playerid, -1, text);
	}
}

stock AddPlayerEvent(playerid, event[])
{
	format(PI[playerid][Event10], 64, "%s", PI[playerid][Event9]);
	format(PI[playerid][Event9], 64, "%s", PI[playerid][Event8]);
	format(PI[playerid][Event8], 64, "%s", PI[playerid][Event7]);
	format(PI[playerid][Event7], 64, "%s", PI[playerid][Event6]);
	format(PI[playerid][Event6], 64, "%s", PI[playerid][Event5]);
	format(PI[playerid][Event5], 64, "%s", PI[playerid][Event4]);
	format(PI[playerid][Event4], 64, "%s", PI[playerid][Event3]);
	format(PI[playerid][Event3], 64, "%s", PI[playerid][Event2]);
	format(PI[playerid][Event2], 64, "%s", PI[playerid][Event1]);
	format(PI[playerid][Event1], 64, "%s", event);
}

stock ShowMenu(playerid, menuid)
{
	switch(menuid)
	{
		case D_DONATE: {
			AddDListItem(playerid, "Проверить баланс", DON_cash);
			AddDListItem(playerid, "Изменить имя", DON_nick);
			AddDListItem(playerid, "Купить игровую валюту", DON_money);
	     	ShowPlayerDList(playerid, D_DONATE, "{FFFFFF}Донат", "Выбрать", "Назад");
		}
		case D_INF: {
			AddDListItem(playerid, "Список админов онлайн", ADMLIST);
			AddDListItem(playerid, "Команды", CMDS);
			AddDListItem(playerid, "Управление", KEYS);
			AddDListItem(playerid, "Список лидеров онлайн", LEADERS);
			AddDListItem(playerid, "Помощь", HELP);
			AddDListItem(playerid, "Новости", NEWS);
			AddDListItem(playerid, "Анимации", ANIMS);
			AddDListItem(playerid, "Рекорд", RECORD);
	     	ShowPlayerDList(playerid, D_INF, "{FFFFFF}Информация", "Выбрать", "Назад");
		}
		case D_HOUSE_BANK: {
			AddDListItem(playerid, "Положить деньги", HOUSE_BANK_ADD);
			AddDListItem(playerid, "Снять деньги", HOUSE_BANK_REM);
	     	ShowPlayerDList(playerid, D_HOUSE_BANK, "{FFFFFF}Домашний сейф", "Выбрать", "Назад");
		}
		case P_MENU_ADMIN:
		{
			AddDListItem(playerid, "Наказания", P_MENU_ADM_pen);
			if(PI[playerid][Admin] >= 700) AddDListItem(playerid, "Аккаунт", P_MENU_ADM_acc);
			AddDListItem(playerid, "Игрок", P_MENU_ADM_pl);
			ShowPlayerDList(playerid, P_MENU_ADMIN, "{FFFFFF}Админка", "Выбрать", "Назад");
		}
	    case ADMIN: {
			if(PI[playerid][Admin] >= 100) 
			{
				AddDListItem(playerid, "Транспорт", ADM_veh);
				AddDListItem(playerid, "Чат", ADM_chat);
				AddDListItem(playerid, "Другое", ADM_other);
			}
			if(PI[playerid][Admin] >= 1500)AddDListItem(playerid, "Редактор Soe", ADM_soe);
			AddDListItem(playerid, "Доступные команды", ADM_info);
			ShowPlayerDList(playerid, ADMIN, "{FFFFFF}Админка", "Выбрать", "Назад");
		}
		case ADMIN_VEH: {
	    	if(PI[playerid][Admin] >= 100)
	     	{
	     		AddDListItem(playerid, "Информация", ADM_veh_info);
	     		AddDListItem(playerid, "Открыть ближайший транспорт", ADM_veh_unlock);
			}
			if(PI[playerid][Admin] >= 500)
	     	{
				AddDListItem(playerid, "Отправить на респаун (неиспользуемый)", ADM_veh_unuseresp);
				AddDListItem(playerid, "Починить", ADM_veh_repair);
				AddDListItem(playerid, "Заправить", ADM_veh_fuel);
			}
			if(PI[playerid][Admin] >= 700)
	     	{
				AddDListItem(playerid, "Отправить на респаун (ближайший)", ADM_veh_resp);
				AddDListItem(playerid, "Удалить созданные", ADM_veh_adel);
			}
			if(PI[playerid][Admin] >= 1000)
	     	{
				AddDListItem(playerid, "Удалить транспорт админов", ADM_veh_alladminresp);
			}
			ShowPlayerDList(playerid, ADMIN_VEH, "{FFFFFF}Админка - Транспорт", "Выбрать", "Назад");
		}
		case ADMIN_CHAT: {
	    	if(PI[playerid][Admin] >= 100)
	     	{
				AddDListItem(playerid, "Чат для админов", ADM_chat_say);
	     		if(GetPVarInt(playerid, "ShowIC") == 1)
	     		{
					AddDListItem(playerid, "Отключить отображение сообщений IC чата", ADM_chat_IC);
	     		} else {
					AddDListItem(playerid, "Включить отображение сообщений IC чата", ADM_chat_IC);
	     		}
			}
			if(PI[playerid][Admin] >= 500)
	     	{
	     		if(GetPVarInt(playerid, "ShowOOC") == 1)
	     		{
					AddDListItem(playerid, "Отключить отображение сообщений OOC чата", ADM_chat_OOC);
	     		} else {
					AddDListItem(playerid, "Включить отображение сообщений OOC чата", ADM_chat_OOC);
	     		}
			}
			if(PI[playerid][Admin] >= 700)
	     	{
	     		AddDListItem(playerid, "Объявление игрокам", ADM_chat_adv);
			}
			if(PI[playerid][Admin] >= 1000)
	     	{
			 	if(globalchat)
	     		{
					AddDListItem(playerid, "Отключить глобальный чат", ADM_chat_gl);
	     		} else {
					AddDListItem(playerid, "Включить глобальный чат", ADM_chat_gl);
	     		}
			}
	     	ShowPlayerDList(playerid, ADMIN_CHAT, "{FFFFFF}Админка - Чат", "Выбрать", "Назад");
		}
		case ADMIN_OTHER: {
	    	if(PI[playerid][Admin] >= 100)
	     	{
				AddDListItem(playerid, "Полет в наблюдении", ADM_other_fly);
				if(PI[playerid][ShowKills] == 1)
	     		{
					AddDListItem(playerid, "Отключить все убийства в киллчате", ADM_other_kills);
	     		} else {
					AddDListItem(playerid, "Включить все убийства в киллчате", ADM_other_kills);
	     		}
			}
			if(PI[playerid][Admin] >= 500)
	     	{

			}
			if(PI[playerid][Admin] >= 700)
	     	{
				if(PI[playerid][BH] == 0)
	     		{
					AddDListItem(playerid, "Отключить Анти БХ", ADM_other_bh);
	     		} else {
					AddDListItem(playerid, "Включить Анти БХ", ADM_other_bh);
	     		}
			}
			if(PI[playerid][Admin] >= 800)
	     	{
				if(PI[playerid][TPMap] == 1)
	     		{
					AddDListItem(playerid, "Отключить телепорт по клику на карте", ADM_other_tpmap);
	     		} else {
					AddDListItem(playerid, "Включить телепорт по клику на карте", ADM_other_tpmap);
	     		}
			}
			if(PI[playerid][Admin] >= 1000)
	     	{
				if(PI[playerid][GodMode] == 1)
	     		{
					AddDListItem(playerid, "Отключить бессмертие", ADM_other_gm);
	     		} else {
					AddDListItem(playerid, "Включить бессмертие", ADM_other_gm);
	     		}
				if(!Bunny)
	     		{
					AddDListItem(playerid, "Отключить Анти БХ всем", ADM_other_abh);
	     		} else {
					AddDListItem(playerid, "Включить Анти БХ всем", ADM_other_abh);
	     		}
				if(PI[playerid][OpenHouses] == 1)
	     		{
					AddDListItem(playerid, "Отключить вход в любой дом", ADM_other_inhs);
	     		} else {
					AddDListItem(playerid, "Включить вход в любой дом", ADM_other_inhs);
	     		}
			}
			if(PI[playerid][Admin] >= 2000)
	     	{
				AddDListItem(playerid, "Сохранить аккаунты", ADM_other_saveall);
				AddDListItem(playerid, "Перезапустить сервер", ADM_other_restart);
				if(PI[playerid][ShowKeys] == 1)
	     		{
					AddDListItem(playerid, "Отключить отображение нажимаемых клавиш", ADM_other_showkeys);
	     		} else {
					AddDListItem(playerid, "Включить отображение нажимаемых клавиш", ADM_other_showkeys);
	     		}
			}
	     	ShowPlayerDList(playerid, ADMIN_OTHER, "{FFFFFF}Админка - Другое", "Выбрать", "Назад");
		}
		case DM_PHONE:
		{
			AddDListItem(playerid, "Контакты", MN_phone_cont);
			AddDListItem(playerid, "Экстренные службы", MN_phone_112);
			AddDListItem(playerid, "Другие услуги", MN_phone_serv);
			AddDListItem(playerid, "Радио", MN_phone_radio);
			AddDListItem(playerid, "Сделать селфи", MN_phone_selfie);
			ShowPlayerDList(playerid, DM_PHONE, "{FFFFFF}Телефон", "Выбрать", "Назад");
		}
		case D_HELP:
		{
			new body[256];
			strcat(body, "Общение");
			strcat(body, "\nИгроки");
			strcat(body, "\nОбщее");
			strcat(body, "\nRole Play");
			strcat(body, "\nПервые шаги");
			strcat(body, "\nТранспорт");
			strcat(body, "\nПрофессия");
			strcat(body, "\nОружие");
			strcat(body, "\nДома");
			strcat(body, "\nЛичный транспорт");
			ShowPlayerDialog(playerid, D_HELP, DIALOG_STYLE_LIST, "{FFFFFF}Помощь", body, "Выбрать", "Выход");
		}

		case D_STATS: {
			new body[256];
			strcat(body, "Информация");
			strcat(body, "\nСбережения");
			strcat(body, "\nДом");
			strcat(body, "\nРазное");
			strcat(body, "\nНаказания");
			strcat(body, "\nПолностью");
			ShowPlayerDialog(playerid, D_STATS, DIALOG_STYLE_LIST, "{FFFFFF}Статистика", body, "Выбрать", "Назад");
		}

		case D_ATM:
		{
			new body[256];
			strcat(body, "Положить денег на счёт телефона");
			strcat(body, "\nСнять деньги со счёта в банке (комиссия 10%)");
			strcat(body, "\nСнять деньги со счёта телефона");
			ShowPlayerDialog(playerid, D_ATM, DIALOG_STYLE_LIST, "{FFFFFF}Банкомат", body, "Выбрать", "Выход");
		}

		case D_247:
		{
			new body[256];
			strcat(body, "Купить телефон\t{FFFF00}[$400]");
			strcat(body, "\nКупить сим-карту\t{FFFF00}[$50]");
			strcat(body, "\nКорпус для телефона\t{FFFF00}[$100]");
			ShowPlayerDialog(playerid, D_247, DIALOG_STYLE_LIST, "{FFFFFF}Маркет", body, "Выбрать", "Выход");
		}

		case D_HEAL:
		{
			new body[256];
			strcat(body, "Купить аптечку\t\t\t{FFFF00}[$100]");
			ShowPlayerDialog(playerid, D_HEAL, DIALOG_STYLE_LIST, "{FFFFFF}Аптека", body, "Выбрать", "Выход");
		}

		case D_FACTION: {
			if(PI[playerid][Faction] != 0)
			{
				AddDListItem(playerid, "Сотрудники фракции", F_members);
				AddDListItem(playerid, "Описание фракции", F_info);
				AddDListItem(playerid, "Уйти из фракции", F_leave);
				switch(PI[playerid][Faction])
				{
					case 1,2,3:{}
					case 4,5,6:
					{
						AddDListItem(playerid, "Розыскиваемые", F_crim);
					}
					case 7,8,9:
					{
						if(PI[playerid][Rank] >= 2) AddDListItem(playerid, "Проверка объявлений", F_adv);
						if(PI[playerid][Rank] >= 4) AddDListItem(playerid, "Репортаж", F_reportage);
					}
				}
				if(PI[playerid][Rank] >= 10) AddDListItem(playerid, "Гос. новости", F_gnews);
				ShowPlayerDList(playerid, D_FACTION, "{FFFFFF}Фракция", "Выбрать", "Назад");
			} else SendClientMessage(playerid, COLOR_SYSTEM, "Ты не состоишь во фракции");
		}
		case P_MENU_FACTION:
		{
			Clear_DList(playerid);
			new plid = GetPVarInt(playerid, "ClickedPlayer");
			if(PI[playerid][Rank] >= 2)
			{
				switch(PI[playerid][Faction])
				{
					case 1,2,3: AddDListItem(playerid, "Вылечить", FPMN_heal1);
					case 4,5,6: AddDListItem(playerid, "Провести задержание", FPMN_arest);
				}
			}
			if(PI[playerid][Rank] >= 3)
			{
				switch(PI[playerid][Faction])
				{
					case 4,5,6: {
						AddDListItem(playerid, "Объявить в розыск", FPMN_wanted2);
						AddDListItem(playerid, "Снять розыск", FPMN_wanted1);
						AddDListItem(playerid, "Отобрать водительское удостоверение", FPMN_disDlic);
					}
				}
			}
			if(PI[playerid][Rank] >= 4)
			{
				switch(PI[playerid][Faction])
				{
					case 1,2,3: {
						AddDListItem(playerid, "Вколоть витамины", FPMN_heal2);
						AddDListItem(playerid, "Вколоть обезбаливающее", FPMN_heal3);
				}
				case 4,5,6: {
						if(GetPVarInt(plid, "HandBlock") == 1)
						{
							AddDListItem(playerid, "Снять наручники", FPMN_bHand2);
						} else {
							AddDListItem(playerid, "Одеть наручники", FPMN_bHand1);
						}
					}
				}
			}
			if(PI[playerid][Rank] >= 5)
			{
			switch(PI[playerid][Faction])
				{
					case 4,5,6:
					{
						if(!IsPlayerInAnyVehicle(plid))
						{
							AddDListItem(playerid, "Посадить в полицейскую машину", FPMN_inCar2);
						} else {
							AddDListItem(playerid, "Выкинуть из машины", FPMN_inCar1);
						}
						AddDListItem(playerid, "Посадить в тюрьму", FPMN_jail);
					}
					case 7,8,9:
					{
						AddDListItem(playerid, "Взять интервью", FPMN_iView);
					}
				}
			}
			if(PI[playerid][Rank] >= 6)
			{
				switch(PI[playerid][Faction])
				{
					case 1,2,3:
					{
						AddDListItem(playerid, "Сменить пол", FPMN_Sex);
					}
				}
			}
			if(PI[playerid][Rank] >= 7)
			{
				AddDListItem(playerid, "Сменить форму", FPMN_Form);
			}
			if(PI[playerid][Rank] >= 8)
			{
				if(PI[plid][Faction] != PI[playerid][Faction])
				{
					AddDListItem(playerid, "Пригласить во фракцию", FPMN_invite);
				} else {
					AddDListItem(playerid, "Выгнать из фракции", FPMN_uninvite);
					if(PI[playerid][Rank] > PI[plid][Rank])
					{
						AddDListItem(playerid, "Повысить ранг", FPMN_gRank);
						AddDListItem(playerid, "Понизить ранг", FPMN_Rank);
					}
				}
			}
			ShowPlayerDList(playerid, P_MENU_FACTION, "{FFFFFF}Фракция", "Выбрать", "Назад");
		}

		case D_OPT: {
			new body[256];
			strcat(body, "Изменить пароль");
			strcat(body, "\nИзменить E-mail");
	     	strcat(body, "\nИзменить секретное слово");
	     	if(IsOkEmail(playerid))
	     	{
	     		strcat(body, "\nОтправить данные на мой E-mail");
			}
			ShowPlayerDialog(playerid, D_OPT, DIALOG_STYLE_LIST, "{FFFFFF}Настройки аккаунта", body, "Выбрать", "Назад");
	    }

	    case D_GPS: {
	    	new body[256];
	     	strcat(body, "Подработки");
	     	strcat(body, "\nОбщественные здания");
	     	strcat(body, "\nМагазины");
	     	strcat(body, "\nАвтостоянки");
	     	strcat(body, "\nДома");
	     	strcat(body, "\nБлижайший банкомат");
	     	ShowPlayerDialog(playerid, D_GPS, DIALOG_STYLE_LIST, "{FFFFFF}Навигатор", body, "Выбрать", "Назад");
	    }
	    case D_GPS_JOBS: {
	    	new body[256];
	     	strcat(body, "Склад");
	     	strcat(body, "\nЛесопилка");
	     	strcat(body, "\nШахта");
	     	ShowPlayerDialog(playerid, D_GPS_JOBS, DIALOG_STYLE_LIST, "{FFFFFF}Список доступных подработок", body, "Выбрать", "Назад");
	    }

	    case D_GPS_GBUILDS: {
	    	new body[256];
	     	strcat(body, "Мэрия ЛС");
	     	strcat(body, "\nМэрия СФ");
	     	strcat(body, "\nМэрия ЛВ");
	     	strcat(body, "\nБольница ЛС");
	     	strcat(body, "\nБольница СФ");
	     	strcat(body, "\nБольница ЛВ");
	     	strcat(body, "\nРадиоцентр ЛС");
	     	strcat(body, "\nРадиоцентр СФ");
	     	strcat(body, "\nРадиоцентр ЛВ");
	     	strcat(body, "\nПолицейский участок ЛС");
	     	strcat(body, "\nПолицейский участок СФ");
	     	strcat(body, "\nПолицейский участок ЛВ");
	     	strcat(body, "\nАвтошкола");
	     	strcat(body, "\nВоенкомат");
	     	ShowPlayerDialog(playerid, D_GPS_GBUILDS, DIALOG_STYLE_LIST, "{FFFFFF}Общественные здания", body, "Выбрать", "Назад");
	    }
	    case D_GPS_MAGZ: {
	    	new body[256];
	     	strcat(body, "Автосалон");
	     	strcat(body, "\nМагазин одежды");
	     	strcat(body, "\nМагазин 24/7");
	     	ShowPlayerDialog(playerid, D_GPS_MAGZ, DIALOG_STYLE_LIST, "{FFFFFF}Магазины", body, "Выбрать", "Назад");
	    }
		case D_GPS_CARS: {
			new body[256];
	     	strcat(body, "Автобусы ЛС");
	     	strcat(body, "\nАвтобусы СФ");
	     	strcat(body, "\nАвтобусы ЛВ");
	     	strcat(body, "\nТакси ЛС");
	     	strcat(body, "\nТакси СФ");
	     	strcat(body, "\nТакси ЛВ");
	     	ShowPlayerDialog(playerid, D_GPS_CARS, DIALOG_STYLE_LIST, "{FFFFFF}Автостоянки", body, "Выбрать", "Назад");
		}
		case D_GPS_HOUSE: {
			new body[256];
	     	strcat(body, "Показать мой дом на карте");
	     	strcat(body, "\nПоказать дом на карте");
	     	ShowPlayerDialog(playerid, D_GPS_HOUSE, DIALOG_STYLE_LIST, "{FFFFFF}Автостоянки", body, "Выбрать", "Назад");
		}
	}
	return true;
}

stock ExitPlayerCarShop(playerid)
{
    if(GetPVarInt(playerid, "InCarShop") == 1)
    {
		SetPVarInt(playerid, "InCarShop", 0);
	   	CancelSelectTextDraw(playerid);
		PlayerTextDrawHide(playerid, NameCar[playerid]);
		PlayerTextDrawHide(playerid, PrevCar[playerid]);
		PlayerTextDrawHide(playerid, NextCar[playerid]);
		PlayerTextDrawHide(playerid, LevelCar[playerid]);
		PlayerTextDrawHide(playerid, CostCar[playerid]);
		PlayerTextDrawHide(playerid, BuyCar[playerid]);
		PlayerTextDrawHide(playerid, SellCar[playerid]);
		PlayerTextDrawHide(playerid, AngleCarLeft[playerid]);
		PlayerTextDrawHide(playerid, AngleCarRight[playerid]);
		TextDrawHideForPlayer(playerid, CarShopBox);
		TogglePlayerControllable(playerid, true);
		SetPlayerPos(playerid,-1968.2565,293.6687,35.1719);
		SetPlayerFacingAngle(playerid, 92.5078);
		SetCameraBehindPlayer(playerid);
		SetPlayerVirtualWorld(playerid, 0);
		DestroyVehicle(ShopCar[playerid]);
		NowCarShop[playerid] = 0;
	}
}

stock ExitPlayerSkinShop(playerid)
{
    if(GetPVarInt(playerid, "InSkinShop") == 1)
    {
		SetPVarInt(playerid, "InSkinShop", 0);
		TogglePlayerControllable(playerid, true);
		SetPlayerInterior(playerid, 5);
		SetPlayerPos(playerid, 209.2933,-6.3140,1001.2109);
		SetPlayerFacingAngle(playerid,264.2250);
		SetPlayerVirtualWorld(playerid, GetPVarInt(playerid, "SkinWorld"));
		SetCameraBehindPlayer(playerid);
		NowSkinShop[playerid] = 0;
		if(PI[playerid][Faction] != 0)
		{
			SetPlayerSkin(playerid, PI[playerid][fSkin]);
		} else {
			SetPlayerSkin(playerid, PI[playerid][Skin]);
		}
		PlayerTextDrawHide(playerid, SkinShopBuy[playerid]);
		PlayerTextDrawHide(playerid, SkinShopNext[playerid]);
		PlayerTextDrawHide(playerid, SkinShopPrev[playerid]);
	}
}

stock NextCarShop(playerid)
{
	DestroyVehicle(ShopCar[playerid]);
	if(NowCarShop[playerid] < sizeof(CarsForShop)-1)
	{
		NowCarShop[playerid]++;
	} else NowCarShop[playerid] = 0;
	ShopCar[playerid] = CreateVehicle(CarsForShop[NowCarShop[playerid]][0],-1658.8242,1208.8860,21.1563,ShopCarAngle[playerid],1,1,0);
	SetVehicleVirtualWorld(ShopCar[playerid], playerid+1);
	PlayerTextDrawSetString(playerid, NameCar[playerid], vName[CarsForShop[NowCarShop[playerid]][0]-400]);
	format(glstr,sizeof(glstr),"%d",CarsForShop[NowCarShop[playerid]][2]);
	PlayerTextDrawSetString(playerid, LevelCar[playerid], glstr);
	format(glstr,sizeof(glstr),"%d$",CarsForShop[NowCarShop[playerid]][1]);
	PlayerTextDrawSetString(playerid, CostCar[playerid], glstr);
}

stock PrevCarShop(playerid)
{
    DestroyVehicle(ShopCar[playerid]);
	if(NowCarShop[playerid] > 0)
	{
		NowCarShop[playerid]--;
	} else NowCarShop[playerid] = sizeof(CarsForShop)-1;
	ShopCar[playerid] = CreateVehicle(CarsForShop[NowCarShop[playerid]][0],-1658.8242,1208.8860,21.1563,ShopCarAngle[playerid],1,1,0);
	SetVehicleVirtualWorld(ShopCar[playerid], playerid+1);
	PlayerTextDrawSetString(playerid, NameCar[playerid], vName[CarsForShop[NowCarShop[playerid]][0]-400]);
	format(glstr,sizeof(glstr),"%d",CarsForShop[NowCarShop[playerid]][2]);
	PlayerTextDrawSetString(playerid, LevelCar[playerid], glstr);
	format(glstr,sizeof(glstr),"%d$",CarsForShop[NowCarShop[playerid]][1]);
	PlayerTextDrawSetString(playerid, CostCar[playerid], glstr);
}

stock NextSkinReg(playerid)
{
	if(LockRegSkin[playerid]) return false;
	LockRegSkin[playerid] = true;
	if(NowSkinReg[playerid] < sizeof(SkinsForReg)-1)
	{
		NowSkinReg[playerid]++;
		InterpolateCameraPos(playerid, CamsRegSkins[NowSkinReg[playerid]-1][0],CamsRegSkins[NowSkinReg[playerid]-1][1],CamsRegSkins[NowSkinReg[playerid]-1][2], CamsRegSkins[NowSkinReg[playerid]][0],CamsRegSkins[NowSkinReg[playerid]][1],CamsRegSkins[NowSkinReg[playerid]][2],2000);
		InterpolateCameraLookAt(playerid, CamsRegSkinsLook[NowSkinReg[playerid]-1][0],CamsRegSkinsLook[NowSkinReg[playerid]-1][1],CamsRegSkinsLook[NowSkinReg[playerid]-1][2], CamsRegSkinsLook[NowSkinReg[playerid]][0],CamsRegSkinsLook[NowSkinReg[playerid]][1],CamsRegSkinsLook[NowSkinReg[playerid]][2],2000);
	} else {
		InterpolateCameraPos(playerid, CamsRegSkins[sizeof(SkinsForReg)-1][0], CamsRegSkins[sizeof(SkinsForReg)-1][1], CamsRegSkins[sizeof(SkinsForReg)-1][2], CamsRegSkins[0][0], CamsRegSkins[0][1], CamsRegSkins[0][2],2000);
		InterpolateCameraLookAt(playerid, CamsRegSkinsLook[sizeof(SkinsForReg)-1][0], CamsRegSkinsLook[sizeof(SkinsForReg)-1][1], CamsRegSkinsLook[sizeof(SkinsForReg)-1][2], CamsRegSkinsLook[0][0], CamsRegSkinsLook[0][1], CamsRegSkinsLook[0][2],2000);
		NowSkinReg[playerid] = 0;
	}
	SetTimerEx("ChangeRegSkin", 1000, false, "d", playerid);
	SetTimerEx("AllowRegSkin", 2000, false, "d", playerid);
	return true;
}

stock PrevSkinReg(playerid)
{
	if(LockRegSkin[playerid]) return false;
	LockRegSkin[playerid] = true;
	if(NowSkinReg[playerid] > 0)
	{
		NowSkinReg[playerid]--;
		InterpolateCameraPos(playerid, CamsRegSkins[NowSkinReg[playerid]+1][0],CamsRegSkins[NowSkinReg[playerid]+1][1],CamsRegSkins[NowSkinReg[playerid]+1][2], CamsRegSkins[NowSkinReg[playerid]][0],CamsRegSkins[NowSkinReg[playerid]][1],CamsRegSkins[NowSkinReg[playerid]][2],2000);
		InterpolateCameraLookAt(playerid, CamsRegSkinsLook[NowSkinReg[playerid]+1][0],CamsRegSkinsLook[NowSkinReg[playerid]+1][1],CamsRegSkinsLook[NowSkinReg[playerid]+1][2], CamsRegSkinsLook[NowSkinReg[playerid]][0],CamsRegSkinsLook[NowSkinReg[playerid]][1],CamsRegSkinsLook[NowSkinReg[playerid]][2],2000);
	} else {
		InterpolateCameraPos(playerid, CamsRegSkins[0][0],CamsRegSkins[0][1],CamsRegSkins[0][2], CamsRegSkins[sizeof(SkinsForReg)-1][0],CamsRegSkins[sizeof(SkinsForReg)-1][1],CamsRegSkins[sizeof(SkinsForReg)-1][2],2000);
		InterpolateCameraLookAt(playerid, CamsRegSkinsLook[0][0],CamsRegSkinsLook[0][1],CamsRegSkinsLook[0][2], CamsRegSkinsLook[sizeof(SkinsForReg)-1][0],CamsRegSkinsLook[sizeof(SkinsForReg)-1][1],CamsRegSkinsLook[sizeof(SkinsForReg)-1][2],2000);
		NowSkinReg[playerid] = sizeof(SkinsForReg)-1;
	}
	SetTimerEx("ChangeRegSkin", 1000, false, "d", playerid);
	SetTimerEx("AllowRegSkin", 2000, false, "d", playerid);
	return true;
}

stock NextSkinShop(playerid)
{
	if(NowSkinShop[playerid] < sizeof(SkinsForShop))
	{
		NowSkinShop[playerid]++;
	} else NowSkinShop[playerid] = 0;
	SetPlayerSkin(playerid, SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]]);
	format(glstr,sizeof(glstr),"~w~%d$",SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]+2]);
	GameTextForPlayer(playerid, glstr, 3000, 4);
}

stock PrevSkinShop(playerid)
{
	if(NowSkinShop[playerid] > 0)
	{
		NowSkinShop[playerid]--;
	} else NowSkinShop[playerid] = sizeof(SkinsForShop)-1;
	SetPlayerSkin(playerid, SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]]);
	format(glstr,sizeof(glstr),"~w~%d$",SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]+2]);
	GameTextForPlayer(playerid, glstr, 3000, 4);
}

stock DestroyPlayerTD(playerid)
{
	PlayerTextDrawDestroy(playerid, main_info[playerid]);
	PlayerTextDrawDestroy(playerid, HPinfo[playerid]);
	PlayerTextDrawDestroy(playerid, ARinfo[playerid]);
	PlayerTextDrawDestroy(playerid, SpeedNameCar[playerid]);
	PlayerTextDrawDestroy(playerid, FuelCarLabel[playerid]);
	PlayerTextDrawDestroy(playerid, FuelCarLevel[playerid]);
	PlayerTextDrawDestroy(playerid, LockedCar[playerid]);
	PlayerTextDrawDestroy(playerid, SpeedCarLabel[playerid]);
	PlayerTextDrawDestroy(playerid, SpeedCar[playerid]);
	PlayerTextDrawDestroy(playerid, HPCar[playerid]);
	PlayerTextDrawDestroy(playerid, SkinShopBuy[playerid]);
	PlayerTextDrawDestroy(playerid, SkinShopPrev[playerid]);
	PlayerTextDrawDestroy(playerid, SkinShopNext[playerid]);
	PlayerTextDrawDestroy(playerid, S_Joystick[playerid]);
	PlayerTextDrawDestroy(playerid, S_UP[playerid]);
	PlayerTextDrawDestroy(playerid, S_DOWN[playerid]);
	PlayerTextDrawDestroy(playerid, S_LEFT[playerid]);
	PlayerTextDrawDestroy(playerid, S_RIGHT[playerid]);
	PlayerTextDrawDestroy(playerid, S_BACK[playerid]);
	PlayerTextDrawDestroy(playerid, MenuBG[playerid]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][0]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][1]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][2]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][3]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][4]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][5]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][6]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][7]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][8]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][9]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][10]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][11]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][12]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][13]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][14]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][15]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][16]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][17]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][18]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][19]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][20]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][21]);
	PlayerTextDrawDestroy(playerid, MenuButton[playerid][22]);	
	PlayerTextDrawDestroy(playerid, NextCar[playerid]);
	PlayerTextDrawDestroy(playerid, PrevCar[playerid]);
	PlayerTextDrawDestroy(playerid, NameCar[playerid]);
	PlayerTextDrawDestroy(playerid, CostCar[playerid]);
	PlayerTextDrawDestroy(playerid, LevelCar[playerid]);
	PlayerTextDrawDestroy(playerid, BuyCar[playerid]);
	PlayerTextDrawDestroy(playerid, SellCar[playerid]);
	PlayerTextDrawDestroy(playerid, AngleCarLeft[playerid]);
	PlayerTextDrawDestroy(playerid, AngleCarRight[playerid]);
}

stock LoadPlayerTD(playerid)
{
	main_info[playerid] = CreatePlayerTextDraw(playerid, 606.000000, 103.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, main_info[playerid], 255);
	PlayerTextDrawFont(playerid, main_info[playerid], 2);
	PlayerTextDrawLetterSize(playerid, main_info[playerid], 0.290000, 1.300000);
	PlayerTextDrawAlignment(playerid, main_info[playerid], 3);
	PlayerTextDrawColor(playerid, main_info[playerid], 0xFFFFFFFF);
	PlayerTextDrawSetOutline(playerid, main_info[playerid], 1);

	HPinfo[playerid] = CreatePlayerTextDraw(playerid, 550.000000, 64.000000, " ");
	PlayerTextDrawFont(playerid, HPinfo[playerid], 2);
	PlayerTextDrawSetShadow(playerid, HPinfo[playerid], 1);
	PlayerTextDrawLetterSize(playerid, HPinfo[playerid], 0.490000, 1.300000);
	PlayerTextDrawColor(playerid, HPinfo[playerid], 0xFFFFFFFF);

	ARinfo[playerid] = CreatePlayerTextDraw(playerid, 550.000000, 42.000000, " ");
	PlayerTextDrawFont(playerid, ARinfo[playerid], 2);
	PlayerTextDrawSetShadow(playerid, ARinfo[playerid], 1);
	PlayerTextDrawLetterSize(playerid, ARinfo[playerid], 0.490000, 1.300000);
	PlayerTextDrawColor(playerid, ARinfo[playerid], 0xFF0000FF);

	SpeedNameCar[playerid] = CreatePlayerTextDraw(playerid, 495.555541, 273.777587, " ");
	PlayerTextDrawLetterSize(playerid, SpeedNameCar[playerid], 0.449999, 1.600000);
	PlayerTextDrawAlignment(playerid, SpeedNameCar[playerid], 1);
	PlayerTextDrawColor(playerid, SpeedNameCar[playerid], -65281);
	PlayerTextDrawSetShadow(playerid, SpeedNameCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, SpeedNameCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, SpeedNameCar[playerid], 51);
	PlayerTextDrawFont(playerid, SpeedNameCar[playerid], 0);
	PlayerTextDrawSetProportional(playerid, SpeedNameCar[playerid], 1);

	FuelCarLabel[playerid] = CreatePlayerTextDraw(playerid, 505.000030, 312.148040, RTP("Бензин: "));
	PlayerTextDrawLetterSize(playerid, FuelCarLabel[playerid], 0.292222, 1.378519);
	PlayerTextDrawAlignment(playerid, FuelCarLabel[playerid], 1);
	PlayerTextDrawColor(playerid, FuelCarLabel[playerid], -1);
	PlayerTextDrawSetShadow(playerid, FuelCarLabel[playerid], 0);
	PlayerTextDrawSetOutline(playerid, FuelCarLabel[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, FuelCarLabel[playerid], 51);
	PlayerTextDrawFont(playerid, FuelCarLabel[playerid], 1);
	PlayerTextDrawSetProportional(playerid, FuelCarLabel[playerid], 1);

	FuelCarLevel[playerid] = CreatePlayerTextDraw(playerid, 546.333190, 311.111083, " ");
	PlayerTextDrawLetterSize(playerid, FuelCarLevel[playerid], 0.384444, 1.423703);
	PlayerTextDrawAlignment(playerid, FuelCarLevel[playerid], 1);
	PlayerTextDrawColor(playerid, FuelCarLevel[playerid], -5963521);
	PlayerTextDrawSetShadow(playerid, FuelCarLevel[playerid], 0);
	PlayerTextDrawSetOutline(playerid, FuelCarLevel[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, FuelCarLevel[playerid], 51);
	PlayerTextDrawFont(playerid, FuelCarLevel[playerid], 2);
	PlayerTextDrawSetProportional(playerid, FuelCarLevel[playerid], 1);

	LockedCar[playerid] = CreatePlayerTextDraw(playerid, 525.554931, 292.444335, RTP("~g~ОТКРЫТО"));
	PlayerTextDrawLetterSize(playerid, LockedCar[playerid], 0.384444, 1.205926);
	PlayerTextDrawAlignment(playerid, LockedCar[playerid], 1);
	PlayerTextDrawColor(playerid, LockedCar[playerid], -1);
	PlayerTextDrawSetShadow(playerid, LockedCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, LockedCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, LockedCar[playerid], 51);
	PlayerTextDrawFont(playerid, LockedCar[playerid], 1);
	PlayerTextDrawSetProportional(playerid, LockedCar[playerid], 1);

	SpeedCarLabel[playerid] = CreatePlayerTextDraw(playerid, 504.999725, 327.703674, RTP("Скорость:"));
	PlayerTextDrawLetterSize(playerid, SpeedCarLabel[playerid], 0.274444, 1.356296);
	PlayerTextDrawAlignment(playerid, SpeedCarLabel[playerid], 1);
	PlayerTextDrawColor(playerid, SpeedCarLabel[playerid], -1);
	PlayerTextDrawSetShadow(playerid, SpeedCarLabel[playerid], 0);
	PlayerTextDrawSetOutline(playerid, SpeedCarLabel[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, SpeedCarLabel[playerid], 51);
	PlayerTextDrawFont(playerid, SpeedCarLabel[playerid], 1);
	PlayerTextDrawSetProportional(playerid, SpeedCarLabel[playerid], 1);

	SpeedCar[playerid] = CreatePlayerTextDraw(playerid, 557.777709, 345.333374, RTP(" "));
	PlayerTextDrawLetterSize(playerid, SpeedCar[playerid], 0.449999, 1.600000);
	PlayerTextDrawAlignment(playerid, SpeedCar[playerid], 2);
	PlayerTextDrawColor(playerid, SpeedCar[playerid], -5963521);
	PlayerTextDrawSetShadow(playerid, SpeedCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, SpeedCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, SpeedCar[playerid], 51);
	PlayerTextDrawFont(playerid, SpeedCar[playerid], 2);
	PlayerTextDrawSetProportional(playerid, SpeedCar[playerid], 1);

	HPCar[playerid] = CreatePlayerTextDraw(playerid, 609.333740, 282.488616, "~g~0");
	PlayerTextDrawLetterSize(playerid, HPCar[playerid], 0.288333, 1.413333);
	PlayerTextDrawAlignment(playerid, HPCar[playerid], 3);
	PlayerTextDrawColor(playerid, HPCar[playerid], -1);
	PlayerTextDrawSetShadow(playerid, HPCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, HPCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, HPCar[playerid], 51);
	PlayerTextDrawFont(playerid, HPCar[playerid], 2);
	PlayerTextDrawSetProportional(playerid, HPCar[playerid], 1);

	TextDrawShowForPlayer(playerid, ServerLabel);
	TextDrawShowForPlayer(playerid, txtTimeDisp);
	
	SkinShopBuy[playerid] = CreatePlayerTextDraw(playerid, 391.000000, 312.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, SkinShopBuy[playerid], 80);
	PlayerTextDrawFont(playerid, SkinShopBuy[playerid], 5);
	PlayerTextDrawLetterSize(playerid, SkinShopBuy[playerid], 0.500000, 1.000000);
	PlayerTextDrawColor(playerid, SkinShopBuy[playerid], -1);
	PlayerTextDrawSetOutline(playerid, SkinShopBuy[playerid], 1);
	PlayerTextDrawSetProportional(playerid, SkinShopBuy[playerid], 1);
	PlayerTextDrawUseBox(playerid, SkinShopBuy[playerid], 1);
	PlayerTextDrawBoxColor(playerid, SkinShopBuy[playerid], -256);
	PlayerTextDrawTextSize(playerid, SkinShopBuy[playerid], 70.000000, 75.000000);
	PlayerTextDrawSetPreviewModel(playerid, SkinShopBuy[playerid], 1274);
	PlayerTextDrawSetPreviewRot(playerid, SkinShopBuy[playerid], 0.000000, 0.000000, 0.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, SkinShopBuy[playerid], 1);

	SkinShopPrev[playerid] = CreatePlayerTextDraw(playerid, 249.000000, 312.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, SkinShopPrev[playerid], 80);
	PlayerTextDrawFont(playerid, SkinShopPrev[playerid], 5);
	PlayerTextDrawLetterSize(playerid, SkinShopPrev[playerid], 0.500000, 1.000000);
	PlayerTextDrawColor(playerid, SkinShopPrev[playerid], 16711935);
	PlayerTextDrawSetOutline(playerid, SkinShopPrev[playerid], 1);
	PlayerTextDrawSetProportional(playerid, SkinShopPrev[playerid], 1);
	PlayerTextDrawUseBox(playerid, SkinShopPrev[playerid], 1);
	PlayerTextDrawBoxColor(playerid, SkinShopPrev[playerid], -256);
	PlayerTextDrawTextSize(playerid, SkinShopPrev[playerid], 70.000000, 75.000000);
	PlayerTextDrawSetPreviewModel(playerid, SkinShopPrev[playerid], 19133);
	PlayerTextDrawSetPreviewRot(playerid, SkinShopPrev[playerid], 0.000000, 270.000000, 90.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, SkinShopPrev[playerid], 1);

	SkinShopNext[playerid] = CreatePlayerTextDraw(playerid, 320.000000, 312.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, SkinShopNext[playerid], 80);
	PlayerTextDrawFont(playerid, SkinShopNext[playerid], 5);
	PlayerTextDrawLetterSize(playerid, SkinShopNext[playerid], 0.500000, 1.000000);
	PlayerTextDrawColor(playerid, SkinShopNext[playerid], 16711935);
	PlayerTextDrawSetOutline(playerid, SkinShopNext[playerid], 1);
	PlayerTextDrawSetProportional(playerid, SkinShopNext[playerid], 1);
	PlayerTextDrawUseBox(playerid, SkinShopNext[playerid], 1);
	PlayerTextDrawBoxColor(playerid, SkinShopNext[playerid], -256);
	PlayerTextDrawTextSize(playerid, SkinShopNext[playerid], 70.000000, 75.000000);
	PlayerTextDrawSetPreviewModel(playerid, SkinShopNext[playerid], 19133);
	PlayerTextDrawSetPreviewRot(playerid, SkinShopNext[playerid], 0.000000, 90.000000, 90.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, SkinShopNext[playerid], 1);

	S_Joystick[playerid] = CreatePlayerTextDraw(playerid, 472.666717, 273.777770, "joystick");
	PlayerTextDrawLetterSize(playerid, S_Joystick[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, S_Joystick[playerid], 146.999938, 138.548233);
	PlayerTextDrawAlignment(playerid, S_Joystick[playerid], 2);
	PlayerTextDrawColor(playerid, S_Joystick[playerid], 2373456);
	PlayerTextDrawUseBox(playerid, S_Joystick[playerid], true);
	PlayerTextDrawBoxColor(playerid, S_Joystick[playerid], 0);
	PlayerTextDrawSetShadow(playerid, S_Joystick[playerid], 0);
	PlayerTextDrawSetOutline(playerid, S_Joystick[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, S_Joystick[playerid], 0);
	PlayerTextDrawFont(playerid, S_Joystick[playerid], 5);
	PlayerTextDrawSetProportional(playerid, S_Joystick[playerid], 1);
	PlayerTextDrawSetPreviewModel(playerid, S_Joystick[playerid], 19272);
	PlayerTextDrawSetPreviewRot(playerid, S_Joystick[playerid], 90.000000, 0.000000, 0.000000, 1.000000);

	S_UP[playerid] = CreatePlayerTextDraw(playerid, 532.366760, 309.165924, "up");
	PlayerTextDrawLetterSize(playerid, S_UP[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, S_UP[playerid], 28.333335, 26.133413);
	PlayerTextDrawAlignment(playerid, S_UP[playerid], 2);
	PlayerTextDrawColor(playerid, S_UP[playerid], -1);
	PlayerTextDrawUseBox(playerid, S_UP[playerid], true);
	PlayerTextDrawBoxColor(playerid, S_UP[playerid], 0);
	PlayerTextDrawSetShadow(playerid, S_UP[playerid], 0);
	PlayerTextDrawSetOutline(playerid, S_UP[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, S_UP[playerid], -16777216);
	PlayerTextDrawFont(playerid, S_UP[playerid], 5);
	PlayerTextDrawSetProportional(playerid, S_UP[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, S_UP[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, S_UP[playerid], 19134);
	PlayerTextDrawSetPreviewRot(playerid, S_UP[playerid], 0.000000, 0.000000, 90.000000, 1.000000);

	S_DOWN[playerid] = CreatePlayerTextDraw(playerid, 533.333007, 375.333648, "down");
	PlayerTextDrawLetterSize(playerid, S_DOWN[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, S_DOWN[playerid], 28.333335, 26.133413);
	PlayerTextDrawAlignment(playerid, S_DOWN[playerid], 2);
	PlayerTextDrawColor(playerid, S_DOWN[playerid], -1);
	PlayerTextDrawUseBox(playerid, S_DOWN[playerid], true);
	PlayerTextDrawBoxColor(playerid, S_DOWN[playerid], 0);
	PlayerTextDrawSetShadow(playerid, S_DOWN[playerid], 0);
	PlayerTextDrawSetOutline(playerid, S_DOWN[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, S_DOWN[playerid], -6258944);
	PlayerTextDrawFont(playerid, S_DOWN[playerid], 5);
	PlayerTextDrawSetProportional(playerid, S_DOWN[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, S_DOWN[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, S_DOWN[playerid], 19134);
	PlayerTextDrawSetPreviewRot(playerid, S_DOWN[playerid], 0.000000, 180.000000, 90.000000, 1.000000);

	S_LEFT[playerid] = CreatePlayerTextDraw(playerid, 497.666503, 342.733703, "left");
	PlayerTextDrawLetterSize(playerid, S_LEFT[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, S_LEFT[playerid], 28.333335, 26.133413);
	PlayerTextDrawAlignment(playerid, S_LEFT[playerid], 2);
	PlayerTextDrawColor(playerid, S_LEFT[playerid], -1);
	PlayerTextDrawUseBox(playerid, S_LEFT[playerid], true);
	PlayerTextDrawBoxColor(playerid, S_LEFT[playerid], 0);
	PlayerTextDrawSetShadow(playerid, S_LEFT[playerid], 0);
	PlayerTextDrawSetOutline(playerid, S_LEFT[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, S_LEFT[playerid], -6258944);
	PlayerTextDrawFont(playerid, S_LEFT[playerid], 5);
	PlayerTextDrawSetProportional(playerid, S_LEFT[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, S_LEFT[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, S_LEFT[playerid], 19134);
	PlayerTextDrawSetPreviewRot(playerid, S_LEFT[playerid], 0.000000, 90.000000, 90.000000, 1.000000);

	S_RIGHT[playerid] = CreatePlayerTextDraw(playerid, 566.299804, 342.821044, "right");
	PlayerTextDrawLetterSize(playerid, S_RIGHT[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, S_RIGHT[playerid], 28.333335, 26.133413);
	PlayerTextDrawAlignment(playerid, S_RIGHT[playerid], 2);
	PlayerTextDrawColor(playerid, S_RIGHT[playerid], -1);
	PlayerTextDrawUseBox(playerid, S_RIGHT[playerid], true);
	PlayerTextDrawBoxColor(playerid, S_RIGHT[playerid], 0);
	PlayerTextDrawSetShadow(playerid, S_RIGHT[playerid], 0);
	PlayerTextDrawSetOutline(playerid, S_RIGHT[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, S_RIGHT[playerid], -6258944);
	PlayerTextDrawFont(playerid, S_RIGHT[playerid], 5);
	PlayerTextDrawSetProportional(playerid, S_RIGHT[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, S_RIGHT[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, S_RIGHT[playerid], 19134);
	PlayerTextDrawSetPreviewRot(playerid, S_RIGHT[playerid], 0.000000, 270.000000, 90.000000, 1.000000);

	S_BACK[playerid] = CreatePlayerTextDraw(playerid, 528.000000, 339.318664, "back");
	PlayerTextDrawLetterSize(playerid, S_BACK[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, S_BACK[playerid], 37.666671, 31.940759);
	PlayerTextDrawAlignment(playerid, S_BACK[playerid], 2);
	PlayerTextDrawColor(playerid, S_BACK[playerid], -55553);
	PlayerTextDrawUseBox(playerid, S_BACK[playerid], true);
	PlayerTextDrawBoxColor(playerid, S_BACK[playerid], 0);
	PlayerTextDrawSetShadow(playerid, S_BACK[playerid], 0);
	PlayerTextDrawSetOutline(playerid, S_BACK[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, S_BACK[playerid], 0);
	PlayerTextDrawFont(playerid, S_BACK[playerid], 5);
	PlayerTextDrawSetProportional(playerid, S_BACK[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, S_BACK[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, S_BACK[playerid], 19131);
	PlayerTextDrawSetPreviewRot(playerid, S_BACK[playerid], 0.000000, 0.000000, 90.000000, 1.000000);
	
	MenuButton[playerid][0] = CreatePlayerTextDraw(playerid, 542.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][0], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][0], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][0], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][0], 16732415);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][0], 1);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][0], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][0], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][0], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][0], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][0], 19133);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][0], 0.000000, 45.000000, 90.000000, 0.800000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][0], 1);

	MenuButton[playerid][1] = CreatePlayerTextDraw(playerid, 31.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][1], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][1], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][1], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][1], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][1], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][1], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][1], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][1], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][1], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][1], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][1], 0);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][1], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][1], 1);

	MenuButton[playerid][2] = CreatePlayerTextDraw(playerid, 104.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][2], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][2], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][2], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][2], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][2], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][2], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][2], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][2], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][2], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][2], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][2], 0);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][2], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][2], 1);
	
	MenuButton[playerid][3] = CreatePlayerTextDraw(playerid,177.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][3], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][3], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][3], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][3], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][3], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][3], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][3], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][3], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][3], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][3], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][3], 0);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][3], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][3], 1);

	MenuButton[playerid][4] = CreatePlayerTextDraw(playerid,250.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][4], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][4], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][4], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][4], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][4], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][4], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][4], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][4], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][4], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][4], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][4], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][4], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][4], 1);

	MenuButton[playerid][5] = CreatePlayerTextDraw(playerid,323.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][5], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][5], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][5], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][5], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][5], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][5], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][5], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][5], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][5], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][5], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][5], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][5], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][5], 1);

	MenuButton[playerid][6] = CreatePlayerTextDraw(playerid,396.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][6], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][6], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][6], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][6], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][6], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][6], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][6], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][6], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][6], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][6], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][6], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][6], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][6], 1);

	MenuButton[playerid][7] = CreatePlayerTextDraw(playerid,469.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][7], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][7], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][7], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][7], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][7], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][7], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][7], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][7], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][7], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][7], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][7], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][7], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][7], 1);

	MenuButton[playerid][8] = CreatePlayerTextDraw(playerid,542.000000, 215.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][8], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][8], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][8], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][8], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][8], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][8], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][8], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][8], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][8], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][8], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][8], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][8], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][8], 1);

	MenuButton[playerid][9] = CreatePlayerTextDraw(playerid,31.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][9], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][9], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][9], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][9], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][9], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][9], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][9], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][9], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][9], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][9], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][9], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][9], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][9], 1);

	MenuButton[playerid][10] = CreatePlayerTextDraw(playerid,104.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][10], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][10], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][10], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][10], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][10], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][10], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][10], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][10], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][10], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][10], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][10], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][10], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][10], 1);

	MenuButton[playerid][11] = CreatePlayerTextDraw(playerid,177.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][11], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][11], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][11], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][11], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][11], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][11], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][11], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][11], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][11], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][11], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][11], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][11], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][11], 1);

	MenuButton[playerid][12] = CreatePlayerTextDraw(playerid,250.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][12], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][12], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][12], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][12], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][12], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][12], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][12], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][12], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][12], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][12], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][12], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][12], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][12], 1);

	MenuButton[playerid][13] = CreatePlayerTextDraw(playerid,323.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][13], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][13], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][13], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][13], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][13], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][13], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][13], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][13], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][13], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][13], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][13], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][13], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][13], 1);

	MenuButton[playerid][14] = CreatePlayerTextDraw(playerid,396.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][14], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][14], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][14], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][14], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][14], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][14], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][14], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][14], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][14], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][14], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][14], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][14], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][14], 1);

	MenuButton[playerid][15] = CreatePlayerTextDraw(playerid,469.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][15], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][15], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][15], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][15], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][15], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][15], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][15], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][15], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][15], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][15], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][15], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][15], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][15], 1);

	MenuButton[playerid][16] = CreatePlayerTextDraw(playerid,542.000000, 288.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][16], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][16], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][16], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][16], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][16], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][16], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][16], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][16], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][16], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][16], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][16], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][16], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][16], 1);

	MenuButton[playerid][17] = CreatePlayerTextDraw(playerid,31.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][17], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][17], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][17], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][17], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][17], 0);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][17], 1);
	PlayerTextDrawSetShadow(playerid, MenuButton[playerid][17], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][17], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][17], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][17], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][17], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][17], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][17], 1);

	MenuButton[playerid][18] = CreatePlayerTextDraw(playerid,104.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][18], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][18], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][18], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][18], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][18], 1);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][18], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][18], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][18], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][18], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][18], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][18], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][18], 1);

	MenuButton[playerid][19] = CreatePlayerTextDraw(playerid,177.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][19], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][19], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][19], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][19], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][19], 1);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][19], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][19], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][19], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][19], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][19], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][19], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][19], 1);

	MenuButton[playerid][20] = CreatePlayerTextDraw(playerid,250.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][20], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][20], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][20], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][20], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][20], 1);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][20], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][20], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][20], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][20], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][20], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][20], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][20], 1);

	MenuButton[playerid][21] = CreatePlayerTextDraw(playerid,323.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][21], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][21], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][21], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][21], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][21], 1);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][21], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][21], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][21], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][21], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][21], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][21], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][21], 1);

	MenuButton[playerid][22] = CreatePlayerTextDraw(playerid,396.000000, 361.000000, " ");
	PlayerTextDrawBackgroundColor(playerid, MenuButton[playerid][22], 80);
	PlayerTextDrawFont(playerid, MenuButton[playerid][22], 5);
	PlayerTextDrawLetterSize(playerid, MenuButton[playerid][22], 0.090000, -0.100000);
	PlayerTextDrawColor(playerid, MenuButton[playerid][22], -1);
	PlayerTextDrawSetOutline(playerid, MenuButton[playerid][22], 1);
	PlayerTextDrawSetProportional(playerid, MenuButton[playerid][22], 1);
	PlayerTextDrawUseBox(playerid, MenuButton[playerid][22], 1);
	PlayerTextDrawBoxColor(playerid, MenuButton[playerid][22], 80);
	PlayerTextDrawTextSize(playerid, MenuButton[playerid][22], 70.000000, 70.000000);
	PlayerTextDrawSetPreviewModel(playerid, MenuButton[playerid][22], 411);
	PlayerTextDrawSetPreviewRot(playerid, MenuButton[playerid][22], -16.000000, 0.000000, -55.000000, 1.000000);
	PlayerTextDrawSetSelectable(playerid, MenuButton[playerid][22], 1);
	
	NextCar[playerid] = CreatePlayerTextDraw(playerid, 390.000000, 360.000000, "right");
	PlayerTextDrawLetterSize(playerid, NextCar[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, NextCar[playerid], 70.000000, 70.000000);
	PlayerTextDrawAlignment(playerid, NextCar[playerid], 3);
	PlayerTextDrawColor(playerid, NextCar[playerid], -16711681);
	PlayerTextDrawUseBox(playerid, NextCar[playerid], true);
	PlayerTextDrawBoxColor(playerid, NextCar[playerid], -16776961);
	PlayerTextDrawSetShadow(playerid, NextCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, NextCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, NextCar[playerid], 80);
	PlayerTextDrawFont(playerid, NextCar[playerid], 5);
	PlayerTextDrawSetProportional(playerid, NextCar[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, NextCar[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, NextCar[playerid], 19133);
	PlayerTextDrawSetPreviewRot(playerid, NextCar[playerid], 90.000000, 90.000000, 0.000000, 1.000000);

	PrevCar[playerid] = CreatePlayerTextDraw(playerid, 180.000000, 360.000000, "left");
	PlayerTextDrawLetterSize(playerid, PrevCar[playerid], 0.449999, 1.600000);
	PlayerTextDrawTextSize(playerid, PrevCar[playerid], 70.000000, 70.000000);
	PlayerTextDrawAlignment(playerid, PrevCar[playerid], 1);
	PlayerTextDrawColor(playerid, PrevCar[playerid], -16711681);
	PlayerTextDrawUseBox(playerid, PrevCar[playerid], true);
	PlayerTextDrawBoxColor(playerid, PrevCar[playerid], -16776961);
	PlayerTextDrawSetShadow(playerid, PrevCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, PrevCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, PrevCar[playerid], 80);
	PlayerTextDrawFont(playerid, PrevCar[playerid], 5);
	PlayerTextDrawSetProportional(playerid, PrevCar[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, PrevCar[playerid], true);
	PlayerTextDrawSetPreviewModel(playerid, PrevCar[playerid], 19133);
	PlayerTextDrawSetPreviewRot(playerid, PrevCar[playerid], 90.000000, 270.000000, 0.000000, 1.000000);

	NameCar[playerid] = CreatePlayerTextDraw(playerid, 320.000000, 345.540863, "Infernus");
	PlayerTextDrawLetterSize(playerid, NameCar[playerid], 0.488333, 1.587555);
	PlayerTextDrawTextSize(playerid, NameCar[playerid], 674.666748, 111.999870);
	PlayerTextDrawAlignment(playerid, NameCar[playerid], 2);
	PlayerTextDrawColor(playerid, NameCar[playerid], 16711880);
	PlayerTextDrawSetShadow(playerid, NameCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, NameCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, NameCar[playerid], 51);
	PlayerTextDrawFont(playerid, NameCar[playerid], 0);
	PlayerTextDrawSetProportional(playerid, NameCar[playerid], 1);

	CostCar[playerid] = CreatePlayerTextDraw(playerid, 319.999969, 361.888946, "$3000000");
	PlayerTextDrawLetterSize(playerid, CostCar[playerid], 0.455666, 1.869629);
	PlayerTextDrawTextSize(playerid, CostCar[playerid], 674.666748, 111.999870);
	PlayerTextDrawAlignment(playerid, CostCar[playerid], 2);
	PlayerTextDrawColor(playerid, CostCar[playerid], -5963521);
	PlayerTextDrawSetShadow(playerid, CostCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, CostCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, CostCar[playerid], 51);
	PlayerTextDrawFont(playerid, CostCar[playerid], 2);
	PlayerTextDrawSetProportional(playerid, CostCar[playerid], 1);

	LevelCar[playerid] = CreatePlayerTextDraw(playerid, 319.999969, 377.888946, "30");
	PlayerTextDrawLetterSize(playerid, LevelCar[playerid], 0.455666, 1.869629);
	PlayerTextDrawTextSize(playerid, LevelCar[playerid], 674.666748, 111.999870);
	PlayerTextDrawAlignment(playerid, LevelCar[playerid], 2);
	PlayerTextDrawColor(playerid, LevelCar[playerid], -65281);
	PlayerTextDrawSetShadow(playerid, LevelCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, LevelCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, LevelCar[playerid], 51);
	PlayerTextDrawFont(playerid, LevelCar[playerid], 2);
	PlayerTextDrawSetProportional(playerid, LevelCar[playerid], 1);

	BuyCar[playerid] = CreatePlayerTextDraw(playerid, 320.333465, 319.940826, RTP("Купить"));
	PlayerTextDrawLetterSize(playerid, BuyCar[playerid], 0.524998, 2.189035);
	PlayerTextDrawTextSize(playerid, BuyCar[playerid], 15.000000, 87.000000);
	PlayerTextDrawAlignment(playerid, BuyCar[playerid], 2);
	PlayerTextDrawColor(playerid, BuyCar[playerid], -1);
	PlayerTextDrawSetShadow(playerid, BuyCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, BuyCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, BuyCar[playerid], 0);
	PlayerTextDrawFont(playerid, BuyCar[playerid], 2);
	PlayerTextDrawSetProportional(playerid, BuyCar[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, BuyCar[playerid], true);

	SellCar[playerid] = CreatePlayerTextDraw(playerid, 319.999328, 408.466979, RTP("Продать свой транспорт"));
	PlayerTextDrawLetterSize(playerid, SellCar[playerid], 0.285664, 1.205924);
	PlayerTextDrawTextSize(playerid, SellCar[playerid], 25.000000, 95.000000);
	PlayerTextDrawAlignment(playerid, SellCar[playerid], 2);
	PlayerTextDrawColor(playerid, SellCar[playerid], -1);
	PlayerTextDrawUseBox(playerid, SellCar[playerid], true);
	PlayerTextDrawBoxColor(playerid, SellCar[playerid], 0);
	PlayerTextDrawSetShadow(playerid, SellCar[playerid], 0);
	PlayerTextDrawSetOutline(playerid, SellCar[playerid], 1);
	PlayerTextDrawBackgroundColor(playerid, SellCar[playerid], 0);
	PlayerTextDrawFont(playerid, SellCar[playerid], 2);
	PlayerTextDrawSetProportional(playerid, SellCar[playerid], 1);
	PlayerTextDrawSetSelectable(playerid, SellCar[playerid], true);
	
	AngleCarLeft[playerid] = CreatePlayerTextDraw(playerid, 389.000000, 312.000000, "ld_beat:left");
	PlayerTextDrawLetterSize(playerid, AngleCarLeft[playerid], 0.000000, 0.000000);
	PlayerTextDrawTextSize(playerid, AngleCarLeft[playerid], 20.666709, 19.496292);
	PlayerTextDrawAlignment(playerid, AngleCarLeft[playerid], 1);
	PlayerTextDrawColor(playerid, AngleCarLeft[playerid], -1);
	PlayerTextDrawSetShadow(playerid, AngleCarLeft[playerid], 0);
	PlayerTextDrawSetOutline(playerid, AngleCarLeft[playerid], 0);
	PlayerTextDrawFont(playerid, AngleCarLeft[playerid], 4);
	PlayerTextDrawSetSelectable(playerid, AngleCarLeft[playerid], true);

	AngleCarRight[playerid] = CreatePlayerTextDraw(playerid, 413.000000, 312.000000, "ld_beat:right");
	PlayerTextDrawLetterSize(playerid, AngleCarRight[playerid], 0.000000, 0.000000);
	PlayerTextDrawTextSize(playerid, AngleCarRight[playerid], 20.666709, 19.496292);
	PlayerTextDrawAlignment(playerid, AngleCarRight[playerid], 1);
	PlayerTextDrawColor(playerid, AngleCarRight[playerid], -1);
	PlayerTextDrawSetShadow(playerid, AngleCarRight[playerid], 0);
	PlayerTextDrawSetOutline(playerid, AngleCarRight[playerid], 0);
	PlayerTextDrawFont(playerid, AngleCarRight[playerid], 4);
	PlayerTextDrawSetSelectable(playerid, AngleCarRight[playerid], true);
}

stock CreateAdminVehicle(playerid, vid, color1, color2)
{
	switch(vid)
	{
		case 449,537,538,569,570: AdminCarID[playerid][AdminCarCount[playerid]] = AddStaticVehicleEx(vid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]+2, PI[playerid][A]+90, color1, color2, 300);
		default: AdminCarID[playerid][AdminCarCount[playerid]] = VehInFront(playerid, vid, color1, color2);
	}
	new vuid = AdminCarID[playerid][AdminCarCount[playerid]];
	ToggleEngine(vuid);
	SetVehicleNumberPlate(vuid, "ADMIN");
	SetVehicleToRespawn(vuid);
	LinkVehicleToInterior(vuid,GetPlayerInterior(playerid));
	SetVehicleVirtualWorld(vuid,GetPlayerVirtualWorld(playerid));
	AdminCarCount[playerid]++;
	VehOfAdmin[vuid] = true;
	AdminsCarsCount++;
}

stock DestroyAdminVehicle(vid)
{
	Engine[vid] = false;
	CarLocked[vid] = false;
	VehOfAdmin[vid] = false;
	DestroyVehicle(vid);
	AdminsCarsCount--;
}

stock VehInFront(playerid, vehiclemodel, color1, color2)
{
	new Float:x,Float:y,Float:z;
	new Float:facing;
	new Float:distance;

    GetPlayerPos(playerid, x, y, z);
    GetPlayerFacingAngle(playerid, facing);

    new Float:size_x,Float:size_y,Float:size_z;
	GetVehicleModelInfo(vehiclemodel, VEHICLE_MODEL_INFO_SIZE, size_x, size_y, size_z);

	distance = size_x + 0.5;

  	x += (distance * floatsin(-facing, degrees));
    y += (distance * floatcos(-facing, degrees));

	facing += 90.0;
	if(facing > 360.0) facing -= 360.0;

	return CreateVehicle(vehiclemodel, x, y, z + (size_z * 0.25), facing, color1, color2, -1);
}

stock GetFrontPlayer(playerid, &Float:x, &Float:y, Float:distance)
{
    new Float:z, Float:angle;
 	GetPlayerPos(playerid, x, y, z);
	GetPlayerFacingAngle(playerid, angle);
    x += (distance * floatsin(-angle, degrees));
    y += (distance * floatcos(-angle, degrees));
}

stock alog(msg[], type)
{
 	new day,month,year,hours,minutes,seconds;
	gettime(hours,minutes,seconds);
 	getdate(year, month, day);
 	mysql_format(mysql1, query1, sizeof(query1), "INSERT INTO `admin_log` (`Day`,`Month`,`Year`,`Time`,`Event`,`Type`) VALUES ('%d','%d','%d','%d:%d:%d','%e','%d')",day,month,year,hours,minutes,seconds,msg,type);
 	mysql_query(mysql1, query1, false);
	printf("[%d.%d.%d %d:%d:%d] %s", day,month,year,hours,minutes,seconds, msg);
	return true;
}
stock chatlog(playerid, msg[], type)
{
	new day,month,year,hours,minutes,seconds;
	gettime(hours,minutes,seconds);
 	getdate(year, month, day);
	mysql_format(mysql1, query1, sizeof(query1), "INSERT INTO `chat_log` (`Day`,`Month`,`Year`,`Time`,`Type`,`PlayerID`,`Nick`,`Message`) VALUES ('%d', '%d', '%d','%d:%d:%d','%d','%d','%s','%e')",day,month,year,hours,minutes,seconds,type, PI[playerid][ID], Name(playerid), msg);
	mysql_query(mysql1, query1, false);
	printf("[%d.%d.%d %d:%d:%d] %s [ID: %d | uID: %d] (%d): %s", day,month,year,hours,minutes,seconds, Name(playerid), playerid, PI[playerid][ID], type, msg);
	return true;
}

stock RTP(str1[]) {new tmp[144]; ConvertRusToPwn(str1,tmp,sizeof(tmp)); return tmp;}
stock spawnPlayer(playerid)
{
	new skinid;
    if(PI[playerid][Faction] != 0) skinid = PI[playerid][fSkin];
	else skinid = PI[playerid][Skin];
	if(PIpen[playerid][JailTime] > 0)
	{
	    new rand = random(sizeof(jailspawn));
		SetSpawnInfo(playerid, NO_TEAM, skinid, jailspawn[rand][0], jailspawn[rand][1], jailspawn[rand][2],0.0,0,0,0,0,0,0);
		SetPlayerInterior(playerid, 10);
		SetPlayerVirtualWorld(playerid, 0);
	}
	else if(PIpen[playerid][Cheater] == 1)
	{
		SetSpawnInfo(playerid, NO_TEAM, skinid, 2489.0308,-1669.8937,13.3359,181.6941,0,0,0,0,0,0);
		SetPlayerVirtualWorld(playerid, 666777);
		SetPlayerScore(playerid, -1);
	}
	else if(PI[playerid][SavePosition] == 1 && GetPVarInt(playerid, "InSpec") == 0)
	{
		SetSpawnInfo(playerid, NO_TEAM, skinid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z], PI[playerid][A],0,0,0,0,0,0);
		SetPlayerInterior(playerid, PI[playerid][Interior]);
		SetPlayerVirtualWorld(playerid, PI[playerid][VW]);
		ShowNews(playerid);
	}
	else if(GetPVarInt(playerid, "InSpec"))
	{
		SetPVarInt(playerid, "InSpec", 0);
		SetPVarInt(playerid, "SpecID", PLAYERS);
		SetSpawnInfo(playerid, NO_TEAM, skinid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z], PI[playerid][A],0,0,0,0,0,0);
		SetPlayerInterior(playerid, GetPVarInt(playerid, "InSpecInt"));
		SetPlayerVirtualWorld(playerid, GetPVarInt(playerid, "InSpecWorld"));
	}
	else if(PI[playerid][House] != 0 && PIpen[playerid][JailTime] == 0)
	{
		SetSpawnInfo(playerid, NO_TEAM, skinid, HouseCoord[HI[PI[playerid][House]][Interior]][0],HouseCoord[HI[PI[playerid][House]][Interior]][1],HouseCoord[HI[PI[playerid][House]][Interior]][2],HouseCoord[HI[PI[playerid][House]][Interior]][3],0,0,0,0,0,0);
		SetPlayerInterior(playerid, HouseInt[HI[PI[playerid][House]][Interior]]);
		SetPlayerVirtualWorld(playerid, PI[playerid][House]);
		SetPVarInt(playerid, "InHouse", PI[playerid][House]);
		ShowNews(playerid);
	} else {
		if(PI[playerid][Faction] != 0)
		{
		    switch(PI[playerid][Faction])
		    {
		        case 1:
				{
					SetSpawnInfo(playerid, NO_TEAM, skinid,342.9664,238.6950,1003.3078,285.6440,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 3);
					SetPlayerVirtualWorld(playerid, 1);
		        }
		        case 2:
				{
					SetSpawnInfo(playerid, NO_TEAM, skinid,342.9664,238.6950,1003.3078,285.6440,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 3);
					SetPlayerVirtualWorld(playerid, 2);
		        }
		        case 3:
				 {
					SetSpawnInfo(playerid, NO_TEAM, skinid,342.9664,238.6950,1003.3078,285.6440,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 3);
					SetPlayerVirtualWorld(playerid, 3);
		        }
		        case 4:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid,253.7740,66.7018,1003.6406,91.3420,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 6);
		        }
		        case 5:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid,246.5101,115.4321,1003.2188,0.6073,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 10);
		        }
		        case 6:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid,237.6665,155.0320,1003.0234,181.4095,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 3);
		        }
				case 7:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid,1716.7177,-1662.4235,20.2284,358.8708,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 18);
					SetPlayerVirtualWorld(playerid, 1);
		        }
		        case 8:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid,1716.7177,-1662.4235,20.2284,358.8708,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 18);
					SetPlayerVirtualWorld(playerid, 2);
		        }
		        case 9:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid,1716.7177,-1662.4235,20.2284,358.8708,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 18);
					SetPlayerVirtualWorld(playerid, 3);
		        }
		        case 10:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid, 1063.7347,-345.1801,2127.4309,80.3791,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 1);
					SetPlayerVirtualWorld(playerid, 1);
		        }
		        case 11:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid, 1063.7347,-345.1801,2127.4309,80.3791,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 1);
					SetPlayerVirtualWorld(playerid, 2);
		        }
		        case 12:
		        {
					SetSpawnInfo(playerid, NO_TEAM, skinid, 1063.7347,-345.1801,2127.4309,80.3791,0,0,0,0,0,0);
		            SetPlayerInterior(playerid, 1);
					SetPlayerVirtualWorld(playerid, 3);
		        }
		    }
		} else {
			switch(random(5))
			{
				case 0: SetSpawnInfo(playerid, NO_TEAM, skinid, 2793.6438,-1601.8448,10.9278,327.3493,0,0,0,0,0,0);
				case 1: SetSpawnInfo(playerid, NO_TEAM, skinid, 2798.7825,-1599.2738,10.9299,336.4361,0,0,0,0,0,0);
				case 2: SetSpawnInfo(playerid, NO_TEAM, skinid, 2794.4900,-1596.9397,10.9263,336.4361,0,0,0,0,0,0);
				case 3: SetSpawnInfo(playerid, NO_TEAM, skinid, 2797.2981,-1595.9851,10.9305,335.6005,0,0,0,0,0,0);
				case 4: SetSpawnInfo(playerid, NO_TEAM, skinid, 2796.1865,-1593.5310,10.9279,324.9471,0,0,0,0,0,0);
				case 5: SetSpawnInfo(playerid, NO_TEAM, skinid, 2791.0125,-1608.7769,10.9219,338.6295,0,0,0,0,0,0);
			}
			SetPlayerInterior(playerid, 0);
			SetPlayerVirtualWorld(playerid, 0);
		}
		ShowNews(playerid);
	}
	SetTimerEx("OnKeys", 2000, false, "d", playerid);
	if(IsPlayerInAnyVehicle(playerid)) ClearAnimations(playerid);
	SpawnPlayer(playerid);
	SetPVarInt(playerid, "Dead", 0);
}

forward UnBanIP(playerid, ip[]);
public UnBanIP(playerid, ip[])
{
	if(!cache_affected_rows()) return SendClientMessage(playerid, COLOR_SYSTEM, "IP не забанен");
	else
	{
		format(glstr, sizeof(glstr), "Админ %s [%d] разбанил IP %s", Name(playerid), playerid, ip);
		SendClientMessageToAll(0x962929FF, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] разбанил IP %s", Name(playerid), PI[playerid][ID], ip);
		alog(glstr, 0);
		mysql_format(mysql1, query1, sizeof(query1), "DELETE FROM `bans` WHERE `IP` = '%s'", ip);
		mysql_query(mysql1, query1, false);
		format(glstr, sizeof(glstr), "unbanip %s", ip);
		SendRconCommand(glstr);
		SendRconCommand("reloadbans");
	}
	return true;
}

stock DeleteAccount(name[])
{
	mysql_format(mysql1, query1, sizeof(query1), "SELECT `ID`,`House` FROM `users` WHERE `Nick` = '%e'", name);
	mysql_tquery(mysql1, query1, "DeleteAccountSQL", "");
}


stock AccountInGame(accountid)
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || PI[i][ID] != accountid) continue;
		return true;
	}
	return false;
}

bool:emptyMessage(string[])
{
    for(new i; string[i]; i++)
    {
        switch(string[i])
        {
            case 0x20: continue;
            default: return false;
        }
    }
    return true;
}

forward MuteAccount(playerid, plid, time, reason[]);
public MuteAccount(playerid, plid, time, reason[])
{
	if(AccountInGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт онлайн");        
	if(!cache_affected_rows()) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунта с таким номером нет");
	new tmp, _query[128];
	cache_get_value_name_int(0, "MuteTime", tmp); 
	if(time != 0 && tmp > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт уже заглушен");
	else if(time == 0 && tmp == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт не заглушен");
	
	if(time == 0)
	{
		mysql_format(mysql1, _query, sizeof(_query), "UPDATE `penalty` SET `MuteTime` = '%d', `MuteCount` = `MuteCount`- 1  WHERE `PlayerID` = '%d'", time, plid);
		format(glstr, sizeof(glstr), "Админ %s [%d] разглушил аккаунт %s [%d]", Name(playerid), playerid, GetNick(plid), plid);
		SendClientMessageToAll(0x00FF00FF, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] разглушил аккаунт %s [%d]", Name(playerid), PI[playerid][ID], GetNick(plid), plid);
		alog(glstr, 0);
	} else {
		mysql_format(mysql1, _query, sizeof(_query), "UPDATE `penalty` SET `MuteTime` = '%d', `MuteCount` = `MuteCount` + 1  WHERE `PlayerID` = '%d'", time, plid);
		if(emptyMessage(reason))
		{
			format(glstr, sizeof(glstr), "Админ %s [%d] заглушил аккаунт %s [%d] на %s", Name(playerid), playerid, GetNick(plid), plid, MTF(time));
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] заглушил аккаунт %s [%d] на %s, причина: %s", Name(playerid), playerid, GetNick(plid), plid, MTF(time), reason);
		}
		SendClientMessageToAll(COLOR_ADMIN, glstr);
		if(emptyMessage(reason))
		{
			format(glstr, sizeof(glstr), "Админ %s [%d] заглушил аккаунт %s [%d] на %s", Name(playerid), PI[playerid][ID], GetNick(plid), plid, MTF(time));
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] заглушил аккаунт %s [%d] на %s, причина: %s", Name(playerid), PI[playerid][ID], GetNick(plid), plid, MTF(time), reason);
		}
		alog(glstr, 0);
	}
	
	mysql_query(mysql1, _query, false);
	
	return true;
}

forward MuteAccountCMD(playerid, plid, time, reason[]);
public MuteAccountCMD(playerid, plid, time, reason[])
{
	if(AccountInGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт онлайн");
	new tmp;      
	if(!cache_affected_rows()) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунта с таким номером нет");
	cache_get_value_name_int(0, "MuteCMD", tmp); 
	if(time != 0 && tmp > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "На аккаунте уже есть запрет использования команд и меню");
	else if(time == 0 && tmp == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "На аккаунте нет запрета использования команд и меню");
	else if(time == 0)
	{
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `penalty` SET `MuteCMD` = '%d'  WHERE `PlayerID` = '%d'", time, plid);
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя снимать запрет на использвание команд и меню");
		format(glstr, sizeof(glstr), "Админ %s [%d] снял запрет на использование команд и меню с аккаунта %s [%d]", Name(playerid), playerid, GetNick(plid), plid);
		SendClientMessageToAll(0x00FF00FF, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] снял запрет на использование команд и меню c аккаунта %s [%d]", Name(playerid), PI[playerid][ID], GetNick(plid), PI[plid][ID]);
		alog(glstr, 0);
	} else {
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `penalty` SET `MuteCMD` = '%d' WHERE `PlayerID` = '%d'", time, plid);
		if(emptyMessage(reason))
		{
			format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню аккаунту %s [%d] на %s", Name(playerid), playerid, GetNick(plid), plid, MTF(time));
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню аккаунту %s [%d] на %s, причина: %s", Name(playerid), playerid, GetNick(plid), plid, MTF(time), reason);
		}
		SendClientMessageToAll(COLOR_ADMIN, glstr);
		if(emptyMessage(reason))
		{
			format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню игроку аккаунту %s [%d] на %s", Name(playerid), PI[playerid][ID], GetNick(plid), plid, MTF(time));
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню игроку аккаунту %s [%d] на %s, причина: %s", Name(playerid), PI[playerid][ID], GetNick(plid), plid, MTF(time), reason);
		}
		alog(glstr, 0);
	}
	mysql_query(mysql1, query1, false);
	return true;
}

forward JailAccount(playerid, plid, time, reason[]);
public JailAccount(playerid, plid, time, reason[])
{
	if(AccountInGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт онлайн");
	new tmp;
	if(!cache_affected_rows()) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунта с таким номером нет");
	cache_get_value_name_int(0, "JailTime", tmp); 
	if(time != 0 && tmp > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт уже в тюрьме");
	else if(time == 0 && tmp == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Аккаунт не в тюрьме");
	else if(time == 0)
	{
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `penalty` SET `JailTime` = '%d'  WHERE `PlayerID` = '%d'", time, plid);
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя выпускать игроков из тюрьмы");
		format(glstr, sizeof(glstr), "Админ %s [%d] выпустил аккаунт %s [%d] из тюрьмы", Name(playerid), playerid, GetNick(plid), plid);
		SendClientMessageToAll(0x00FF00FF, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] выпустил аккаунт %s [%d] из тюрьмы", Name(playerid), PI[playerid][ID], GetNick(plid), PI[plid][ID]);
		alog(glstr, 0);
	} else {
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `penalty` SET `JailTime` = '%d' WHERE `PlayerID` = '%d'", time, plid);
		if(emptyMessage(reason))
		{
			format(glstr, sizeof(glstr), "Админ %s [%d] посадил аккаунт %s [%d] в тюрьму на %s", Name(playerid), playerid, GetNick(plid), plid, MTF(time));
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] посадил аккаунт %s [%d] в тюрьму на %s, причина: %s", Name(playerid), playerid, GetNick(plid), plid, MTF(time), reason);
		}
		SendClientMessageToAll(COLOR_ADMIN, glstr);
		if(emptyMessage(reason))
		{
			format(glstr, sizeof(glstr), "Админ %s [%d] посадил аккаунт %s [%d] в тюрьму на %s", Name(playerid), PI[playerid][ID], GetNick(plid), plid, MTF(time));
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] посадил аккаунт %s [%d] в тюрьму на %s, причина: %s", Name(playerid), PI[playerid][ID], GetNick(plid), plid, MTF(time), reason);
		}
		alog(glstr, 0);
	}
	mysql_query(mysql1, query1, false);
	return true;
}

forward IsPlayerRegister(playerid);
public IsPlayerRegister(playerid)
{
	new body[256], tmp[70], _rowsCount;
	cache_get_row_count(_rowsCount);
	if(!_rowsCount)
	{
	    format(tmp, sizeof(tmp), "{FFFFFF}Аккаунт {00FFFF}%s {00FF00}не зарегистрирован", Name(playerid));
	    strcat(body, tmp);
	    strcat(body, "\n{FFFFFF}Введи пароль для регистрации:");
	    return ShowPlayerDialog(playerid, D_REG, DIALOG_STYLE_INPUT, "{FFFFFF}Регистрация", body, "Далее", "Опции");
	} else {
		format(tmp, sizeof(tmp), "{FFFFFF}Аккаунт {00FFFF}%s {FF0000}зарегистрирован", Name(playerid));
	    strcat(body, tmp);
	    strcat(body, "\n{FFFFFF}Введи пароль для авторизации:");
		/*mysql_format(mysql1, query1, sizeof(query1), "SELECT `LastIP` FROM  `users` WHERE `Nick` =  '%s'", Name(playerid));
		mysql_query(mysql1, query1, false);
		mysql_fetch_field_row(tmp, "LastIP");
		if(!strcmp(tmp, GetIP(playerid), true))
		{
			LoadAccount(playerid);
			spawnPlayer(playerid);
			new year, month, day, hours, mins, sec;
			getdate(year, month, day);
			gettime(hours, mins, sec);
			mysql_format(mysql1, query1,sizeof(query1),"UPDATE `users` SET `LoginDate` = '%d.%d.%d', `LoginTime` = '%d:%d:%d', `LastIP` = '%s' WHERE `Nick` = '%s'", day, month, year, hours, mins, sec, GetIP(playerid), Name(playerid));
			mysql_query(mysql1, query1, false);
	    	printf("[Авторизация] %s [%d] (%d) IP: %s",Name(playerid),playerid,PI[playerid][ID],GetIP(playerid));
			return true;
		} else*/
		
		return ShowPlayerDialog(playerid, D_AUT, DIALOG_STYLE_PASSWORD, "{FFFFFF}Авторизация", body, "ОК", "Опции");
	}
}

stock IsNumberFree(number)
{
	/*mysql_format(mysql1, query1, sizeof(query1), "SELECT `ID` FROM `users` WHERE `PhoneNumber` = '%d'", number);
	mysql_query(mysql1, query1, false);
	mysql_store_result();
	if(!mysql_fetch_row_mysql_format(mysql1, query1))
	{
  		return false;
	}*/
	return false;
} 

stock IsNumberOnline(number)
{
	for(new i;i<PLAYERS;i++)
	{
		if(PI[i][PhoneNumber] == number) return true;
	}
	return false;
}

stock firstJoin(playerid)
{
	mysql_format(mysql1, query1, sizeof(query1), "SELECT `ID` FROM `users` WHERE `Nick` = '%e' LIMIT 1", Name(playerid)); 
    mysql_tquery(mysql1, query1, "IsPlayerRegister", "d", playerid);
	return true;
}

stock ChangeKey(playerid, newkey[])
{
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Key` = '%e' WHERE `ID` = '%d'", newkey, PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
	format(PI[playerid][Key], 64, "%s", newkey);
}
stock IsValidKey(playerid)
{
	if(!strcmp(PI[playerid][Key], "NULL", false)) return false;
	return true;
}

stock ChangeEmail(playerid, newemail[])
{
    mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Email` = '%e' WHERE `ID` = '%d'", newemail, PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
	format(PI[playerid][Email], 32, "%s", newemail);
}
stock IsOkEmail(playerid)
{
	if(!strcmp(PI[playerid][Email], "NULL", false)) return false;
	return true;
}

stock ChangePassword(accountid, newpass[])
{
	new pass[33];
	md5(pass, newpass);
    mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Password` = '%s' WHERE `ID` = '%d'", pass, accountid);
	mysql_query(mysql1, query1, false);
}

stock IsRPNick(plname[])
{
	new 
	tmpn[24],
	File:file;
	//d = strfind(plname, "_")
	
	if((file = fopen("NRP_Nicks.ini",io_read)))
	{
		while(fread(file,tmpn))
		{
			for(new i = 0, j = strlen(tmpn); i < j; i++) if(tmpn[i] == '\n' || tmpn[i] == '\r') tmpn[i] = '\0';
			if(!strcmp(plname,tmpn, false)) return true;
		}
		fclose(file);
	} else {
		return false;
	}
	if(!IsValidNickName(plname)) return false;
  	/*if(d == -1) return false;
	if(plname[0] >= 192 && plname[0] <= 223) {}
	else if(plname[0] >= 65 && plname[0] <= 90) {}
	else return false;

	if(plname[d+1] >= 192 && plname[d+1] <= 223) {}
	else if(plname[d+1] >= 65 && plname[d+1] <= 90) {}
	else return false;

	for(new i=1;i<d;i++)
	{
		if(plname[i] >= 224 && plname[i] <= 255) continue;
		if(plname[i] >= 97 && plname[i] <= 122) continue;
		return false;
	}
	for(new i=d+2;i<strlen(plname);i++)
	{
		if(plname[i] >= 224 && plname[i] <= 255) continue;
		if(plname[i] >= 97 && plname[i] <= 122) continue;
		return false;
	}*/
    return true;
}

stock GetName(playerid, bool:part)
{
    new name[12], surname[12];
	sscanf(Name(playerid), "p< >s[12]s[12]", name,surname);
    if(part)
    {
        return name;
    } else {
        return surname;
    }
}

stock GetAnimName(playerid)
{
	new animlib[32], animname[32];
	GetAnimationName(GetPlayerAnimationIndex(playerid),animlib,32,animname,32);
	return animname;
}

forward AllowRegSkin(playerid);
public AllowRegSkin(playerid)
{
	LockRegSkin[playerid] = false;
}

forward ChangeRegSkin(playerid);
public ChangeRegSkin(playerid)
{
	SetPlayerPos(playerid, CamsRegSkinsLook[NowSkinReg[playerid]][0],CamsRegSkinsLook[NowSkinReg[playerid]][1],CamsRegSkinsLook[NowSkinReg[playerid]][2]);
	SetPlayerFacingAngle(playerid, CamsRegSkinsLook[NowSkinReg[playerid]][3]);
	SetPlayerSkin(playerid, SkinsForReg[NowSkinReg[playerid]][PI[playerid][Sex]]);
}

forward CloseLicGates();
public CloseLicGates()
{
	MoveDynamicObject(Gate_Lic[0], -2061.8994, -90.70019, 34.8+0.002,0.002, 0, 90.00000000, 270.0);
}

forward OnKeys(playerid);
public OnKeys(playerid)
{
	TogglePlayerControllable(playerid, true);
}

forward OnKeysBus(playerid);
public OnKeysBus(playerid)
{
	TogglePlayerControllable(playerid, true);
	SendClientMessage(playerid, 0x00FF00FF, "Продолжай путь");
}

forward GiveWood(playerid);
public GiveWood(playerid)
{
	TogglePlayerControllable(playerid, true);
	ClearAnimations(playerid);
	SetPVarInt(playerid, "Packed", 1);
	SetPVarInt(playerid, "Wood", random(30)+20);
	format(glstr, sizeof(glstr), "Нарубил дерева: {00FF00}%d кг",GetPVarInt(playerid, "Wood"));
	SendClientMessage(playerid, -1, glstr);
	SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
	SetPlayerAttachedObject(playerid, 2, 1463, 1, 0.184699, 0.426247, 0.000000, 259.531341, 80.949592, 0.000000, 0.456124, 0.468181, 0.470769);
    TogglePlayerDynamicCP(playerid, WooderCP[1], false);
    TogglePlayerDynamicCP(playerid, WooderCP[2], false);
    TogglePlayerDynamicCP(playerid, WooderCP[3], false);
    TogglePlayerDynamicCP(playerid, WooderCP[0], true);
}

forward GiveMetal(playerid, bool:ex);
public GiveMetal(playerid, bool:ex)
{
	TogglePlayerControllable(playerid, true);
	ClearAnimations(playerid);
	SetPVarInt(playerid, "Packed", 1);
	if(ex)
	{
		SetPVarInt(playerid, "Metal", random(30)+20);
		format(glstr, sizeof(glstr), "Добыл руды: {00FF00}%d кг",GetPVarInt(playerid, "Metal"));
	} else {
		SetPVarInt(playerid, "Metal", random(20)+10);
		format(glstr, sizeof(glstr), "Добыл руды: {00FF00}%d кг",GetPVarInt(playerid, "Metal"));
	}
	SendClientMessage(playerid, -1, glstr);
	SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
	SetPlayerAttachedObject(playerid, 2, 2936, 1, 0.184699, 0.426247, 0.000000, 259.531341, 80.949592, 0.000000, 0.476124, 0.468181, 0.470769);
    TogglePlayerDynamicCP(playerid, MinerCP[0], false);
    TogglePlayerDynamicCP(playerid, MinerCP[1], false);
    TogglePlayerDynamicCP(playerid, MinerCP[2], false);
    TogglePlayerDynamicCP(playerid, MinerCP[3], false);
    TogglePlayerDynamicCP(playerid, MinerCP[4], false);
    TogglePlayerDynamicCP(playerid, MinerCP[5], true);
}


forward ClearAnims(playerid);
public ClearAnims(playerid)
{
	ApplyAnimation(playerid,"CARRY","crry_prtial",4.0,0,0,0,0,0);
}

forward CopAttackDis(playerid);
public CopAttackDis(playerid)
{
	SetPVarInt(playerid, "CopAttacked", 0);
}

stock ShowStats(playerid, targetid, type)
{
	new title[64], body[1024];
	switch(type)
	{
		case 0:
		{
			format(title,sizeof(title),"{FFFFFF}Информация о %s [%d]", Name(playerid), playerid);
			format(glstr,sizeof(glstr),"{80FFFF}Номер аккаунта:\t\t\t{FFFFFF}%d", PI[playerid][ID]);
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Имя:\t\t\t\t\t{FFFFFF}%s", GetName(playerid, true));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Фамилия:\t\t\t\t{FFFFFF}%s", GetName(playerid, false));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Уровень:\t\t\t\t{FF0000}%d {FFFFFF}({00FF00}%d{FFFFFF} / {00FF00}%d{FFFFFF})", PI[playerid][Level], PI[playerid][Exp], NeedPlayerExp(playerid));
			strcat(body,glstr);
			if(PI[playerid][Passport] != 0)
			{
				format(glstr,sizeof(glstr),"\n{80FFFF}Дата рождения:\t\t\t{FFFFFF}%s", PI[playerid][bDay]);
				strcat(body,glstr);
			}
		}
		case 1:
		{
			format(title,sizeof(title),"{FFFFFF}Сбережения %s [%d]", Name(playerid), playerid);
			format(glstr,sizeof(glstr),"{80FFFF}Деньги на руках:\t{FFFF00}$%d", PI[playerid][Money]);
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Деньги в банке: \t{FFFF00}$%d", PI[playerid][Bank]);
			strcat(body,glstr);
		}
		case 2:
		{
			format(title,sizeof(title),"{FFFFFF}Дом %s [%d]", Name(playerid), playerid);
			if(PI[playerid][House] != 0)
			{
				strcat(body,"{80FFFF}Дом:\t\t");
				format(glstr,sizeof(glstr),"{FFFFFF}%d", PI[playerid][House]);
				strcat(body,glstr);
				if(PI[playerid][Renter] == 1) strcat(body," (Аренда)");
				format(glstr,sizeof(glstr),"\n{80FFFF}В сейфе:\t{FFFF00}$%d", HI[PI[playerid][House]][Bank]);
				strcat(body,glstr);
			} else {
				strcat(body,"{FFFFFF}Нет дома");
			}
			if(PIcar[playerid][CarID] != 0)
			{
				format(glstr,sizeof(glstr),"\n{80FFFF}Транспорт:\t{FFFFFF}%s", vName[PIcar[playerid][CarID]-400]);
				strcat(body,glstr);
			} else {
				strcat(body,"\n{FFFFFF}Нет личного транспорта");
			}
		}
		case 3:
		{
			format(title,sizeof(title),"{FFFFFF}Дополнительно о %s [%d]", Name(playerid), playerid);
			format(glstr,sizeof(glstr),"{80FFFF}Сытость:\t\t\t\t{FFFFFF}%d", PI[playerid][Eat]);
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Законопослушность:\t\t\t{FFFFFF}%d", PI[playerid][Law]);
			strcat(body,glstr);
			strcat(body,"\n{80FFFF}Пол:\t\t\t\t\t");
			if(PI[playerid][Sex] == 1)
			{
				strcat(body,"{00FFFF}Мужской");
			} else {
				strcat(body,"{FF8080}Женский");
			}
			strcat(body,"\n{80FFFF}Паспорт:\t\t\t\t");
			if(PI[playerid][Passport] == 1)
			{
				strcat(body,"{FFFFFF}Получен");
			} else {
				strcat(body,"{7C7C7C}Не имеется");
			}
			strcat(body,"\n{80FFFF}Водительское удостоверение:\t");
			if(PI[playerid][DriveLicence] == 1)
			{
				strcat(body,"{FFFFFF}Получено");
			} else {
				strcat(body,"{7C7C7C}Не имеется");
			}
			format(glstr,sizeof(glstr),"\n{80FFFF}Организация:\t\t\t\t{FFFFFF}%s", fName[PI[playerid][Faction]]);
			strcat(body,glstr);
			if(PI[playerid][Faction] != 0)
			{
				format(glstr,sizeof(glstr),", %s", GetRank(playerid));
				strcat(body,glstr);
			}
			if(PI[playerid][PhoneNumber] != 0)
			{
				format(glstr,sizeof(glstr),"\n\n{80FFFF}Номер телефона:\t\t\t{FFFFFF}%d", PI[playerid][PhoneNumber]);
				strcat(body,glstr);
				format(glstr,sizeof(glstr),"\n{80FFFF}Деньги на счету телефона:\t\t{FFFF00}$%d", PI[playerid][PhoneBalance]);
				strcat(body,glstr);
			}
		}
		case 4:
		{
			format(title,sizeof(title),"{FFFFFF}Наказания %s [%d]", Name(playerid), playerid);
			format(glstr,sizeof(glstr),"{80FFFF}Заглушен на:\t\t\t\t\t{00FF00}%s", MTF(PIpen[playerid][MuteTime]));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Закрыты меню и команды на:\t\t\t{00FF00}%s", MTF(PIpen[playerid][MuteCMD]));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Выйдет из тюрьмы через:\t\t\t{00FF00}%s", MTF(PIpen[playerid][JailTime]));
			strcat(body,glstr);
			strcat(body, "\n{80FFFF}Время при автоматической заглушке: \t\t");
			if(PIpen[playerid][MuteCount] >= 30)
			{
				strcat(body, "{FFFFFF}навсегда");
			}
			else if(PIpen[playerid][MuteCount] == 0)
			{
				strcat(body, "{FFFFFF}предупреждение");
			} else {
				format(glstr,sizeof(glstr),"{FFFFFF}%s", MTF(NextMuteTime(playerid)));
				strcat(body, glstr);
			}
		}
		case 5:
		{
			format(title,sizeof(title),"{FFFFFF}Статистика %s [%d]", Name(playerid), playerid);
			format(glstr,sizeof(glstr),"{80FFFF}Номер аккаунта:\t\t\t{FFFFFF}%d", PI[playerid][ID]);
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Имя:\t\t\t\t\t{FFFFFF}%s", GetName(playerid, true));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Фамилия:\t\t\t\t{FFFFFF}%s", GetName(playerid, false));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Уровень:\t\t\t\t{FF0000}%d {FFFFFF}({00FF00}%d{FFFFFF} / {00FF00}%d{FFFFFF})", PI[playerid][Level], PI[playerid][Exp], NeedPlayerExp(playerid));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}До следующего уровня:\t\t{FFFF00}%d мин.", 60-PI[playerid][GameTime]);
			strcat(body,glstr);
			if(PI[playerid][Passport] != 0)
			{
				format(glstr,sizeof(glstr),"\n{80FFFF}Дата рождения:\t\t\t{FFFFFF}%s", PI[playerid][bDay]);
				strcat(body,glstr);
			}
			format(glstr,sizeof(glstr),"\n\n{80FFFF}Деньги на руках:\t\t\t{FFFF00}$%d", PI[playerid][Money]);
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Деньги в банке: \t\t\t{FFFF00}$%d", PI[playerid][Bank]);
			strcat(body,glstr);
			if(PI[playerid][House] != 0)
			{
				strcat(body,"\n\n{80FFFF}Дом:\t\t\t\t\t");
				format(glstr,sizeof(glstr),"{FFFFFF}%d", PI[playerid][House]);
				strcat(body,glstr);
				if(PI[playerid][Renter] == 1) strcat(body," (Аренда)");
				format(glstr,sizeof(glstr),"\n{80FFFF}В сейфе:\t\t\t\t{FFFF00}$%d", HI[PI[playerid][House]][Bank]);
				strcat(body,glstr);
			} else {
				strcat(body,"\n\n{FFFFFF}Нет дома");
			}
			if(PIcar[playerid][CarID] != 0)
			{
				format(glstr,sizeof(glstr),"\n{80FFFF}Транспорт:\t\t\t\t{FFFFFF}%s", vName[PIcar[playerid][CarID]-400]);
				strcat(body,glstr);
			} else {
				strcat(body,"\n{FFFFFF}Нет личного транспорта");
			}
			format(glstr,sizeof(glstr),"\n\n{80FFFF}Сытость:\t\t\t\t{FFFFFF}%d", PI[playerid][Eat]);
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Законопослушность:\t\t\t{FFFFFF}%d", PI[playerid][Law]);
			strcat(body,glstr);
			strcat(body,"\n{80FFFF}Пол:\t\t\t\t\t");
			if(PI[playerid][Sex] == 1)
			{
				strcat(body,"{00FFFF}Мужской");
			} else {
				strcat(body,"{FF8080}Женский");
			}
			strcat(body,"\n{80FFFF}Паспорт:\t\t\t\t");
			if(PI[playerid][Passport] == 1)
			{
				strcat(body,"{FFFFFF}Получен");
			} else {
				strcat(body,"{7C7C7C}Не имеется");
			}
			strcat(body,"\n{80FFFF}Водительское удостоверение:\t");
			if(PI[playerid][DriveLicence] == 1)
			{
				strcat(body,"{FFFFFF}Получено");
			} else {
				strcat(body,"{7C7C7C}Не имеется");
			}
			format(glstr,sizeof(glstr),"\n{80FFFF}Организация:\t\t\t\t{FFFFFF}%s", fName[PI[playerid][Faction]]);
			strcat(body,glstr);
			if(PI[playerid][Faction] != 0)
			{
				format(glstr,sizeof(glstr),", %s", GetRank(playerid));
				strcat(body,glstr);
			}
			if(PI[playerid][PhoneNumber] != 0)
			{
				format(glstr,sizeof(glstr),"\n\n{80FFFF}Номер телефона:\t\t\t{FFFFFF}%d", PI[playerid][PhoneNumber]);
				strcat(body,glstr);
				format(glstr,sizeof(glstr),"\n{80FFFF}Деньги на счету телефона:\t\t{FFFF00}$%d", PI[playerid][PhoneBalance]);
				strcat(body,glstr);
			}
			format(glstr,sizeof(glstr),"\n\n{80FFFF}Заглушен на:\t\t\t\t\t{00FF00}%s", MTF(PIpen[playerid][MuteTime]));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Закрыты меню и команды на:\t\t\t{00FF00}%s", MTF(PIpen[playerid][MuteCMD]));
			strcat(body,glstr);
			format(glstr,sizeof(glstr),"\n{80FFFF}Выйдет из тюрьмы через:\t\t\t{00FF00}%s", MTF(PIpen[playerid][JailTime]));
			strcat(body,glstr);
			strcat(body, "\n{80FFFF}Время при автоматической заглушке: \t\t");
			if(PIpen[playerid][MuteCount] >= 30)
			{
				strcat(body, "{FFFFFF}навсегда");
			}
			else if(PIpen[playerid][MuteCount] == 0)
			{
				strcat(body, "{FFFFFF}предупреждение");
			} else {
				format(glstr,sizeof(glstr),"{FFFFFF}%s", MTF(NextMuteTime(playerid)));
				strcat(body, glstr);
			}
		}
	}
	ShowPlayerDialog(targetid, D_STATS_INFO, DIALOG_STYLE_MSGBOX, title, body, "Выход", "Назад");
}

stock ShowPlayerMenu(targetid, playerid)
{
	if(playerid == targetid) return OnPlayerCommandText(playerid, "/mn");
	format(glstr,sizeof(glstr), "{FFFFFF}%s [%d]", Name(targetid), targetid);
	if(PI[targetid][AFK] > 3) strcat(glstr, " {00FF00}Отошёл");
	if(PI[playerid][Admin] >= 10)
	{
		if(PI[playerid][Admin] >= 100) AddDListItem(playerid, "Админка", PMN_admin);
		AddDListItem(playerid, "Наблюдать", PMN_spec);
		AddDListItem(playerid, "{00FF00}Статистика", PMN_stats);
	}
	if(PI[playerid][Passport] != 0) AddDListItem(playerid, "Показать паспорт", PMN_passport);
	AddDListItem(playerid, "Дать денег", PMN_money);
	AddDListItem(playerid, "Передать игроку донат", DON_pay);
	AddDListItem(playerid, "{FFFF00}Пожаловаться на игрока", PMN_report);
	if(IsPlayerInAnyVehicle(playerid) && GetPlayerVehicleSeat(playerid) == 0) AddDListItem(playerid, "Выкинуть из машины", PMN_eject);
	if(PI[playerid][Faction] != 0) AddDListItem(playerid, "Фракция", PMN_frac);
	if(PI[playerid][Admin] >= 100) AddDListItem(playerid, "{FFFF00}Дополнительная статистика", PMN_statsex);
	ShowPlayerDList(playerid, P_MENU, glstr, "Выбрать", "Выход");
	return true;
}

stock ShowPassport(playerid, targetid)
{
	new body[512];
	SendClientMessage(targetid, -1, "");
	format(glstr,sizeof(glstr), "Имя: %s, Фамилия: %s", GetName(playerid, true), GetName(playerid, false));
	SendClientMessage(targetid, -1, glstr);
	format(glstr,sizeof(glstr), "Проживает в штате %d г.", PI[playerid][Level]);
	SendClientMessage(targetid, -1, glstr);
	format(glstr,sizeof(glstr), "Дата рождения: %s", PI[playerid][bDay]);
	SendClientMessage(targetid, -1, glstr);
	if(PI[playerid][Faction] != 0)
	{
		format(glstr,sizeof(glstr), "Организация: %s, Должность: %s", fName[PI[playerid][Faction]], GetRank(playerid));
		SendClientMessage(targetid, -1, glstr);
	}
	format(glstr,sizeof(glstr), "Место проживания: ");
	strcat(body, glstr);
	if(PI[playerid][House] != 0)
	{
		format(glstr,sizeof(glstr),"Дом №%d", PI[playerid][House]);
		strcat(body,glstr);
		if(PI[playerid][Renter] == 1) strcat(body," (Аренда)");
	} else {
	    strcat(body,"Нет");
	}
	SendClientMessage(targetid, -1, body);
	format(glstr,sizeof(glstr), "Уровень розыска: %d",PI[playerid][Wanted]);
	SendClientMessage(targetid, -1, glstr);
	SendClientMessage(targetid, -1, "");
	format(glstr,sizeof(glstr), "%s показал паспорт %s", Name(playerid), Name(targetid));
	Do(playerid, glstr);
}

stock Do(playerid, domsg[])
{
    for(new i;i<PLAYERS;i++)
	{
		if(!PlayerInRadius(playerid, i, 30.0)) continue;
		else if(GetPVarInt(playerid, "OutBrain") == 1) SendClientMessage(i, 0xDD90FFFF, "Где-то рядом лежит кто-то без сознания...");
		else SendClientMessage(i, 0xDD90FFFF, domsg);
	}
}

stock PlayerInRadius(playerid, targetid, Float:radius)
{
	new Float:OnePos[3], Float:TwoPos[3], Float:TmpPos[3];
	GetPlayerPos(playerid, OnePos[0], OnePos[1], OnePos[2]);
	if(!IsPlayerInRangeOfPoint(targetid, radius, OnePos[0], OnePos[1], OnePos[2]) || !IsPlayerConnected(targetid)) return false;
  	if(GetPlayerInterior(playerid) != GetPlayerInterior(targetid) || GetPlayerVirtualWorld(playerid) != GetPlayerVirtualWorld(targetid)) return false;
	GetPlayerPos(targetid, TwoPos[0], TwoPos[1], TwoPos[2]);
	TmpPos[0] = (TwoPos[0] - OnePos[0]);
	TmpPos[1] = (TwoPos[1] - OnePos[1]);
	TmpPos[2] = (TwoPos[2] - OnePos[2]);
	if(((TmpPos[0] < radius) && (TmpPos[0] > -radius)) && ((TmpPos[1] < radius) && (TmpPos[1] > -radius)) && ((TmpPos[2] < radius) && (TmpPos[2] > -radius))) return true;
   	return false;
}

stock VehicleInPlayer(vehicleid, playerid, Float:radius)
{
	new Float:OnePos[3], Float:TwoPos[3], Float:TmpPos[3];
	GetPlayerPos(playerid, OnePos[0], OnePos[1], OnePos[2]);
	GetVehiclePos(vehicleid, TwoPos[0], TwoPos[1], TwoPos[2]);
	if(!IsPlayerInRangeOfPoint(playerid, radius, TwoPos[0], TwoPos[1], TwoPos[2])) return false;
	TmpPos[0] = (TwoPos[0] - OnePos[0]);
	TmpPos[1] = (TwoPos[1] - OnePos[1]);
	TmpPos[2] = (TwoPos[2] - OnePos[2]);
	if(((TmpPos[0] < radius) && (TmpPos[0] > -radius)) && ((TmpPos[1] < radius) && (TmpPos[1] > -radius)) && ((TmpPos[2] < radius) && (TmpPos[2] > -radius))) return true;
   	return false;
}

stock AppAnim(playerid, s1[], s2[], Float:speed, p1,p2,p3,p4,p5)
{
	ApplyAnimationEx(playerid, s1, s2, speed,p1,p2,p3,p4,p5);
	SetTimerEx("ClearAnims", 8000, false, "d", playerid);
}

stock ReplaceID(text[])
{
    for(new i = strfind(text, "@", true), a = 0, tmp[4]; i != -1; i = strfind(text, "@", true, i))
	{
		++i, a = 0;
		while(48 <= text[i] <= 57 && a != 4) tmp[a++] = text[i++];
		if(tmp[0] == EOS) continue;
		if(!InGame(strval(tmp))) continue;
		strdel(text, i - a - 1, i);
		strins(text, Name(strval(tmp)), i - a - 1, 128);
	}
    for(new i = strfind(text, "\"", true), a = 0, tmp[4]; i != -1; i = strfind(text, "\"", true, i))
	{
		++i, a = 0;
		while(48 <= text[i] <= 57 && a != 4) tmp[a++] = text[i++];
		if(tmp[0] == EOS) continue;
		if(!InGame(strval(tmp))) continue;
		strdel(text, i - a - 1, i);
		strins(text, Name(strval(tmp)), i - a - 1, 128);
	}
	return true;
}

stock Say(playerid, msg[])
{
	new Float:OnePos[3], Float:radius=30.0;
	GetPlayerPos(playerid, OnePos[0], OnePos[1], OnePos[2]);
	SetPlayerChatBubble(playerid, msg, 0xFFFFFFFF, radius, 10000);
	if(!IsPlayerInAnyVehicle(playerid))
	{
 		if(GetPVarInt(playerid, "Calling") != 0) {}
		else if(GetPVarInt(playerid, "HandBlock") != 0) {}
		else if(GetPVarInt(playerid, "InHospital") != 0) {}
		else if(GetPVarInt(playerid, "CopAttacked") != 0) {}
		else if(GetPVarInt(playerid, "InSelfie") != 0) {}
		else if(PI[playerid][Health] < 5) {}
		else if(IsPlayerAttachedObjectSlotUsed(playerid,3)) {}
		else {
			AppAnim(playerid,"PED","IDLE_chat",4.1,0,1,1,1,1);
		}
	}
	for(new i;i<PLAYERS;i++)
 	{
	 	if(!PlayerInRadius(playerid, i, radius))
		{
			if(GetPVarInt(i, "ShowIC") == 0) continue;
		 	format(glstr,sizeof(glstr),"[IC] %s [%d]: %s",Name(playerid),playerid,msg);
		 	SendClientMessage(i, 0x417B1CFF, glstr);
			continue;
		}
		format(glstr,sizeof(glstr),"%s: %s",Name(playerid),msg);
		new Float:dist = GetPlayerDistanceFromPoint(i, OnePos[0], OnePos[1], OnePos[2]);
		if(dist < radius / 16) SendClientMessage(i, 0xFFFFFFFF, glstr);
		else if(dist < radius / 8) SendClientMessage(i, 0xCCCCCCFF, glstr);
		else if(dist < radius / 4) SendClientMessage(i, 0x999999FF, glstr);
		else if(dist < radius / 2) SendClientMessage(i, 0x666666FF, glstr);
		else if(dist < radius) SendClientMessage(i, 0x333333FF, glstr);
	}
	format(glstr,sizeof(glstr),"Сообщение в IC: %s", msg);
	AddPlayerEvent(playerid, glstr);
	chatlog(playerid, msg, 0);
}

stock SayOOC(playerid, msg[])
{
	new Float:OnePos[3], Float:radius = 30.0;
	GetPlayerPos(playerid, OnePos[0], OnePos[1], OnePos[2]);
	for(new i;i<PLAYERS;i++)
 	{
	 	if(!PlayerInRadius(playerid, i, radius))
	 	{
			if(GetPVarInt(i, "ShowOOC") == 0) continue;
		 	format(glstr,sizeof(glstr),"[OOC] %s [%d]: %s",Name(playerid),playerid,msg);
		 	SendClientMessage(i, 0x41707EFF, glstr);
			continue;
		}
		format(glstr,sizeof(glstr),"{AAFFFF}(( {FFFFFF}%s: %s {AAFFFF}))", Name(playerid), msg);
		SendClientMessage(i, 0xFFFFFFFF, glstr);
  	}
	format(glstr,sizeof(glstr),"Сообщение в OOC: %s", msg);
	AddPlayerEvent(playerid, glstr);
	chatlog(playerid, msg, 1);
}

stock GivePlayerLevel(playerid, count)
{
	if(count > 0)
	{
		for(new i;i<count;i++)
		{
		    PI[playerid][Level]++;
		    PI[playerid][Exp] = 0;
		    PI[playerid][GameTime] = 0;
		    if(count < 10) SendClientMessage(playerid, 0x00FF00FF, "Уровень повысился");
		}
	}
}

stock LawPlayer(playerid, amount, bool:v = false)
{
	if(v)
	{
		PI[playerid][Law] += amount;
		SendClientMessage(playerid, 0x00FF00FF, "Законопослушность увеличена");
	} else {
		PI[playerid][Law] -= amount;
		SendClientMessage(playerid, 0xFFFF00FF, "Законопослушность уменьшена");
	}
}

stock GivePlayerExp(playerid, count)
{
	if(count > 0)
	{
		for(new i;i<count;i++)
		{
		    PI[playerid][Exp]++;
		}
	 	PI[playerid][GameTime] = 0;
	 	if(PI[playerid][Exp] == NeedPlayerExp(playerid)) GivePlayerLevel(playerid, 1);
	}
}

stock NeedPlayerExp(playerid)
{
	new result = (PI[playerid][Level] + 1) * 4;
	return result;
}

stock SetPlayerLevel(playerid, newlvl)
{
	PI[playerid][Level] = newlvl;
	PI[playerid][Exp] = 0;
	PI[playerid][GameTime] = 0;
	SendClientMessage(playerid, 0x00FF00FF, "Тебе изменили уровень");
}

stock setPlayerName(playerid, newnick[])
{
	format(PI[playerid][Nick], 24, newnick);
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Nick` = '%e' WHERE `ID` = '%d'", newnick, PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
	SetPlayerName(playerid, newnick);
	if(PI[playerid][House] != 0) UpdateHouseInfo(PI[playerid][House]);
}

stock givePlayerDonate(playerid, Float:money)
{
	if(PI[playerid][Donate]+money < 0) 
	{
		money = 0.0;
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Donate` = '%f' WHERE `ID` = '%d'", money, PI[playerid][ID]);
		mysql_query(mysql1, query1, false);
		PI[playerid][Donate] = money;
	} else {
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Donate` = `Donate` + '%f' WHERE `ID` = '%d'", money, PI[playerid][ID]);
		mysql_query(mysql1, query1, false);
		PI[playerid][Donate] += money;
	}
}

stock setPlayerDonate(playerid, Float:money)
{
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Donate` = '%f' WHERE `ID` = '%d'", money, PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
	PI[playerid][Donate] = money;
}

stock SendAdminMessage(alvl, msg[], notid = PLAYERS)
{
	for(new i;i<PLAYERS;i++)
	{
	    if(!InGame(i) || notid == i) continue;
	    if(PI[i][Admin] >= alvl) SendClientMessage(i, -1, msg);
	}
}

stock GetNick(accountid)
{
	/*if(true == mode)
	{
		mysql_format(mysql1, query1, sizeof(query1), "SELECT `Nick` FROM `users` WHERE `ID` =  '%d'", accountid);
		mysql_tquery(mysql1, query1, "GetNick", "ddb", playerid, accountid, false);
	} else {
		new tmp[24];
		cache_get_value_name(0, "Nick", tmp);
		return tmp;
	}*/
	new tmp[24];
	format(tmp, sizeof(tmp), "none %d", accountid);
	return tmp;
}

forward RefreshDonate(playerid);
public RefreshDonate(playerid)
{
    cache_get_value_name_float(0, "Donate", PI[playerid][Donate]);
} 

stock ShowDonateSetNick(playerid, msg[])
{
	new body[256];
	strcat(body, msg);
	strcat(body, "\n\n");
	format(glstr, sizeof(glstr), "{FFFF00}На счету %.2f р.", PI[playerid][Donate]);
	strcat(body, glstr);
	format(glstr, sizeof(glstr), "\n{FFFF00}Стоимость: {00FF00}%.2f р.", NICK_COST);
	strcat(body, glstr);
	strcat(body, "\n\n{FFFFFF}Введи новое имя:");
	return ShowPlayerDialog(playerid, D_DONATE_NICK, DIALOG_STYLE_INPUT, "{FFFFFF}Донат - Имя", body, "Изменить", "Назад");
}

stock ShowDonateSetCash(playerid, msg[])
{
	new body[256];
	strcat(body, msg);
	strcat(body, "\n\n");
	format(glstr, sizeof(glstr), "{FFFF00}На счету %.2f р.", PI[playerid][Donate]);
	strcat(body, glstr);
	format(glstr, sizeof(glstr), "\n{FFFF00}Стоимость $%d: {00FF00}1.00 р.", CASH_COST);
	strcat(body, glstr);
	strcat(body, "\n\n{FFFFFF}Введи желаемую сумму:");
	return ShowPlayerDialog(playerid, D_DONATE_MONEY, DIALOG_STYLE_INPUT, "{FFFFFF}Донат - Игровая валюта", body, "Купить", "Назад");
}

stock InGameNick(nick[])
{
	for(new i;i<PLAYERS;i++)
	{
		if(!strcmp(Name(i), nick, false)) return true;
	}
	return false;
}

stock InGame(playerid)
{
	if(playerid >= PLAYERS) return false;
	else if(playerid < 0) return false;
	if(GetPVarInt(playerid, "Register") == 1) return false;
	if(IsPlayerConnected(playerid) && GetPVarInt(playerid, "Logged") == 1) return true;
	return false;
}

stock IsTaxiOnline()
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(PI[i][Job] != 1) continue;
		if(!GetPVarInt(i, "IsOnJob")) continue;
		return true;
	}
	return false;
}

stock IsCopsOnline()
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(PI[i][Faction] < 4 || PI[i][Faction] > 6) continue;
		if(PI[i][Rank] == 1) continue;
		return true;
	}
	return false;
}

stock IsHPOnline()
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(PI[i][Faction] < 1 || PI[i][Faction] > 3) continue;
		if(PI[i][Rank] == 1) continue;
		return true;
	}
	return false;
}

stock IsPDcar(playerid)
{
	if(!IsPlayerInAnyVehicle(playerid)) return false;
	new vehicleid = GetPlayerVehicleID(playerid);
	for(new i;i<sizeof(LSPDcars);i++)
	{
		if(vehicleid == LSPDcars[i]) return true;
	}
	for(new i;i<sizeof(SFPDcars);i++)
	{
		if(vehicleid == SFPDcars[i]) return true;
	}
	for(new i;i<sizeof(LVPDcars);i++)
	{
		if(vehicleid == LVPDcars[i]) return true;
	}
	return false;
}

stock IsHPcar(playerid)
{
	if(!IsPlayerInAnyVehicle(playerid)) return false;
	new vehicleid = GetPlayerVehicleID(playerid);
	for(new i;i<sizeof(LSHPcars);i++)
	{
		if(vehicleid == LSHPcars[i]) return true;
	}
	for(new i;i<sizeof(SFHPcars);i++)
	{
		if(vehicleid == SFHPcars[i]) return true;
	}
	for(new i;i<sizeof(LVHPcars);i++)
	{
		if(vehicleid == LVHPcars[i]) return true;
	}
	return false;
}

stock IsCNNcar(playerid)
{
	if(!IsPlayerInAnyVehicle(playerid)) return false;
	new vehicleid = GetPlayerVehicleID(playerid);
	for(new i;i<sizeof(LSNcars);i++)
	{
		if(vehicleid == LSNcars[i]) return true;
	}
	for(new i;i<sizeof(SFNcars);i++)
	{
		if(vehicleid == SFNcars[i]) return true;
	}
	for(new i;i<sizeof(LVNcars);i++)
	{
		if(vehicleid == LVNcars[i]) return true;
	}
	return false;
}

stock IsLICcar(playerid)
{
	if(!IsPlayerInAnyVehicle(playerid)) return false;
	new vehicleid = GetPlayerVehicleID(playerid);
	for(new i;i<sizeof(LicCars);i++)
	{
		if(vehicleid == LicCars[i]) return true;
	}
	return false;
}

stock IsBUScar(playerid)
{
	if(!IsPlayerInAnyVehicle(playerid)) return false;
	new vehicleid = GetPlayerVehicleID(playerid);
	for(new i;i<sizeof(Bus);i++)
	{
		if(vehicleid == Bus[i]) return true;
	}
	return false;
}

stock IsTAXIcar(playerid)
{
	if(!IsPlayerInAnyVehicle(playerid)) return false;
	new vehicleid = GetPlayerVehicleID(playerid);
	for(new i;i<sizeof(TaxiCars);i++)
	{
		if(vehicleid == TaxiCars[i]) return true;
	}
	return false;
}

stock IsVehicleInGame(vehicleid)
{
	new Float:hp;
	GetVehicleHealth(vehicleid, hp);
	if(hp > 0) return true;
	return false;
}

stock IsBike(vehicleid)
{
	new mid = GetVehicleModel(vehicleid);
	switch(mid)
	{
		case 481, 510, 509: return true;
	}
	return false;
}

stock IsInHospital(playerid)
{
	if(IsPlayerInRangeOfPoint(playerid, 50.0, 155.3842,-93.6987,845.2156)) return true;
	return false;
}

stock GetWeaponSlot(weaponid)
{
	new slot;
	switch(weaponid)
	{
		case 0,1: slot = 0;
		case 2 .. 9: slot = 1;
		case 10 .. 15: slot = 10;
		case 16 .. 18, 39: slot = 8;
		case 22 .. 24: slot = 2;
		case 25 .. 27: slot = 3;
		case 28, 29, 32: slot = 4;
		case 30, 31: slot = 5;
		case 33, 34: slot = 6;
		case 35 .. 38: slot = 7;
		case 40: slot = 12;
		case 41 .. 43: slot = 9;
		case 44 .. 46: slot = 11;
	}
	return slot;
}

stock resetPlayerWeapons(playerid)
{
	for(new i;i<12;i++)
	{
		PIwp[playerid][i] = 0;
	}
	ResetPlayerWeapons(playerid);
}

stock givePlayerWeapon(playerid, weaponid, ammo)
{
	new slot = GetWeaponSlot(weaponid);
	PIwp[playerid][slot] = weaponid;
	GivePlayerWeapon(playerid, weaponid, ammo);
}

stock updatePlayerMoney(playerid)
{
	ResetPlayerMoney(playerid);
	GivePlayerMoney(playerid, PI[playerid][Money]);
}

stock givePlayerMoney(playerid, amount)
{
    PI[playerid][Money] += amount;
	GivePlayerMoney(playerid, amount);
	updatePlayerMoney(playerid);
}

stock setPlayerMoney(playerid, amount)
{
    PI[playerid][Money] = amount;
	ResetPlayerMoney(playerid);
	GivePlayerMoney(playerid, PI[playerid][Money]);
}

stock removePlayerMoney(playerid, amount)
{
    PI[playerid][Money] -= amount;
	GivePlayerMoney(playerid, -amount);
	updatePlayerMoney(playerid);
}

stock MoveMoney(playerid, targetid, amount)
{
	removePlayerMoney(playerid, amount);
	givePlayerMoney(targetid, amount);
	updatePlayerMoney(playerid);
	updatePlayerMoney(targetid);
}

stock setPlayerHealth(playerid, Float:health)
{
	PI[playerid][Health] = health;
	SetPlayerHealth(playerid, PI[playerid][Health]);
	PI[playerid][HealthTime] = 2 + floatround(GetPlayerPing(playerid)/100);
}

stock setPlayerArmour(playerid, Float:armour)
{
	PI[playerid][Armor] = armour;
	SetPlayerArmour(playerid, PI[playerid][Armor]);
	PI[playerid][ArmorTime] = 2 + floatround(GetPlayerPing(playerid)/100);
}

stock InCheat(playerid, reason = 0)
{
	PIpen[playerid][Cheater] = 1;
	PIpen[playerid][CheaterCount]++;
	PI[playerid][CheatCount] = 0;
	if(reason != 0)
	{
		new tmp[24];
		switch(reason)
		{
			case 1: tmp = "Здоровье";
			case 2: tmp = "Броня";
			case 3: tmp = "Скорость";
		}
		format(glstr, sizeof(glstr), "Античит посадил %s [%d] в читерский мир (%s)", Name(playerid), PI[playerid][ID], tmp);
		alog(glstr, 0);
	}
	spawnPlayer(playerid);
}

stock OutCheat(playerid)
{
	PIpen[playerid][Cheater] = 0;
	spawnPlayer(playerid);
}

stock UpdatePhoneContacts(playerid)
{
	format(glstr, sizeof(glstr), "Телефон/%s [%d].ini", Name(playerid), PI[playerid][ID]);
	new iniFile = ini_openFile(glstr);
	format(glstr,sizeof(glstr),"C%d",GetPVarInt(playerid, "Contact")+1);
	ini_setInteger(iniFile, glstr, PhoneC[playerid][GetPVarInt(playerid, "Contact")]);
	format(glstr,sizeof(glstr),"CN%d",GetPVarInt(playerid, "Contact")+1);
	ini_setString(iniFile, glstr, PhoneN[playerid][GetPVarInt(playerid, "Contact")]);
	ini_closeFile(iniFile);
}

stock setPlayerSkill(playerid, skillid, skill)
{
	switch(skillid)
	{
		case 0:	PI[playerid][SkillPistol1] = skill, SetPlayerSkillLevel(playerid, 0, PI[playerid][SkillPistol1]);
		case 1:	PI[playerid][SkillPistol2] = skill, SetPlayerSkillLevel(playerid, 1, PI[playerid][SkillPistol2]);
		case 2:	PI[playerid][SkillPistol3] = skill, SetPlayerSkillLevel(playerid, 2, PI[playerid][SkillPistol3]);
		case 3:	PI[playerid][SkillShotgun1] = skill, SetPlayerSkillLevel(playerid, 3, PI[playerid][SkillShotgun1]);
		case 4:	PI[playerid][SkillShotgun2] = skill, SetPlayerSkillLevel(playerid, 4, PI[playerid][SkillShotgun2]);
		case 5:	PI[playerid][SkillShotgun3] = skill, SetPlayerSkillLevel(playerid, 5, PI[playerid][SkillShotgun3]);
		case 6:	PI[playerid][SkillUZI] = skill, SetPlayerSkillLevel(playerid, 6, PI[playerid][SkillUZI]);
		case 7:	PI[playerid][SkillMP5] = skill, SetPlayerSkillLevel(playerid, 7, PI[playerid][SkillMP5]);
		case 8:	PI[playerid][SkillAK47] = skill, SetPlayerSkillLevel(playerid, 8, PI[playerid][SkillAK47]);
		case 9:	PI[playerid][SkillM4] = skill, SetPlayerSkillLevel(playerid, 9, PI[playerid][SkillM4]);
		case 10:	PI[playerid][SkillSniper] = skill, SetPlayerSkillLevel(playerid, 10, PI[playerid][SkillSniper]);
	}
}

stock setPlayerWantedLevel(playerid, level)
{
	SetPlayerWantedLevel(playerid, level);
	PI[playerid][Wanted] = level;
}

stock SetPlayerSex(playerid, sex)
{
	PI[playerid][Sex] = sex;
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Sex` = '%d' WHERE `ID` = '%d'", sex, PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
}

stock SetPlayerPassport(playerid, passport)
{
	PI[playerid][Passport] = passport;
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Passport` = '%d' WHERE `ID` = '%d'", passport, PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
}

stock SetVehicleFuel(vehicleid, Float:fuel)
{
	Fuel[vehicleid] = fuel;
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || PIcar[i][CarGUID] != vehicleid) continue;
		PIcar[i][cFuel] = Fuel[vehicleid];
		break;
	}
}

stock colorStr(str[])
{
	new tmp1[256], tmp2[6];
	sscanf(str, "s[144]", tmp1);
	for(new i;i<strlen(tmp1);i++)
	{
		if(tmp1[i] == '(' && tmp1[i+7] == ')')
		{
		 	sscanf(tmp1[i], "s[6]", tmp2);
		 	LowerToUpper(tmp2);
		  	if(ValidHex(tmp2))
		   	{
				tmp1[i] = '{';
				tmp1[i+7] = '}';
			}
		}
 	}
    return tmp1;
}

stock replaceString(getStr[], const findstr[], const replacestr[])
{
    new start = strfind(getStr, findstr, true);
    do
    {
        new end = start + strlen(findstr);
        strdel(getStr, start, end);
        strins(getStr, replacestr, start, 256);
        start = strfind(getStr, findstr, true, start+strlen(replacestr));
    } while(start != -1);
    return getStr;
}

stock bool:strreplace(dest[], const string[], const replacestr[], bool:ignorecase = true, bool:ReplaceAll = true, maxlenght = sizeof(dest))
{
	new pos = strfind(dest, string, ignorecase);
	if(!strlen(dest) || !strlen(string) || pos == -1 || (!strcmp(string, replacestr, ignorecase) && strlen(replacestr))) return false;
	if(ReplaceAll) while(pos != -1)
	{
		strdel(dest, pos, pos + strlen(string));
		strins(dest, replacestr, pos, maxlenght);
		pos = strfind(dest, string, ignorecase);
	} else strdel(dest, pos, pos + strlen(string)), strins(dest, replacestr, pos, maxlenght);
	return true;
}

stock UpperToLower(text[])
{
    for(new i;i<strlen(text);i++)
    {
    	if(text[i] > 64 && text[i] < 91)
    	{
    		text[i] += 32;
    	}
    }
    return true;
}

stock LowerToUpper(text[])
{
	for(new i;i<strlen(text);i++)
	{
		text[i] = toupper(text[i]);
	}
}

new ns[][] = {"0","1","2","3","4","5","6","7","8","9","0","A","B","C","D","E","F"};
stock RandHex()
{
	new tmp[7];
	for(new i;i<7;i++) strcat(tmp, ns[random(16)]);
	return tmp;
}

stock CheckDialogColor(text[], first, end)
{
    if(text[first] != '{' || text[end] != '}') return false;
    for(new i = first; i <= end; i ++)
    {
        if(text[i] >= '0' && text[i] <= '9') continue;
        if(text[i] >= 'a' && text[i] <= 'f') continue;
        if(text[i] >= 'A' && text[i] <= 'F') continue;
        return false;
    }
    strdel(text, first, end + 1);
    return true;
}

stock ValidHex(str[])
{
	new simbols2[] = {'<', '>', '?', '@', '='};
	for(new i;i<strlen(str);i++)
	{
	    if(strlen(str) > 6) return false;
		if(str[0] < '2' && str[2] < '2' && str[4] < '2') return false;
		if(str[i] > 'F') return false;
		for(new j;j<5;j++)
		{
			if (str[i] == simbols2[j]) return false;
		}
	}
	return true;
}

stock NextMuteTime(playerid)
{
	new mc = PIpen[playerid][MuteCount], mtime;
	if(mc < 5) {mtime = mc*300;}
	else if(mc < 6) {mtime = mc*900;}
	else if(mc < 10) {mtime = mc*1200;}
	else if(mc < 24) {mtime = mc*3600;}
	else if(mc == 24) {mtime = 1*86400;}
	else if(mc == 25) {mtime = 2*86400;}
	else if(mc == 26) {mtime = 3*86400;}
	else if(mc == 27) {mtime = 4*86400;}
	else if(mc == 28) {mtime = 5*86400;}
	else if(mc == 29) {mtime = 6*86400;}
	else {mtime = 1728000000;}
	return mtime;
}

stock DestroyPlayerCar(playerid)
{
	DestroyVehicle(PIcar[playerid][CarGUID]);
	CarLocked[PIcar[playerid][CarGUID]] = false;
	VehOfPlayer[PIcar[playerid][CarGUID]] = false;
	Fuel[PIcar[playerid][CarGUID]] = 100;
	Engine[PIcar[playerid][CarGUID]] = false;
	PIcar[playerid][CarGUID] = INVALID_VEHICLE_ID;
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || PI[i][LastCar] != PIcar[playerid][CarGUID]) continue;
		PI[i][LastCar] = INVALID_VEHICLE_ID;
	}
}

stock SpawnPlayerCar(playerid)
{
	PIcar[playerid][CarGUID] = CreateVehicle(PIcar[playerid][CarID],HI[PI[playerid][House]][VehX],HI[PI[playerid][House]][VehY],HI[PI[playerid][House]][VehZ],HI[PI[playerid][House]][VehA],PIcar[playerid][Color1], PIcar[playerid][Color2], 0);
	SetVehicleToRespawn(PIcar[playerid][CarGUID]);
	LinkVehicleToInterior(PIcar[playerid][CarGUID], 0);
	SetVehicleVirtualWorld(PIcar[playerid][CarGUID], 0);
	SetVehicleNumberPlate(PIcar[playerid][CarGUID], PIcar[playerid][NumberPlate]);
	ChangeVehiclePaintjob(PIcar[playerid][CarGUID], PIcar[playerid][PaintJob]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot0]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot1]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot2]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot3]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot4]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot5]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot6]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot7]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot8]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot9]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot10]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot11]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot12]);
	AddVehicleComponent(PIcar[playerid][CarGUID], PIcar[playerid][VehSlot13]);
	format(glstr,sizeof(glstr),"Владелец: %s {FFFF00}[Закрыто]", Name(playerid));
	CarLocked[PIcar[playerid][CarGUID]] = true;
	VehOfPlayer[PIcar[playerid][CarGUID]] = true;
	Fuel[PIcar[playerid][CarGUID]] = PIcar[playerid][cFuel];
	Engine[PIcar[playerid][CarGUID]] = false;
}

stock UpdateHouseInfo(houseid)
{
	new tmp[48], info[256];
	if(strcmp(HI[houseid][Label], "NULL", false))
	{
		format(tmp, sizeof(tmp), "%s\n", HI[houseid][Label]);
		strcat(info, tmp);
	}
	//format(tmp, sizeof(tmp), "{80FF80}Класс: {FFFF00}%d", HI[houseid][Level]);
	//strcat(info, tmp);
	if(HI[houseid][Owner] == 0)
	{
		format(tmp, sizeof(tmp), "\n{80FF80}Цена: ${FFFF00}%d", HI[houseid][Cost]);
		strcat(info, tmp);
	} else {
		//new n1[12], n2[12];
		//sscanf(GetNick(HI[houseid][Owner]), "p<_>s[12]s[12]", n1, n2);
		//format(tmp, sizeof(tmp), "\n{80FF80}Владелец: {FFFF00}%s %s", n1, n2);
		//strcat(info, tmp);
		if(HI[houseid][CostRent] > 0)
		{
			format(tmp, sizeof(tmp), "\n{80FF80}Стоимость аренды: ${FFFF00}%d", HI[houseid][CostRent]);
			strcat(info, tmp);
		}
	}
	format(tmp, sizeof(tmp), "\n{80FF80}Дом №: {FFFF00}%d", houseid);
	strcat(info, tmp);
	if(HI[houseid][CostSell] > 0)
	{
		format(tmp, sizeof(tmp), "\n{80FF80}Продаётся за: ${00FFFF}%d", HI[houseid][CostSell]);
		strcat(info, tmp);
	}
	UpdateDynamic3DTextLabelText(HI[houseid][InfoID], -1, info);
}

stock SetHouseName(houseid, name[])
{
	format(HI[houseid][Label], 64, "%s", colorStr(name));
	UpdateHouseInfo(houseid);
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `Label` = '%e' WHERE `ID` = '%d'", HI[houseid][Label], houseid);
	mysql_query(mysql1, query1, false);
}

stock SetHouseToSell(houseid, cost)
{
	HI[houseid][CostSell] = cost;
	UpdateHouseInfo(houseid);
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `CostSell` = '%d' WHERE `ID` = '%d'", HI[houseid][CostSell], houseid);
	mysql_query(mysql1, query1, false);
}

stock SellToBuyHouse(hid, buyer)
{
	new seller, opt;
	removePlayerMoney(buyer, HI[hid][CostSell]);
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(hid == PI[i][House]) opt = 1, seller = i;
	}
	if(opt == 1)
	{
		SendClientMessage(seller, 0x00FF00FF, "У тебя купили дом");
		givePlayerMoney(seller, HI[PI[seller][House]][CostSell]);
		SetHouseOwner(PI[seller][House], 0);
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(PI[i][Renter] != 0 && PI[i][House] == PI[seller][House])
			{
				PI[i][House] = 0;
				PI[i][Renter] = 0;
				SendClientMessage(i, 0xFF0000FF, "Владелец продал свой дом и тебя выселили");
				mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Renter` = '0', `House` = '0' WHERE `ID` = '%d'", PI[i][ID]);
				mysql_query(mysql1, query1, false);
			}
		}
		PI[seller][House] = 0;
		DestroyPlayerCar(seller);
	} else {
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Money` = `Money` - '%d' WHERE `ID` = '%d'", HI[hid][Cost], HI[hid][Owner]);
		mysql_query(mysql1, query1, false);
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Money` = `Money` + '%d' WHERE `ID` = '%d'", HI[hid][CostSell], HI[hid][Owner]);
		mysql_query(mysql1, query1, false);
		SetHouseOwner(hid, 0);
	}
    PI[buyer][House] = hid;
	PI[buyer][Renter] = 0;
    SetHouseOwner(hid, PI[buyer][ID]);
    SpawnPlayerCar(buyer);
}

stock SellHouse(playerid)
{
	givePlayerMoney(playerid, HI[PI[playerid][House]][Cost]);
    SetHouseOwner(PI[playerid][House], 0);
	for(new i;i<PLAYERS;i++)
	{
	    if(!InGame(i)) continue;
		if(PI[i][Renter] != 0 && PI[i][House] == PI[playerid][House])
		{
			PI[i][House] = 0;
			PI[i][Renter] = 0;
			SendClientMessage(i, 0xFF0000FF, "Владелец продал свой дом и тебя выселили");
			mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Renter` = '0', `House` = '0' WHERE `ID` = '%d'", PI[i][ID]);
			mysql_query(mysql1, query1, false);
		}
	}
    PI[playerid][House] = 0;
    DestroyPlayerCar(playerid);
}

stock BuyHouse(playerid, houseid)
{
    removePlayerMoney(playerid, HI[houseid][Cost]);
    PI[playerid][House] = houseid;
	PI[playerid][Renter] = 0;
    SetHouseOwner(houseid, PI[playerid][ID]);
    SpawnPlayerCar(playerid);
}

stock RentHouse(playerid, houseid)
{
	if(houseid == 0)
	{
	    PI[playerid][House] = 0;
		PI[playerid][Renter] = 0;
	} else {
	    removePlayerMoney(playerid, HI[houseid][CostRent]);
		HI[houseid][Bank] += HI[houseid][CostRent];
		SetHouseMoney(houseid, HI[houseid][Bank]);
	    PI[playerid][House] = houseid;
		PI[playerid][Renter] = 1;
    }
}

stock SetHouseMoney(houseid, amount)
{
		HI[houseid][Bank] = amount;
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `Bank` = '%d' WHERE `ID` = '%d'", HI[houseid][Bank], houseid);
		mysql_query(mysql1, query1, false);
}

stock SetHouseOwner(houseid, ownerid)
{
	if(ownerid == 0)
	{
  		DestroyDynamicPickup(HI[houseid][PickID]);
  		HI[houseid][PickID] = CreateDynamicPickup(1273, 23, HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], HI[houseid][World], HI[houseid][WorldInterior], -1, 100.0);
  		DestroyDynamicMapIcon(HI[houseid][IconID]);
  		HI[houseid][IconID] = CreateDynamicMapIcon(HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], 31, -1, HI[houseid][World], HI[houseid][WorldInterior], -1, 300.0);
		DestroyDynamicPickup(HI[houseid][LockID]);
		HI[houseid][Locked] = false;
		SetHouseName(houseid, "NULL");
		SetHouseToSell(houseid, 0);
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Renter` = '0', `House` = '0' WHERE `ID` = '%d'", HI[houseid][Owner]);
		mysql_query(mysql1, query1, false);
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Money` = `Money` + '%d' WHERE `ID` = '%d'", HI[houseid][Cost], HI[houseid][Owner]);
		mysql_query(mysql1, query1, false);
  		HI[houseid][Owner] = 0;
	} else {
	    DestroyDynamicPickup(HI[houseid][PickID]);
  		HI[houseid][PickID] = CreateDynamicPickup(1272, 23, HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], HI[houseid][World], HI[houseid][WorldInterior], -1, 100.0);
  		DestroyDynamicMapIcon(HI[houseid][IconID]);
  		//HI[houseid][IconID] = CreateDynamicMapIcon(HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], 32, -1, HI[houseid][World], HI[houseid][WorldInterior], -1, 3000.0);
  		HI[houseid][Owner] = ownerid;
		HI[houseid][Locked] = true;
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `House` = '%d' WHERE `ID` = '%d'", houseid, ownerid);
		mysql_query(mysql1, query1, false);
	}
	UpdateHouseInfo(houseid);
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `Owner` = '%d' WHERE `ID` = '%d'", HI[houseid][Owner], HI[houseid][ID]);
	mysql_query(mysql1, query1, false);
}

stock SetHouseCost(houseid, newcost)
{
	HI[houseid][Cost] = newcost;
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `Cost` = '%d' WHERE `ID` = '%d'", HI[houseid][Cost], houseid);
	mysql_query(mysql1, query1, false);
	UpdateHouseInfo(houseid);
}

stock SetHouseInterior(houseid, newinteriorid)
{
	HI[houseid][Interior] = newinteriorid;
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `Interior` = '%d' WHERE `ID` = '%d'", HI[houseid][Interior], houseid);
	mysql_query(mysql1, query1, false);
}

stock SetHouseLevel(houseid, newlevel)
{
	HI[houseid][Level] = newlevel;
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `Level` = '%d' WHERE `ID` = '%d'", HI[houseid][Level], houseid);
	mysql_query(mysql1, query1, false);
	UpdateHouseInfo(houseid);
}

stock SetHousePos(houseid, Float:hX, Float:hY, Float:hZ, Float:hA, world, worldinterior)
{
	HI[houseid][StreetX] = hX;
	HI[houseid][StreetY] = hY;
	HI[houseid][StreetZ] = hZ;
	HI[houseid][StreetA] = hA;
	HI[houseid][World] = world;
	HI[houseid][WorldInterior] = worldinterior;
	DestroyDynamicPickup(HI[houseid][PickID]);
	HI[houseid][PickID] = CreateDynamicPickup(1273, 23, hX, hY, hZ, HI[houseid][World], HI[houseid][WorldInterior], -1, 100.0);
	DestroyDynamicMapIcon(HI[houseid][IconID]);
	HI[houseid][IconID] = CreateDynamicMapIcon(hX, hY, hZ, 31, -1, HI[houseid][World], HI[houseid][WorldInterior], -1, 300.0);
	if(HI[houseid][Owner] == 0)
	{
		HI[houseid][PickID] = CreateDynamicPickup(1273, 23, HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], HI[houseid][World], HI[houseid][WorldInterior], -1, 100.0);
		HI[houseid][IconID] = CreateDynamicMapIcon(HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], 31, -1, HI[houseid][World], HI[houseid][WorldInterior], -1, 300.0);
	} else {
	    HI[houseid][PickID] = CreateDynamicPickup(1272, 23, HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], HI[houseid][World], HI[houseid][WorldInterior], -1, 100.0);
	}
	DestroyDynamic3DTextLabel(HI[houseid][InfoID]);
	HI[houseid][InfoID] = CreateDynamic3DTextLabel("Это дом", -1, HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], 20.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 1, HI[houseid][World], HI[houseid][WorldInterior], -1, 30.0);
	UpdateHouseInfo(houseid);
	mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `StreetX` = '%f',`StreetY` = '%f',`StreetZ` = '%f',`StreetA` = '%f',`World` = '%d',`WorldInterior` = '%d' WHERE `ID` = '%d'", HI[houseid][StreetX], HI[houseid][StreetY], HI[houseid][StreetZ], HI[houseid][StreetA], HI[houseid][World], HI[houseid][WorldInterior], houseid);
	mysql_query(mysql1, query1, false);
}

stock CreateHouse(Float:hX, Float:hY, Float:hZ, Float:hA, interior, cost, level, world, worldinterior)
{
	mysql_format(mysql1, query1, sizeof(query1), "INSERT INTO `houses` (`StreetX`,`StreetY`,`StreetZ`,`StreetA`,`Level`,`Cost`,`Interior`,`World`,`WorldInterior`) VALUES ('%f','%f','%f','%f','%d','%d','%d','%d','%d')", hX, hY, hZ, hA, level, cost, interior, world, worldinterior);
 	mysql_query(mysql1, query1, false);
 	housecount++;
 	HI[housecount][ID] = housecount,
	HI[housecount][StreetX] = hX;
	HI[housecount][StreetY] = hY;
	HI[housecount][StreetZ] = hZ;
	HI[housecount][StreetA] = hA;
	HI[housecount][Interior] = interior;
	HI[housecount][Level] = level;
	HI[housecount][Cost] = cost;
	HI[housecount][World] = world;
	HI[housecount][WorldInterior] = worldinterior;
 	HI[housecount][PickID] = CreateDynamicPickup(1273, 23, HI[housecount][StreetX], HI[housecount][StreetY], HI[housecount][StreetZ], HI[housecount][World], HI[housecount][WorldInterior], -1, 100.0);
	HI[housecount][IconID] = CreateDynamicMapIcon(HI[housecount][StreetX], HI[housecount][StreetY], HI[housecount][StreetZ], 31, -1, HI[housecount][World], HI[housecount][WorldInterior], -1, 300.0);
	HI[housecount][InfoID] = CreateDynamic3DTextLabel("Это дом", -1, HI[housecount][StreetX], HI[housecount][StreetY], HI[housecount][StreetZ], 20.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 1, HI[housecount][World], HI[housecount][WorldInterior], -1, 30.0);
	UpdateHouseInfo(housecount);
}

stock generateCost(level)
{
	new q,rand[7],Float:frand;
	format(rand, sizeof(rand), "0.%d%d%d%d%d",random(8)+1,random(8)+1,random(8)+1,random(8)+1,random(8)+1);
	frand = floatstr(rand);
	switch(level)
	{
		case 1: q = 100;
		case 2: q = 300;
		case 3,4: q = 600;
		case 5,6: q = 1100;
		case 7: q = 1500;
	}
	return level*((q+floatround(frand*100))*100);
}

stock OnHouseEnter(playerid)
{
	new hid = 0;
	for(new i;i<=housecount;i++)
	{
		if(!IsPlayerInRangeOfPoint(playerid, 1.0, HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ])) continue;
		hid = i;
		break;
	}
	return hid;
}

forward LoadHouses();
public LoadHouses()
{
	new _rowsCount, _timeBeforeLoad = GetTickCount();
	if(cache_get_row_count(_rowsCount))
	{
		housecount = _rowsCount;
		for(new i = 1; i < _rowsCount; i++)
		{
			cache_get_value_name(i-1, "Label", HI[i][Label], 64);
			cache_get_value_name_int(i-1, "ID", HI[i][ID]);
			cache_get_value_name_float(i-1, "StreetX", HI[i][StreetX]);
			cache_get_value_name_float(i-1, "StreetY", HI[i][StreetY]);
			cache_get_value_name_float(i-1, "StreetZ", HI[i][StreetZ]);
			cache_get_value_name_float(i-1, "StreetA", HI[i][StreetA]);
			cache_get_value_name_float(i-1, "VehX", HI[i][VehX]);
			cache_get_value_name_float(i-1, "VehY", HI[i][VehY]);
			cache_get_value_name_float(i-1, "VehZ", HI[i][VehZ]);
			cache_get_value_name_float(i-1, "VehA", HI[i][VehA]);
			cache_get_value_name_int(i-1, "Interior", HI[i][Interior]);
			cache_get_value_name_int(i-1, "Owner", HI[i][Owner]);
			cache_get_value_name_int(i-1, "Level", HI[i][Level]);
			cache_get_value_name_int(i-1, "Cost", HI[i][Cost]);
			cache_get_value_name_int(i-1, "CostRent", HI[i][CostRent]);
			cache_get_value_name_int(i-1, "Bank", HI[i][Bank]);
			cache_get_value_name_int(i-1, "CostSell", HI[i][CostSell]);
			cache_get_value_name_int(i-1, "World", HI[i][World]);
			cache_get_value_name_int(i-1, "WorldInterior", HI[i][WorldInterior]);
			HI[i][InfoID] = CreateDynamic3DTextLabel("Это дом", -1, HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ], 20.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 1, HI[i][World], HI[i][WorldInterior], -1, 30.0);
			CreateDynamic3DTextLabel("Нажми N, чтобы открыть меню дома", 0x00FF00DD, HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ]+0.4, 5.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 1, HI[i][World], HI[i][WorldInterior], -1, 6.0);
			if(HI[i][Owner] == 0)
			{
				HI[i][PickID] = CreateDynamicPickup(1273, 23, HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ], HI[i][World], HI[i][WorldInterior], -1, 100.0);
				HI[i][IconID] = CreateDynamicMapIcon(HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ], 31, -1, HI[i][World], HI[i][WorldInterior], -1, 100.0);
			} else {
				HI[i][PickID] = CreateDynamicPickup(1272, 23, HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ], HI[i][World], HI[i][WorldInterior], -1, 100.0);
				HI[i][Locked] = true;
				//HI[i][IconID] = CreateDynamicMapIcon(HI[i][StreetX], HI[i][StreetY], HI[i][StreetZ], 32, -1, HI[i][World], HI[i][WorldInterior], -1, 300.0);
			}
			UpdateHouseInfo(i);
		}
		printf("Загружено домов: %d (%d мс)", _rowsCount, GetTickCount() - _timeBeforeLoad);
	}
	return true;
}

stock LoadNews()
{
	mysql_tquery(mysql1, "SELECT * FROM `news` WHERE `Type` = '0' ORDER BY ID DESC LIMIT 1", "LoadingNews", "");
}

forward LoadingNews();
public LoadingNews()
{
	new _rowsCount;
	cache_get_row_count(_rowsCount);
	if(_rowsCount)
	{
		cache_get_value_name(0, "Date", NI[Date], 11);
		cache_get_value_name(0, "Version", NI[Version], 7);
		cache_get_value_name(0, "Added", NI[Added], 512);
		cache_get_value_name(0, "Fixed", NI[Fixed], 1536);
		cache_get_value_name(0, "Admins", NI[Admins], 512);
		cache_get_value_name(0, "Helpers", NI[Helpers], 512);
		cache_get_value_name_int(0, "Type", NI[Type]);
		strreplace(NI[Added], "<br>", "\n", false, true, sizeof(NI[Added]));
		strreplace(NI[Fixed], "<br>", "\n", false, true, sizeof(NI[Fixed]));
		strreplace(NI[Admins], "<br>", "\n", false, true, sizeof(NI[Admins]));
		strreplace(NI[Helpers], "<br>", "\n", false, true, sizeof(NI[Helpers]));
		printf("Версия мода %s (от %s)", NI[Version], NI[Date]);
		return true;
	}
	return print("Ошибка загрузки новостей");
}

stock ShowNews(playerid)
{
	new body[1024];
	format(body,sizeof(body), "\
	{FFFF00}Версия %s\n\
	{55AAFF}Дата обновления: {FFFFFF}%s\n\
	\n\
	{00FF00}Добавлено:\n\
	{FFFFFF}%s\
	\n\n\
	{00FF00}Исправлено:\n\
	{FFFFFF}%s\
	",
	NI[Version],NI[Date],NI[Added],NI[Fixed]);
	if(PI[playerid][Admin] > 0 && PI[playerid][Admin] < 100 && strcmp(NI[Helpers], "NULL", true))
	{
		format(glstr,sizeof(glstr),"\n\n{00FF00}Обновления для хелперов:\n{FFFFFF}%s",NI[Helpers]);
		strcat(body, glstr);
	}
	if(PI[playerid][Admin] >= 100 && strcmp(NI[Admins], "NULL", true))
	{
		format(glstr,sizeof(glstr),"\n\n{00FF00}Обновления для админов:\n{FFFFFF}%s",NI[Admins]);
		strcat(body, glstr);
	}
	if(PI[playerid][ReadNews] > 0) 
	{
		format(glstr,sizeof(glstr),"{FFFF00}Новости, жди {FFFFFF}%d {FFFF00}сек.",PI[playerid][ReadNews]);
	} else {
		mysql_format(mysql1, query1, sizeof(glstr), "UPDATE `users` SET `ReadNews` = '0' WHERE `ID` = '%d'", PI[playerid][ID]);
		mysql_query(mysql1, query1, false);
		format(glstr,sizeof(glstr),"{FFFF00}Новости");
	}
	ShowPlayerDialog(playerid, D_NEWS, DIALOG_STYLE_MSGBOX, glstr, body, "Выход", "Назад");
	return true;
}

forward LoadRecord();
public LoadRecord()
{
	new _rowsCount;
	cache_get_row_count(_rowsCount);
	if(_rowsCount)
	{
		cache_get_value_name(0, "Date", R[Date], 10);
		cache_get_value_name(0, "Time", R[Time], 10);
		cache_get_value_name_int(0, "Players", R[Players]);
		if(R[Players] > 0) printf("Рекорд игроков: %d, был установлен %s в %s", R[Players], R[Date], R[Time]);
		return true;
	}
	return print("Ошибка загрузки рекорда");
}

new gRandomWeatherIDs[] = {0,1,2,3,4,5,6,7,8,9,19,20,40};
//new gRandomWeatherNames[][32] = {"Ясно, без осадков", "Жарко, без осадков", "Сильная гроза", "Пасмурно, туман", "Песчаная буря", "Тепло и сухо" };
stock UpdateWeather()
{
	new rand = random(sizeof(gRandomWeatherIDs));
    SetWeather(gRandomWeatherIDs[rand]);
	NowWeather = gRandomWeatherIDs[rand];
	/*
	format(glstr,sizeof(glstr),"Новости погоды: %s",gRandomWeatherNames[rand]);
	SendClientMessageToAll(-1, glstr);
	*/
}

stock ToggleBonnet(vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, boot, objective);
	if(!Bonnet[vehicleid])
	{
		Bonnet[vehicleid] = true;
	} else {
		Bonnet[vehicleid] = false;
	}
	SetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, Bonnet[vehicleid], boot, objective);
}

stock ToggleBoot(vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, boot, objective);
	if(!Boot[vehicleid])
	{
		Boot[vehicleid] = true;
	} else {
		Boot[vehicleid] = false;
	}
	SetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, Boot[vehicleid], objective);
}

stock ToggleAlarm(vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, boot, objective);
	if(!Alarm[vehicleid])
	{
		Alarm[vehicleid] = true;
	} else {
		Alarm[vehicleid] = false;
	}
	SetVehicleParamsEx(vehicleid, engine, lights, Alarm[vehicleid], doors, bonnet, boot, objective);
}

stock ToggleLights(vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, boot, objective);
	if(!Lights[vehicleid])
	{
		Lights[vehicleid] = true;
	} else {
		Lights[vehicleid] = false;
	}
	SetVehicleParamsEx(vehicleid, engine, Lights[vehicleid], alarm, doors, bonnet, boot, objective);
}

stock ToggleEngine(vehicleid)
{
	GetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, boot, objective);
	if(!Engine[vehicleid])
	{
		Engine[vehicleid] = true;
	} else {
		Engine[vehicleid] = false;
	}
	SetVehicleParamsEx(vehicleid, Engine[vehicleid], lights, alarm, doors, bonnet, boot, objective);
}

stock ToggleCarLock(playerid)
{
	new vehicleid;
	if(GetPlayerVehicleSeat(playerid) != 0)
	{
		if(PI[playerid][LastCar] == INVALID_VEHICLE_ID) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен сидеть за рулём");
		vehicleid = PI[playerid][LastCar];
	} else {
		vehicleid = GetPlayerVehicleID(playerid);
	}
	GetVehicleParamsEx(vehicleid, engine, lights, alarm, doors, bonnet, boot, objective);
	if(CarLocked[vehicleid] == false)
	{
		CarLocked[vehicleid] = true;
		GameTextForPlayer(playerid, "Авто ~r~закрыто", 2000, 5);
	} else {
		CarLocked[vehicleid] = false;
		GameTextForPlayer(playerid, "Авто ~g~открыто", 2000, 5);
	}
	SetVehicleParamsEx(vehicleid, engine, lights, alarm, CarLocked[vehicleid], bonnet, boot, objective);
	return true;
}

stock GetVehicleSpeed(vehicleid)
{
	new Float:vel[3], speed;
	GetVehicleVelocity(vehicleid,vel[0],vel[1],vel[2]);
	speed = floatround(floatsqroot(vel[0]*vel[0]+vel[1]*vel[1]+vel[2]*vel[2])*199.2);
	return speed;
}

stock GetSpeed(playerid)
{
	new Float:STt[4];
	if(IsPlayerInAnyVehicle(playerid))
	GetVehicleVelocity(GetPlayerVehicleID(playerid),STt[0],STt[1],STt[2]);
	else GetPlayerVelocity(playerid,STt[0],STt[1],STt[2]);
	STt[3] = floatsqroot(floatpower(floatabs(STt[0]), 2.0) + floatpower(floatabs(STt[1]), 2.0) + floatpower(floatabs(STt[2]), 2.0)) * 100.3;
	return floatround(STt[3]);
}

stock OnRoof(playerid)
{
	new vid = GetPlayerSurfingVehicleID(playerid), mid = GetVehicleModel(vid);
	switch(mid)
	{
		case 430,446,452,453,454,472,473,484,493,595: return false;
	}
	if(GetVehicleSpeed(vid) > 30.0) return true;
	return false;
}

stock GetMiniMapCoord(Float:x,Float:y,&Float:nx,&Float:ny,&Float:nz)
{
    nx = x/2000;
    ny = y/2000;
    ny += POS_Y;
    nx +=POS_X;
    nz = POS_Z;
}

stock GetPlayerZone(playerid, &zone)
{
	new Float:zpos[3];
	GetPlayerPos(playerid, zpos[0], zpos[1], zpos[2]);
	if(zpos[0] >= HospitalZone[0][0] && zpos[1] <= HospitalZone[0][1]) zone = 1;
	else if(zpos[0] >= HospitalZone[1][0] && zpos[1] >= HospitalZone[1][1]) zone = 3;
	else zone = 2;
}

stock Restart()
{
	SendClientMessageToAll(COLOR_SUCCESS, "Сервер был перезагружен, это займет несколько секунд, оставайся в игре...");
	saveall();
	for (new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		SetPVarInt(i, "Logged", 0);
		ClearAccount(i);
		if(noclipdata[i][cameramode] == CAMERA_MODE_FLY) CancelFlyMode(i);
	}
	SendRconCommand("gmx");
}

stock GetMoveDirectionFromKeys(ud, lr)
{
	new direction = 0;
	
    if(lr < 0)
	{
		if(ud < 0) 		direction = MOVE_FORWARD_LEFT; 	// Up & Left key pressed
		else if(ud > 0) direction = MOVE_BACK_LEFT; 	// Back & Left key pressed
		else            direction = MOVE_LEFT;          // Left key pressed
	}
	else if(lr > 0) 	// Right pressed
	{
		if(ud < 0)      direction = MOVE_FORWARD_RIGHT;  // Up & Right key pressed
		else if(ud > 0) direction = MOVE_BACK_RIGHT;     // Back & Right key pressed
		else			direction = MOVE_RIGHT;          // Right key pressed
	}
	else if(ud < 0) 	direction = MOVE_FORWARD; 	// Up key pressed
	else if(ud > 0) 	direction = MOVE_BACK;		// Down key pressed
	
	return direction;
}

//--------------------------------------------------

stock MoveCamera(playerid)
{
	new Float:FV_tmp[3], Float:CP_tmp[3];
	GetPlayerCameraPos(playerid, CP_tmp[0], CP_tmp[1], CP_tmp[2]);          // 	Cameras position in space
    GetPlayerCameraFrontVector(playerid, FV_tmp[0], FV_tmp[1], FV_tmp[2]);  //  Where the camera is looking at

	// Increases the acceleration multiplier the longer the key is held
	if(noclipdata[playerid][accelmul] <= 1) noclipdata[playerid][accelmul] += ACCEL_RATE;

	// Determine the speed to move the camera based on the acceleration multiplier
	new Float:speed = MOVE_SPEED * noclipdata[playerid][accelmul];

	// Calculate the cameras next position based on their current position and the direction their camera is facing
	new Float:X_fly, Float:Y_fly, Float:Z_fly;
	GetNextCameraPosition(noclipdata[playerid][mode], CP_tmp, FV_tmp, X_fly, Y_fly, Z_fly);
	MovePlayerObject(playerid, noclipdata[playerid][flyobject], X_fly, Y_fly, Z_fly, speed);

	// Store the last time the camera was moved as now
	noclipdata[playerid][lastmove] = GetTickCount();
	return 1;
}

//--------------------------------------------------

stock GetNextCameraPosition(move_mode, Float:CP_tmp[3], Float:FV_tmp[3], &Float:X_fly, &Float:Y_fly, &Float:Z_fly)
{
    // Calculate the cameras next position based on their current position and the direction their camera is facing
    #define OFFSET_X (FV_tmp[0]*6000.0)
	#define OFFSET_Y (FV_tmp[1]*6000.0)
	#define OFFSET_Z (FV_tmp[2]*6000.0)
	switch(move_mode)
	{
		case MOVE_FORWARD:
		{
			X_fly = CP_tmp[0]+OFFSET_X;
			Y_fly = CP_tmp[1]+OFFSET_Y;
			Z_fly = CP_tmp[2]+OFFSET_Z;
		}
		case MOVE_BACK:
		{
			X_fly = CP_tmp[0]-OFFSET_X;
			Y_fly = CP_tmp[1]-OFFSET_Y;
			Z_fly = CP_tmp[2]-OFFSET_Z;
		}
		case MOVE_LEFT:
		{
			X_fly = CP_tmp[0]-OFFSET_Y;
			Y_fly = CP_tmp[1]+OFFSET_X;
			Z_fly = CP_tmp[2];
		}
		case MOVE_RIGHT:
		{
			X_fly = CP_tmp[0]+OFFSET_Y;
			Y_fly = CP_tmp[1]-OFFSET_X;
			Z_fly = CP_tmp[2];
		}
		case MOVE_BACK_LEFT:
		{
			X_fly = CP_tmp[0]+(-OFFSET_X - OFFSET_Y);
 			Y_fly = CP_tmp[1]+(-OFFSET_Y + OFFSET_X);
		 	Z_fly = CP_tmp[2]-OFFSET_Z;
		}
		case MOVE_BACK_RIGHT:
		{
			X_fly = CP_tmp[0]+(-OFFSET_X + OFFSET_Y);
 			Y_fly = CP_tmp[1]+(-OFFSET_Y - OFFSET_X);
		 	Z_fly = CP_tmp[2]-OFFSET_Z;
		}
		case MOVE_FORWARD_LEFT:
		{
			X_fly = CP_tmp[0]+(OFFSET_X  - OFFSET_Y);
			Y_fly = CP_tmp[1]+(OFFSET_Y  + OFFSET_X);
			Z_fly = CP_tmp[2]+OFFSET_Z;
		}
		case MOVE_FORWARD_RIGHT:
		{
			X_fly = CP_tmp[0]+(OFFSET_X  + OFFSET_Y);
			Y_fly = CP_tmp[1]+(OFFSET_Y  - OFFSET_X);
			Z_fly = CP_tmp[2]+OFFSET_Z;
		}
	}
}
//--------------------------------------------------

stock CancelFlyMode(playerid)
{
	DeletePVar(playerid, "FlyMode");
	CancelEdit(playerid);
	TogglePlayerSpectating(playerid, false);

	DestroyPlayerObject(playerid, noclipdata[playerid][flyobject]);
	noclipdata[playerid][cameramode] = CAMERA_MODE_NONE;
	SetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
	SetPlayerFacingAngle(playerid, PI[playerid][A]);
	return 1;
}

//--------------------------------------------------

stock FlyMode(playerid)
{
	// Create an invisible object for the players camera to be attached to
	GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
	GetPlayerFacingAngle(playerid, PI[playerid][A]);
	noclipdata[playerid][flyobject] = CreatePlayerObject(playerid, 19300, PI[playerid][X], PI[playerid][Y], PI[playerid][Z], 0.0, 0.0, 0.0);

	// Place the player in spectating mode so objects will be streamed based on camera location
	TogglePlayerSpectating(playerid, true);
	// Attach the players camera to the created object
	AttachCameraToPlayerObject(playerid, noclipdata[playerid][flyobject]);

	SetPVarInt(playerid, "FlyMode", 1);
	noclipdata[playerid][cameramode] = CAMERA_MODE_FLY;
	return 1;
}

forward ClearReport(playerid);
public ClearReport(playerid)
{
	SetPVarInt(playerid, "Report", 0);
}

forward ClearAdv(playerid);
public ClearAdv(playerid)
{
	SetPVarInt(playerid, "Adv", 0);
}

forward StopLift(liftid, bool:pos);
public StopLift(liftid, bool:pos)
{
	Lifting[liftid] = false;
	if(pos)
	{
		MoveDynamicObject(LiftDoor[0], -1899.026977,-1636.332519,25.247129, 1.0, 0.000000,0.000000,90.0);
	} else {
		MoveDynamicObject(LiftDoor[1], -1899.204223,-1641.355712,-59.744762, 1.0, 0.0,0.000000,-90.0);
	}
}

forward PPPDS();
public PPPDS()
{
    if(GetTickCount()-GetSpeedModeIptimized>=200)
        OnUpdateCheatPlayers();
 	SetTimer("PPPDS",20,false);
}

forward OnUpdateCheatPlayers();
public OnUpdateCheatPlayers()
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || PIpen[i][Cheater] || PI[i][CheatTime] > 0 || GetPVarInt(i, "Dead") == 1 || GetPVarInt(i, "InSpec") == 1) continue;
		new Float:hp, Float:ar;
		GetPlayerHealth(i, hp);
		if(PI[i][HealthTime]>0)
		{
		    PI[i][HealthTime]--;
		} else {
			if(PI[i][Health] < hp && !PI[i][AFK])
			{
				format(glstr, sizeof(glstr), "{FF0000}%s [%d] подозревается в читерстве на здоровье", Name(i), i);
				SendAdminMessage(100, glstr);
				setPlayerHealth(i, PI[i][Health]);
				PI[i][CheatCount]++;
				if(PI[i][CheatCount] > 1)
				{
					InCheat(i, 1);
					continue;
				}
			} else {
				PI[i][Health] = hp;
			}
		}
		GetPlayerArmour(i, ar);
		if(PI[i][ArmorTime]>0)
		{
		    PI[i][ArmorTime]--;
		} else {
			if(PI[i][Armor] < ar && !PI[i][AFK])
			{
				format(glstr, sizeof(glstr), "{FF0000}%s [%d] подозревается в читерстве на броню", Name(i), i);
				SendAdminMessage(100, glstr);
				setPlayerArmour(i, PI[i][Armor]);
				PI[i][CheatCount]++;
				if(PI[i][CheatCount] > 1)
				{
					InCheat(i, 2);
					continue;
				}
			} else {
				PI[i][Armor] = ar;
			}
		}
	}
}

public OneTimer()
{
	online = 0;
	for(new i;i<PLAYERS;i++)
	{
	    if(!InGame(i)) continue;
		online++;
		if(online > R[Players])
		{
			new y,m,d,h,mn,s;
			getdate(y,m,d);
			gettime(h,mn,s);
			format(glstr,sizeof(glstr),"%d.%d.%d", d,m,y);
			format(R[Date], 10, glstr);
			format(glstr,sizeof(glstr),"%d:%d:%d", h,mn,s);
			format(R[Time], 10, glstr);
			R[Players] = online;
			format(glstr,sizeof(glstr),"Установлен новый рекорд онлайн игроков на сервере: %d", R[Players]);
			SendClientMessageToAll(0xFF0000FF, glstr);
			SendClientMessageToAll(0xFF0000FF, "Все игроки получают по 1000$");
			for(new rn;rn<PLAYERS;rn++)
			{
				if(!InGame(i)) continue;
				givePlayerMoney(rn, 1000);
			}
			switch(online)
			{
				case 50,100,150,200,300,350,400,450,550,600,650,700,800,850,900,950:
				{
					for(new rn;rn<PLAYERS;rn++)
					{
						if(!InGame(i)) continue;
						givePlayerMoney(rn, 10000);
					}
					SendClientMessageToAll(0xFF0000FF, "И дополнительно по 10000$");
				}
				case 250,750:
				{
					for(new rn;rn<PLAYERS;rn++)
					{
						if(!InGame(i)) continue;
						givePlayerMoney(rn, 250000);
					}
					SendClientMessageToAll(0xFF0000FF, "А также по 250000$!");
				}
				case 500, 1000:
				{
					for(new rn;rn<PLAYERS;rn++)
					{
						if(!InGame(i)) continue;
						givePlayerMoney(rn, 500000);
					}
					SendClientMessageToAll(0xFF0000FF, "Установлен максимальный рекорд игроков на сервере! Все получают по 500000$!");
				}
			}
		}
		if(GetPlayerInterior(i) == 0)
		{
			SetPlayerWeather(i, NowWeather);
		} else {
			SetPlayerWeather(i, 10);
		}
		new Float:hp, Float:ar;
		GetPlayerHealth(i, hp);
		GetPlayerArmour(i, ar);
		if(PI[i][CheatTime] > 0) PI[i][CheatTime]--;
		if(PI[i][CheatCount] > 0) PI[i][CheatCount]--;
		if(PI[i][Health] < 1000 && PI[i][GodMode] == 1) setPlayerHealth(i, 1000000.0);
		if(GetPVarInt(i, "PackedTime") > 0) SetPVarInt(i, "PackedTime", GetPVarInt(i, "PackedTime")-1);
        if(PIpen[i][Cheater] == 0) SetPlayerScore(i, PI[i][Level]);
		format(glstr, sizeof(glstr), RTP("Уровень: %d ~n~ Опыт: %d/%d"), PI[i][Level], PI[i][Exp], NeedPlayerExp(i));
		PlayerTextDrawSetString(i, main_info[i], glstr);
 		PlayerTextDrawShow(i, main_info[i]);
		format(glstr, sizeof(glstr), "ESC %s", JTF(PI[i][AFK]));
		if(PI[i][AFK] > 3 && GetPVarInt(i, "Dead") == 0) 
		{
			SetPlayerChatBubble(i, glstr, GetPlayerColor(i), 10.0, 1001);
		}
		PI[i][AFK]++;
	    if(hp <= 100 && PI[i][GodMode] == 0)
	    {
	        format(glstr, sizeof(glstr), "%.0f", hp);
	    	PlayerTextDrawSetString(i, HPinfo[i], glstr);
	    	PlayerTextDrawShow(i, HPinfo[i]);
	    } else {
	        PlayerTextDrawHide(i, HPinfo[i]);
	    }
	    if(ar != 0 && ar <= 100)
	    {
		    format(glstr, sizeof(glstr), "%.0f", ar);
		    PlayerTextDrawSetString(i, ARinfo[i], glstr);
		    PlayerTextDrawShow(i, ARinfo[i]);
	    } else {
	    	PlayerTextDrawHide(i, ARinfo[i]);
	    }
	    if(PIpen[i][MuteTime] > 0) PIpen[i][MuteTime]--;
		if(PIpen[i][MuteCMD] > 0) PIpen[i][MuteCMD]--;
		if(PIpen[i][MuteReport] > 0) PIpen[i][MuteReport]--;
		if(flood[i]) flood[i] = false;
		if(PI[i][ReadNews] > 0 && GetPVarInt(i, "History") == 0)
		{
			PI[i][ReadNews]--;
			ShowNews(i);
		}
	    if(PIpen[i][JailTime] > 0)
		{
		    format(glstr, sizeof(glstr), "%s", JTF(PIpen[i][JailTime]));
		    PIpen[i][JailTime]--;
		    GameTextForPlayer(i, glstr, 1100, 5);
		    if(PIpen[i][JailTime] == 0)
		    {
			    SetPlayerInterior(i, 0);
			    new rand = random(sizeof(outjailspawn));
				switch(rand)
				{
				    case 0: {
						SetPlayerPos(i, outjailspawn[1][0], outjailspawn[1][1], outjailspawn[1][2]);
						SetPlayerFacingAngle(i, outjailspawn[1][3]);
						SetPlayerInterior(i, outjailint[1]);
					}
				    case 1: {
						SetPlayerPos(i, outjailspawn[2][0], outjailspawn[2][1], outjailspawn[2][2]);
						SetPlayerFacingAngle(i, outjailspawn[2][3]);
						SetPlayerInterior(i, outjailint[2]);
					}
				    case 2: {
						SetPlayerPos(i, outjailspawn[0][0], outjailspawn[0][1], outjailspawn[0][2]);
						SetPlayerFacingAngle(i, outjailspawn[0][3]);
						SetPlayerInterior(i, outjailint[0]);
					}
				}
		    }
		}
		if(OnRoof(i))
		{
			GetPlayerPos(i, PI[i][X],PI[i][Y],PI[i][Z]);
			SetPlayerPos(i, PI[i][X],PI[i][Y],PI[i][Z]+2.0);
			ApplyAnimationEx(i, "PED", "BIKE_fallR", 4.0, 0, 1, 0, 0, 0);
		}
		if(IsPlayerInAnyVehicle(i))
		{
			new vid = GetPlayerVehicleID(i), Float:vhp;
			if(GetSpeed(i) > SpeedLimit[GetVehicleModel(vid)-400]+50 && PI[i][Admin] < 1000)
			{
				if(PI[i][CheatTime] > 0) 
				{
					InCheat(i, 3);
					continue;
				}
				format(glstr, sizeof(glstr), "{FF0000}%s [%d] подозревается в читерстве на скорость", Name(i), i);
				SendAdminMessage(100, glstr);
				PI[i][CheatTime] = 2;
			}
			format(glstr,sizeof(glstr),RTP("%d КМ/Ч"), GetVehicleSpeed(vid));
			PlayerTextDrawSetString(i, SpeedCar[i], glstr);
			format(glstr,sizeof(glstr),RTP("%.0f"),Fuel[vid]);
			if(Fuel[vid] <= 100.0) PlayerTextDrawSetString(i, FuelCarLevel[i], glstr);
			GetVehicleHealth(vid, vhp);
			if(vhp > 400.0) format(glstr,sizeof(glstr),RTP("~g~%.0f"), vhp/10);
			else if(vhp > 250.0) format(glstr,sizeof(glstr),RTP("~y~%.0f"), vhp/10);
			else format(glstr,sizeof(glstr),RTP("~r~%.0f"), vhp/10);
			PlayerTextDrawSetString(i, HPCar[i], glstr);
			format(glstr,sizeof(glstr),RTP("%s"),vName[GetVehicleModel(vid)-400]);
			PlayerTextDrawSetString(i, SpeedNameCar[i], glstr);
			if(CarLocked[vid])
			{
				PlayerTextDrawSetString(i, LockedCar[i], RTP("~r~ЗАКРЫТО"));
			} else {
				PlayerTextDrawSetString(i, LockedCar[i], RTP("~g~ОТКРЫТО"));
			}
			if(GetPVarInt(i, "InOilShop") == 1 && Fuel[vid] < GetPVarFloat(i, "BuyOil"))
			{
				SetVehicleFuel(vid, Fuel[vid]+1.0);
				if(Fuel[vid] >= GetPVarFloat(i, "BuyOil"))
				{
					SetPVarInt(i, "InOilShop", 0);
					ToggleEngine(vid);
					SetVehicleFuel(vid, GetPVarFloat(i, "BuyOil"));
				}
			}
			for(new v;v<sizeof(TaxiCars);v++)
			{
				if(vid != TaxiCars[v]) continue;
				if(GetPlayerVehicleSeat(i) != 0)
				{
					for(new p;p<PLAYERS;p++)
					{
						if(!InGame(p) || vid != GetPlayerVehicleID(p) || GetPlayerVehicleSeat(p) != 0) continue;
						if(GetPVarInt(p, "IsOnJob") == 0 || GetVehicleSpeed(vid) < 60.0) continue;
						MoveMoney(i,p,2);
						break;
					}
				}
				break;
			}
		}
		if(!IsPlayerInRangeOfPoint(i, 1.0, PI[i][X],PI[i][Y],PI[i][Z])) SetPVarInt(i, "OnPickUp", GetPVarInt(i, "OnPickUp")-1);
		if(GetPlayerInterior(i) == 0) GetPlayerZone(i, PI[i][sZone]);
		if(noclipdata[i][cameramode] == CAMERA_MODE_FLY)
		{
			new keys,ud,lr;
			GetPlayerKeys(i,keys,ud,lr);

			if(noclipdata[i][mode] && (GetTickCount() - noclipdata[i][lastmove] > 100))
			{
				// If the last move was > 100ms ago, process moving the object the players camera is attached to
				MoveCamera(i);
			}

			// Is the players current key state different than their last keystate?
			if(noclipdata[i][udold] != ud || noclipdata[i][lrold] != lr)
			{
				if((noclipdata[i][udold] != 0 || noclipdata[i][lrold] != 0) && ud == 0 && lr == 0)
				{   // All keys have been released, stop the object the camera is attached to and reset the acceleration multiplier
					StopPlayerObject(i, noclipdata[i][flyobject]);
					noclipdata[i][mode]      = 0;
					noclipdata[i][accelmul]  = 0.0;
				}
				else
				{   // Indicates a new key has been pressed

					// Get the direction the player wants to move as indicated by the keys
					noclipdata[i][mode] = GetMoveDirectionFromKeys(ud, lr);

					// Process moving the object the players camera is attached to
					MoveCamera(i);
				}
			}
			noclipdata[i][udold] = ud; noclipdata[i][lrold] = lr; // Store current keys pressed for comparison next update
		}
 	}
	for(new i;i<=MAX_VEHICLES;i++)
	{
		if(!IsVehicleInGame(i)) continue;
		GetVehicleParamsEx(i, engine, lights, alarm, doors, bonnet, boot, objective);
		if(Fuel[i] < 1 && Engine[i] && !IsBike(i)) Engine[i] = false, SetVehicleFuel(i, 0.0);
		SetVehicleParamsEx(i, Engine[i], lights, alarm, CarLocked[i], bonnet, boot, objective);
	}
	for(new i;i<sizeof(MiniBus);i++)
    {
        new Float:vehx, Float:vehy, Float:vehz;
        new Float:nvehx, Float:nvehy, Float:nvehz;
        GetVehiclePos(Bus[i], vehx, vehy, vehz);
        GetMiniMapCoord(vehx,vehy,nvehx,nvehy,nvehz);
		MoveDynamicObject(MiniBus[i], nvehx, nvehy, nvehz, 0.5, 0.0, 0.0, 0.0);
    }
	for(new i;i<sizeof(MiniTaxi);i++)
    {
        new Float:vehx, Float:vehy, Float:vehz;
        new Float:nvehx, Float:nvehy, Float:nvehz;
        GetVehiclePos(TaxiCars[i], vehx, vehy, vehz);
        GetMiniMapCoord(vehx,vehy,nvehx,nvehy,nvehz);
		MoveDynamicObject(MiniTaxi[i], nvehx, nvehy, nvehz, 0.5, 0.0, 0.0, 0.0);
    }
	if(allflood > 0) allflood--;
	return true;
}

public FiveTimer()
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(GetPVarInt(i, "InHospital") == 1 && PI[i][Health] < 50) 
		{
			setPlayerHealth(i, PI[i][Health]+1);
		}
		if(PI[i][Health] < 5 && PI[i][Health] > 0)
		{
			if(IsPlayerInAnyVehicle(i)) ClearAnimations(i);
			ApplyAnimationEx(i, "CRACK", "CRCKIDLE2", 4.1, 1,0,0,0,0);
			setPlayerHealth(i, PI[i][Health]-0.1);
		} else {
			if(!IsPlayerInAnyVehicle(i)) if(!strcmp(GetAnimName(i), "CRCKIDLE2", true)) ClearAnimations(i);
		}
	}
}

public MinTimer()
{   
	gettime(glhour, glmins);
   	format(glstr,sizeof(glstr),"%02d:%02d",glhour,glmins);
   	TextDrawSetString(txtTimeDisp,glstr);
   	SetWorldTime(glhour);
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		//SetPlayerTime(i, glhour, glmins);
		if(PI[i][Eat] < 5 && PI[i][Health] > 5 && !PI[i][GodMode])
		{
			setPlayerHealth(i, PI[i][Health] - 5);
			SendClientMessage(i, -1, "Ты голоден, твоё здоровье ухудшается");
		}
		if(PI[i][GameTime] < 60)
		{
		    PI[i][GameTime]++;
	 	} else {
	 	    GivePlayerExp(i, 1);
			if(PI[i][Law] < 100) LawPlayer(i, 1, true);
			SendClientMessage(i, 0x00FF00FF, "Опыт повышен");
			if(PI[i][Rank] > 0)
			{
				givePlayerMoney(i, fPay[PI[i][Rank]-1][PI[i][Faction]-1]);
				format(glstr,sizeof(glstr),"Заработная плата - $%d", fPay[PI[i][Rank]-1][PI[i][Faction]-1]);
				SendClientMessage(i, 0x00FF00FF, glstr);
			}
			if(PI[i][Admin] > 0)
			{
				givePlayerMoney(i, PI[i][Admin]*10);
				format(glstr,sizeof(glstr),"Заработная плата админа - $%d", PI[i][Admin]*10);
				SendClientMessage(i, 0x00FF00FF, glstr);
			}
	 	}
 	}
	for(new i;i<MAX_VEHICLES;i++)
	{
		if(!IsVehicleInGame(i) || IsBike(i)) continue;
		if(Engine[i])
		{
			SetVehicleFuel(i, Fuel[i]-1.0);
		}
	}
	if(glhour == r_hour && glmins == r_min)
	{
		Restart();
	}
	else if(glhour == r_hour && glmins+10 >= r_min)
	{
		new ost = r_min-glmins;
		if(ost <= 10 && ost > 0)
		{
			switch(ost)
			{
				case 1: format(glstr, sizeof(glstr), "Через %d минуту рестарт", ost);
				case 2,3,4: format(glstr, sizeof(glstr), "Через %d минуты рестарт", ost);
				case 5,6,7,8,9,10: format(glstr, sizeof(glstr), "Через %d минут рестарт", ost);
			}
			SendClientMessageToAll(0xFFD324FF, glstr);
		}
	}
	return true;
}

public Min5Timer()
{
	saveall();
	//mysql_query(mysql1, "UPDATE `users` SET `SavePosition` = '0'", false);
	mysql_query(mysql1, "UPDATE `users` SET `Online` = '0'", false);
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		mysql_format(mysql1, query1, sizeof(glstr), "UPDATE `users` SET `Online` = '1' WHERE `ID` = '%d'", i);
		mysql_query(mysql1, query1, false);
	}
	return true;
}

public HourTimer()
{
	UpdateWeather();
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(PI[i][Eat] > 1)
		{
			PI[i][Eat] -= 10;
			if(PI[i][Eat] < 10) SendClientMessage(i, -1, "Ты голоден");
		}
	}
	for(new i;i<MAX_VEHICLES;i++)
	{
		if(VehOfPlayer[i] || VehUsed[i] || VehOfAdmin[i] || !IsVehicleInGame(i)) continue;
		Engine[i] = false;
		CarLocked[i] = false;
		SetVehicleToRespawn(i);
	}
}

public OnGameModeInit()
{
	SetGameModeText(gmtext);
	format(glstr, sizeof(glstr), "hostname %s", hostname);
	SendRconCommand(glstr);
	SendRconCommand("reloadfs obj");
	DisableInteriorEnterExits();
	DisableNameTagLOS();
	ShowPlayerMarkers(2);
	SetNameTagDrawDistance(25.0);
	EnableStuntBonusForAll(0);
	MapAndreas_Init(MAP_ANDREAS_MODE_FULL);
	SetTimer("OneTimer", 1000, true);
	SetTimer("FiveTimer", 5000, true);
	SetTimer("MinTimer", 60000, true);
	SetTimer("Min5Timer", 300000, true);
	SetTimer("HourTimer", 3600000, true);
	//SetTimer("PPPDS",20,false);
	GetSpeedModeIptimized=GetTickCount();
	for(new i;i<200;i++) AddPlayerClass(i, 1958.3783, 1343.1572, 15.3746, 269.1425, 0, 0, 0, 0, 0, 0);
    mysql_log(DEBUG);
	mysql1 = mysql_connect_file();
	print("\nMySQL: подключаюсь...");
    switch(mysql_errno())
    {
	    case 0: print("MySQL: успешно подключён\n");
	    default: 
		{
			print("MySQL: не удалось подключиться\n"); 
			//return OnGameModeExit();
		}
	}
    //mysql_query("SET NAMES cp1251");
	mysql_set_charset("cp1251");
	LoadNews();
	mysql_tquery(mysql1, "SELECT * FROM `houses`", "LoadHouses", "");
	mysql_tquery(mysql1, "SELECT * FROM `recordonline`", "LoadRecord", "");
	spawnhelp = CreateDynamicPickup(18749,23,2808.8528,-1571.3999,11.0938);
	spawneat = CreateDynamicPickup(1582,23,2817.2354,-1576.8859,10.9287);
	works = CreateDynamicPickup(1210,23,366.5566,159.5853,1008.3828);

	for(new i;i<sizeof(EnterCarShop);i++)
	{
		EnterCarShop[i] = CreateDynamicPickup(1239,23,CarShopEnter[i][0],CarShopEnter[i][1],CarShopEnter[i][2],0,0,-1,100.0);
		Create3DTextLabel("Нажми H, чтобы войти в автосалон", 0xFFFF00FF,CarShopEnter[i][0],CarShopEnter[i][1],CarShopEnter[i][2], 20.0, 0, 1);
		CreateDynamicMapIcon(CarShopEnter[i][0],CarShopEnter[i][1],CarShopEnter[i][2],55,-1,-1,0,-1,400.0);
	}
	for(new i;i<sizeof(EnterMeria);i++)
	{
		EnterMeria[i] = CreateDynamicPickup(19130,23,MeriaEnter[i][0], MeriaEnter[i][1], MeriaEnter[i][2], 0);
		CreateDynamicMapIcon(MeriaEnter[i][0], MeriaEnter[i][1], MeriaEnter[i][2],58, -1, 0, 0, -1, 500.0);
	}
	EnterMeria[0] = CreateDynamicPickup(19130,23,MeriaEnter[0][0], MeriaEnter[0][1], MeriaEnter[0][2],-1, 3, -1, 30.0);
    MeriaPassport = CreateDynamicPickup(1239,23,359.2096,164.6400,1008.3828,-1,3,-1,30.0);

	for(new i=1;i<sizeof(EnterArms);i++)
	{
		EnterArms[i] = CreateDynamicPickup(19130,23,ArmsEnter[i][0], ArmsEnter[i][1], ArmsEnter[i][2], 0);
	}
	EnterArms[0] = CreateDynamicPickup(19130,23,ArmsEnter[0][0], ArmsEnter[0][1], ArmsEnter[0][2], -1, 1, -1, 30.0);

	for(new i;i<sizeof(EnterHospital);i++)
	{
		EnterHospital[i] = CreateDynamicPickup(19130,23,HospitalEnter[i][0], HospitalEnter[i][1], HospitalEnter[i][2], -1);
		if(i > 3) continue;
		CreateDynamicMapIcon(HospitalEnter[i][0], HospitalEnter[i][1], HospitalEnter[i][2],22,-1,-1,0,-1,400.0);
	}

	for(new i;i<sizeof(EnterLSPD);i++)
	{
		EnterLSPD[i] = CreateDynamicPickup(19130,23,LSPDEnter[i][0], LSPDEnter[i][1], LSPDEnter[i][2], 0);
	}
	CreateDynamicMapIcon(LSPDEnter[1][0], LSPDEnter[1][1], LSPDEnter[1][2], 30, -1, 0, 0, -1, 500.0);

	for(new i;i<sizeof(EnterSFPD);i++)
	{
		EnterSFPD[i] = CreateDynamicPickup(19130,23,SFPDEnter[i][0], SFPDEnter[i][1], SFPDEnter[i][2], 0);
	}
	CreateDynamicMapIcon(SFPDEnter[1][0], SFPDEnter[1][1], SFPDEnter[1][2], 30, -1, 0, 0, -1, 500.0);

	for(new i;i<sizeof(EnterLVPD);i++)
	{
		EnterLVPD[i] = CreateDynamicPickup(19130,23,LVPDEnter[i][0], LVPDEnter[i][1], LVPDEnter[i][2], 0);
	}
	CreateDynamicMapIcon(LVPDEnter[1][0], LVPDEnter[1][1], LVPDEnter[1][2], 30, -1, 0, 0, -1, 500.0);

	for(new i=1;i<sizeof(EnterNews);i++)
	{
		EnterNews[i] = CreateDynamicPickup(19130,23,NewsEnter[i][0], NewsEnter[i][1], NewsEnter[i][2], 0);
		CreateDynamicMapIcon(NewsEnter[i][0], NewsEnter[i][1], NewsEnter[i][2],48, -1, 0, 0, -1, 500.0);
	}
	EnterNews[0] = CreateDynamicPickup(19130,23,NewsEnter[0][0], NewsEnter[0][1], NewsEnter[0][2], -1, 18, -1, 30.0);

	for(new i=1;i<sizeof(EnterSkinShop);i++)
	{
		CreateDynamicMapIcon(SkinShopEnter[i][0], SkinShopEnter[i][1], SkinShopEnter[i][2], 45, -1, 0,0, -1, 500.0);
		if(i == 1) {
			EnterSkinShop[i] = CreateDynamicPickup(1275, 23, SkinShopEnter[i][0], SkinShopEnter[i][1], SkinShopEnter[i][2], -1, 5, -1, 30.0);
		} else {
			EnterSkinShop[i] = CreateDynamicPickup(19130,23,SkinShopEnter[i][0], SkinShopEnter[i][1], SkinShopEnter[i][2], 0);
		}
	}
	EnterSkinShop[0] = CreateDynamicPickup(19130,23,SkinShopEnter[0][0], SkinShopEnter[0][1], SkinShopEnter[0][2], -1, 5, -1, 30.0);

	for(new i=1;i<sizeof(Enter247);i++)
	{
		Enter247[i] = CreateDynamicPickup(19130,23,Enter_247[i][0], Enter_247[i][1], Enter_247[i][2], 0);
		CreateDynamicMapIcon(Enter_247[i][0], Enter_247[i][1], Enter_247[i][2], 25, -1, 0, 0, -1, 30.0);
	}
	Enter247[0] = CreateDynamicPickup(19130,23,Enter_247[0][0], Enter_247[0][1], Enter_247[0][2], -1, 6, -1, 30.0);

	for(new i=1;i<sizeof(EnterBank);i++)
	{
		EnterBank[i] = CreateDynamicPickup(19130,23,BankEnter[i][0], BankEnter[i][1], BankEnter[i][2], 0);
		CreateDynamicMapIcon(BankEnter[i][0], BankEnter[i][1], BankEnter[i][2], 52, -1, 0, 0, -1, 500.0);
	}
	CreateDynamic3DTextLabel("Нажми H", 0x00FF00DD, 2308.8147,-13.2479,26.7422, 10.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 1, -1, 0, -1, 11.0);
	EnterBank[0] = CreateDynamicPickup(19130, 23, BankEnter[0][0], BankEnter[0][1], BankEnter[0][2], -1, 0, -1, 30.0);

	for(new i=1;i<sizeof(EnterEat);i++)
	{
		EnterEat[i] = CreateDynamicPickup(19130,23,EatEnter[i][0], EatEnter[i][1], EatEnter[i][2], 0);
		CreateDynamicMapIcon(EatEnter[i][0], EatEnter[i][1], EatEnter[i][2], 29, -1, 0, 0, -1, 500.0);
	}
	EnterEat[0] = CreateDynamicPickup(19130,23,EatEnter[0][0], EatEnter[0][1], EatEnter[0][2], -1, 9, -1, 30.0);

	for(new i=1;i<sizeof(EnterLic);i++)
	{
		if(i == sizeof(EnterLic)-1)
		{
			EnterLic[i] = CreateDynamicPickup(1239,23,LicEnter[i][0], LicEnter[i][1], LicEnter[i][2]);
		} else {
			EnterLic[i] = CreateDynamicPickup(19130,23,LicEnter[i][0], LicEnter[i][1], LicEnter[i][2], 0);
		}
	}
	CreateDynamicMapIcon(LicEnter[1][0], LicEnter[1][1], LicEnter[1][2],36,-1,-1,0,-1,400.0);
	EnterLic[0] = CreateDynamicPickup(19130,23,LicEnter[0][0], LicEnter[0][1], LicEnter[0][2], -1, 3, -1, 30.0);

	for(new i;i<sizeof(OilShop);i++)
	{
		Create3DTextLabel("Нажми H, чтобы заправиться", 0x00FF00DD,OilShop[i][0], OilShop[i][1], OilShop[i][2], 50.0, 0, 0);
		CreateDynamicMapIcon(OilShop[i][0], OilShop[i][1], OilShop[i][2], 51, -1, 0, 0, -1, 500.0);
	}
	
	for(new i;i<sizeof(ATM);i++)
	{
		CreateDynamicObject(2754,ATM[i][0],ATM[i][1],ATM[i][2],0.0,0.0,ATM[i][3]);
		CreateDynamic3DTextLabel("\n\nНажми F",0x00FF00AA,ATM[i][0],ATM[i][1],ATM[i][2]+1,5.0);
	}
	
	CreateDynamic3DTextLabel("Ты находишься в читерском мире", -1, 2492.7766,-1678.9456,13.3376, 100.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, 666777, 0, -1, 100.0);  
	CreateDynamic3DTextLabel("Подойди, чтобы купить аптечку", 0x00FF00AA, 136.8953,-90.8954,845.2156, 20.0, INVALID_PLAYER_ID, INVALID_VEHICLE_ID, 0, -1, -1, -1, 20.0);  
	EatCP[0] = CreateDynamicCP(369.4292,-6.0166,1001.8516, 1.0, -1, -1, -1, 100.0);
	ArmsEat[0] = CreateDynamicPickup(2821,23,1005.2720,52.5921,957.2239);
	CP247[0] = CreateDynamicCP(-23.2850,-55.0377,1003.5469, 1.5, -1, -1, -1, 100.0);
	PackerCP[0] = CreateDynamicCP(2230.8132324219,-2285.7043457031,13.531787872314, 2.0, -1, -1, -1, 100.0);
	PackerCP[1] = CreateDynamicCP(2172.1313476563,-2255.2292480469,12.454199790955, 2.0, -1, -1, -1, 100.0);
	WooderCP[0] = CreateDynamicCP(-1634.3583,-2251.2302,31.4001, 2.0, -1, -1, -1, 100.0);
	WooderCP[1] = CreateDynamicCP(-1643.1154,-2262.0256,32.5916, 3.0, -1, -1, -1, 100.0);
	WooderCP[2] = CreateDynamicCP(-1629.1400,-2270.6396,35.4229, 4.0, -1, -1, -1, 100.0);
	WooderCP[3] = CreateDynamicCP(-1641.6318,-2277.3574,36.6335, 3.0, -1, -1, -1, 100.0);
	MinerCP[0] = CreateDynamicCP(-428.8436,1392.2938,15.2462, 1.0, -1, -1, -1, 1000.0);
	MinerCP[1] = CreateDynamicCP(-415.9684,1364.3625,11.6402, 2.0, -1, -1, -1, 1000.0);
	MinerCP[2] = CreateDynamicCP(-405.4170,1308.4211,10.4068, 2.0, -1, -1, -1, 1000.0);
	MinerCP[3] = CreateDynamicCP(-396.3760,1290.6945,8.6251, 2.0, -1, -1, -1, 1000.0);
	MinerCP[4] = CreateDynamicCP(-395.3147,1246.4539,5.6918, 2.0, -1, -1, -1, 1000.0);
	MinerCP[5] = CreateDynamicCP(-463.3203,1413.3608,21.0, 2.0, -1, -1, -1, 1000.0);
	DriverCP[0] = CreateDynamicCP(-2026.8080,-114.3907,1035.1719, 1.0, -1, -1, -1, 100.0);
	HealCP[1] = CreateDynamicCP(136.9327,-91.0765,845.2156, 1.0, -1, -1, -1, 100.0);
	for(new i;i<sizeof(BusWay1);i++)
	{
		if(i == sizeof(BusWay1)-1)
		{
			BusWay1CP[i] = CreateDynamicRaceCP(0, BusWay1[i][0], BusWay1[i][1], BusWay1[i][2], BusWay1[0][0], BusWay1[0][1], BusWay1[0][2], 5.0, 0, 0, -1, 1000.0);
		} else {
			BusWay1CP[i] = CreateDynamicRaceCP(0, BusWay1[i][0], BusWay1[i][1], BusWay1[i][2], BusWay1[i+1][0], BusWay1[i+1][1], BusWay1[i+1][2], 5.0, 0, 0, -1, 1000.0);
		}
	}
	for(new i;i<sizeof(BusWay2);i++)
	{
		if(i == sizeof(BusWay2)-1)
		{
			BusWay2CP[i] = CreateDynamicRaceCP(0, BusWay2[i][0], BusWay2[i][1], BusWay2[i][2], BusWay2[0][0], BusWay2[0][1], BusWay2[0][2], 5.0, 0, 0, -1, 1000.0);
		} else {
			BusWay2CP[i] = CreateDynamicRaceCP(0, BusWay2[i][0], BusWay2[i][1], BusWay2[i][2], BusWay2[i+1][0], BusWay2[i+1][1], BusWay2[i+1][2], 5.0, 0, 0, -1, 1000.0);
		}
	}
	for(new i;i<sizeof(BusWay3);i++)
	{
		if(i == sizeof(BusWay3)-1)
		{
			BusWay3CP[i] = CreateDynamicRaceCP(0, BusWay3[i][0], BusWay3[i][1], BusWay3[i][2], BusWay3[0][0], BusWay3[0][1], BusWay3[0][2], 5.0, 0, 0, -1, 1000.0);
		} else {
			BusWay3CP[i] = CreateDynamicRaceCP(0, BusWay3[i][0], BusWay3[i][1], BusWay3[i][2], BusWay3[i+1][0], BusWay3[i+1][1], BusWay3[i+1][2], 5.0, 0, 0, -1, 1000.0);
		}
	}
	for(new i;i<sizeof(BusWay4);i++)
	{
		if(i == sizeof(BusWay4)-1)
		{
			BusWay4CP[i] = CreateDynamicRaceCP(0, BusWay4[i][0], BusWay4[i][1], BusWay4[i][2], BusWay4[0][0], BusWay4[0][1], BusWay4[0][2], 5.0, 0, 0, -1, 1000.0);
		} else {
			BusWay4CP[i] = CreateDynamicRaceCP(0, BusWay4[i][0], BusWay4[i][1], BusWay4[i][2], BusWay4[i+1][0], BusWay4[i+1][1], BusWay4[i+1][2], 5.0, 0, 0, -1, 1000.0);
		}
	}
	for(new i;i<sizeof(LicWay);i++)
	{
		if(i == sizeof(LicWay)-1)
		{
			LicWayCP[i] = CreateDynamicRaceCP(1, LicWay[i][0], LicWay[i][1], LicWay[i][2], LicWay[0][0], LicWay[0][1], LicWay[0][2], 5.0, 0, 0, -1, 1000.0);
		} else {
			LicWayCP[i] = CreateDynamicRaceCP(0, LicWay[i][0], LicWay[i][1], LicWay[i][2], LicWay[i+1][0], LicWay[i+1][1], LicWay[i+1][2], 5.0, 0, 0, -1, 1000.0);
		}
	}

	CarShopBox = TextDrawCreate(320.000000, 340.000000, "usebox");
	TextDrawLetterSize(CarShopBox, 0.019666, 11.334944);
	TextDrawTextSize(CarShopBox, 350.666442, 123.614776);
	TextDrawAlignment(CarShopBox, 2);
	TextDrawColor(CarShopBox, 0);
	TextDrawUseBox(CarShopBox, true);
	TextDrawBoxColor(CarShopBox, 80);
	TextDrawSetShadow(CarShopBox, 0);
	TextDrawSetOutline(CarShopBox, 0);
	TextDrawBackgroundColor(CarShopBox, 1888878592);
	TextDrawFont(CarShopBox, 0);
	SpeedCarBox = TextDrawCreate(502.555603, 369.129608, "usebox");
	TextDrawLetterSize(SpeedCarBox, 0.000000, -9.787867);
	TextDrawTextSize(SpeedCarBox, 609.111083, 0.000000);
	TextDrawAlignment(SpeedCarBox, 1);
	TextDrawColor(SpeedCarBox, 0);
	TextDrawUseBox(SpeedCarBox, true);
	TextDrawBoxColor(SpeedCarBox, 102);
	TextDrawSetShadow(SpeedCarBox, 0);
	TextDrawSetOutline(SpeedCarBox, 0);
	TextDrawFont(SpeedCarBox, 0);
	ServerLabel = TextDrawCreate(538.000000, 5.600014, "Georgia Rp");
	TextDrawLetterSize(ServerLabel, 0.449999, 1.600000);
	TextDrawAlignment(ServerLabel, 1);
	TextDrawColor(ServerLabel, -1378294017);
	TextDrawSetShadow(ServerLabel, 0);
	TextDrawSetOutline(ServerLabel, 1);
	TextDrawBackgroundColor(ServerLabel, 51);
	TextDrawFont(ServerLabel, 0);
	TextDrawSetProportional(ServerLabel, 1);
	txtTimeDisp = TextDrawCreate(605.0,25.0,"00:00");
	TextDrawUseBox(txtTimeDisp, 0);
	TextDrawFont(txtTimeDisp, 3);
	TextDrawSetShadow(txtTimeDisp,0);
    TextDrawSetOutline(txtTimeDisp,1);
    TextDrawBackgroundColor(txtTimeDisp,25500000);
    TextDrawColor(txtTimeDisp,0x6AFFB5CE);
    TextDrawAlignment(txtTimeDisp,3);
	TextDrawLetterSize(txtTimeDisp,0.5,1.5);
	gettime(glhour, glmins);
   	format(glstr,sizeof(glstr),"%02d:%02d",glhour,glmins);
   	TextDrawSetString(txtTimeDisp,glstr);
	packer = CreateDynamicPickup(1275, 23, 2137.8227539063,-2282.4379882813,20.671875, 0, 0, -1, 100.0);
 	CreateDynamicMapIcon(2137.8227539063,-2282.4379882813,20.671875,11,-1,0,0,-1,400.0);
	wooder = CreateDynamicPickup(1275, 23, -1636.1075,-2242.6624,31.4766, 0, 0, -1, 100.0);
 	CreateDynamicMapIcon(-1636.1075,-2242.6624,31.4766,11,-1,0,0,-1,400.0);
	miner = CreateDynamicPickup(1275, 23, -473.2987,1413.5334,21.2620, 0, 0, -1, 100.0);
 	CreateDynamicMapIcon(-1830.3652,-1639.9216,22.2496,11,-1,0,0,-1,400.0);

	Gate_FRAC12[0] = CreateDynamicObject(986,430.95200,2566.80005,15.88000, 0.000000,0.000000,271.0, 0, 0);
	Gate_FRAC12[1] = CreateDynamicObject(988, -81.761,2562.041,16.517, 0.000000,0.000000,270.0, 0, 0);
	Gate_FRAC11[0] = CreateDynamicObject(3114, -1414.445, 516.45, 9.63, 0.0, 0.0, 0.0, 0, 0);
	Gate_FRAC11[1] = CreateDynamicObject(3115, -1456.7, 501.3, 9.91, 0.0, 0.0, 0.0, 0, 0);
	Gate_FRAC11[2] = CreateDynamicObject(3113, -1465.8, 501.3, 1.04, 0.0, 0.0, 0.0, 0, 0);
	Gate_FRAC10[0] = CreateDynamicObject(19313, 285.93, 1821.51, 19.93, 0.00, 0.00, 269.99, 0, 0);
	Gate_FRAC10[1] = CreateDynamicObject(19313, 134.90, 1941.47, 21.64, 0.00, 0.00, 0.00, 0, 0);
	Gate_FRAC10[2] = CreateDynamicObject(968, 343, 1796.7, 18.14, 0.00, 90.00, 32.25);
	Gate_LSPD[0] = CreateDynamicObject(968, 1544.7, -1630.9, 13.2, 0, 269, 270.25);
	Gate_SFPD[0] = CreateDynamicObject(968, -1572.2, 658.79999, 7, 0, 91, 90);
	Gate_SFPD[1] = CreateDynamicObject(968, -1701.5, 687.70001, 24.7, 0, 269.5, 90.747);
	Gate_LVPD[0] = CreateDynamicObject(968, 2238.2002, 2450.4004, 10.6, 0, 89.25, 90.245);
	Gate_LVPD[1] = CreateDynamicObject(968, 2349.6006, 2424.2002, 10.4, 0, 269.25, 0);
	Gate_Lic[0] = CreateDynamicObject(968, -2061.8994, -90.70019, 34.8, 0, 90.0, 270.0);
	Gate_Nicky[0] = CreateDynamicObject(980, 1245.5, -767.2998, 91.18, 0, 0, 0);

	Lift[0] = CreateDynamicObject(17566, -1900.870361,-1638.847900,23.963088, -0.099999,88.200050,-0.099999, 0, 0);
	LiftDoor[0] = CreateDynamicObject(19303, -1899.026977,-1636.332519,25.247129, 0.000000,0.000000,90.0, 0, 0); // up door move 2
	LiftDoor[1] = CreateDynamicObject(19303, -1899.204223,-1639.844360,-59.744762, 0.0,0.000000,-90.0, 0, 0); // down door move 1

	OtherVeh[0] = AddStaticVehicle(509,2796.083,-1589.2397,10.4398,270.0,74,1); // bike1
	OtherVeh[1] = AddStaticVehicle(509,2796.083,-1584.7533,10.4398,270.0,74,1); // bike2
	OtherVeh[2] = AddStaticVehicle(509,2796.083,-1580.2669,10.4398,270.0,74,1); // bike3
	OtherVeh[3] = AddStaticVehicle(509,2796.083,-1575.7805,10.4398,270.0,74,1); // bike4
	OtherVeh[4] = AddStaticVehicle(509,2796.083,-1571.2941,10.4398,270.0,74,1); // bike5
	OtherVeh[5] = AddStaticVehicle(509,2796.083,-1566.8077,10.4398,270.0,74,1); // bike6
	OtherVeh[6] = AddStaticVehicle(509,2796.083,-1562.3213,10.4398,270.0,74,1); // bike7
	OtherVeh[7] = AddStaticVehicle(509,2796.083,-1557.8349,10.4398,270.0,74,1); // bike8
	OtherVeh[8] = AddStaticVehicle(509,2796.083,-1553.3485,10.4398,270.0,74,1); // bike9
	OtherVeh[9] = AddStaticVehicle(509,2796.083,-1548.8621,10.4398,270.0,74,1); // bike10
	OtherVeh[10] = AddStaticVehicle(462,2802.8359,-1549.312,10.5194,270.0,74,1); // motobike
	OtherVeh[11] = AddStaticVehicle(462,2802.8359,-1553.8777,10.5194,270.0,74,1); // motobike
	OtherVeh[12] = AddStaticVehicle(462,2802.8359,-1558.4434,10.5194,270.0,74,1); // motobike
	OtherVeh[13] = AddStaticVehicle(462,2802.8359,-1563.0091,10.5194,270.0,74,1); // motobike
	OtherVeh[14] = AddStaticVehicle(462,2802.8359,-1567.5748,10.5194,270.0,74,1); // motobike
	OtherVeh[15] = AddStaticVehicle(462,2802.8359,-1572.1405,10.5194,270.0,74,1); // motobike
	OtherVeh[16] = AddStaticVehicle(462,2802.8359,-1576.7062,10.5194,270.0,74,1); // motobike
	OtherVeh[17] = AddStaticVehicle(462,2802.8359,-1581.2719,10.5194,270.0,74,1); // motobike
	OtherVeh[18] = AddStaticVehicle(462,2802.8359,-1585.8376,10.5194,270.0,74,1); // motobike
	OtherVeh[19] = AddStaticVehicle(462,2802.8359,-1590.4033,10.5194,270.0,74,1); // motobike
	OtherVeh[20] = AddStaticVehicle(509,1210.832,-1305.9189,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[21] = AddStaticVehicle(509,1210.832,-1309.0515,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[22] = AddStaticVehicle(509,1210.832,-1312.1841,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[23] = AddStaticVehicle(509,1210.832,-1315.3167,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[24] = AddStaticVehicle(509,1210.832,-1318.4493,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[25] = AddStaticVehicle(509,1210.832,-1321.5819,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[26] = AddStaticVehicle(509,1210.832,-1324.7145,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[27] = AddStaticVehicle(509,1210.832,-1327.8471,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[28] = AddStaticVehicle(509,1210.832,-1330.9797,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[29] = AddStaticVehicle(509,1210.832,-1334.1123,12.9026,180.0,74,1); // hospLSbike
	OtherVeh[30] = AddStaticVehicle(509,-2623.9375,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[31] = AddStaticVehicle(509,-2625.8828,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[32] = AddStaticVehicle(509,-2627.8281,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[33] = AddStaticVehicle(509,-2629.7734,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[34] = AddStaticVehicle(509,-2631.7187,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[35] = AddStaticVehicle(509,-2633.664,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[36] = AddStaticVehicle(509,-2635.6093,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[37] = AddStaticVehicle(509,-2637.5546,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[38] = AddStaticVehicle(509,-2639.4999,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[39] = AddStaticVehicle(509,-2641.4452,608.7056,13.9651,180.0,74,1); // hospSFbike
	OtherVeh[40] = AddStaticVehicle(509,1913.9386,2223.6951,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[41] = AddStaticVehicle(509,1913.9386,2224.8474,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[42] = AddStaticVehicle(509,1913.9386,2225.9997,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[43] = AddStaticVehicle(509,1913.9386,2227.152,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[44] = AddStaticVehicle(509,1913.9386,2228.3043,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[45] = AddStaticVehicle(509,1913.9386,2229.4566,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[46] = AddStaticVehicle(509,1913.9386,2230.6089,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[47] = AddStaticVehicle(509,1913.9386,2231.7612,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[48] = AddStaticVehicle(509,1913.9386,2232.9135,10.3322,270.0,74,1); // hospLVbike
	OtherVeh[49] = AddStaticVehicle(509,1913.9386,2234.0658,10.3322,270.0,74,1); // hospLVbike

	LSPDcars[0] = AddStaticVehicle(596,1558.8218,-1710.6671,5.6565,0.0,1,1); // начальству
	LSPDcars[1] = AddStaticVehicle(596,1570.4149,-1710.6671,5.6586,0.0,223,1); //
	LSPDcars[2] = AddStaticVehicle(596,1574.4752,-1710.6671,5.6572,0.0,223,1); //
	LSPDcars[3] = AddStaticVehicle(596,1578.6130,-1710.6671,5.6570,0.0,223,1); //
	LSPDcars[4] = AddStaticVehicle(599,1564.6022,-1710.6671,6.0554,0.0,0,1); // RANCHER
	LSPDcars[5] = AddStaticVehicle(596,1583.4127,-1710.6671,5.6557,0.0,223,1); //
	LSPDcars[6] = AddStaticVehicle(596,1587.4375,-1710.6671,5.6543,0.0,223,1); //
	LSPDcars[7] = AddStaticVehicle(596,1591.4255,-1710.6671,5.6539,0.0,223,1); //
	LSPDcars[8] = AddStaticVehicle(596,1595.3914,-1710.6671,5.6545,0.0,223,1); //
	LSPDcars[9] = AddStaticVehicle(528,1528.7931,-1688.0425,5.9343,270.0,1,1); //
	LSPDcars[10] = AddStaticVehicle(528,1528.7931,-1683.9213,5.9339,270.0,1,1); //
	LSPDcars[11] = AddStaticVehicle(427,1538.7955,-1645.1978,6.0225,180.0,0,1); //
	LSPDcars[12] = AddStaticVehicle(427,1534.6354,-1645.1978,6.0225,180.0,0,1); //
	LSPDcars[13] = AddStaticVehicle(427,1530.6385,-1645.1978,6.0226,180.0,0,1); //
	LSPDcars[14] = AddStaticVehicle(497,1558.2627,-1611.4977,13.5595,88.6876,0,1); //верт
	LSPDcars[15] = AddStaticVehicle(596,1545.1931,-1684.5251,5.6115,89.1355,223,1); // lspd car
	LSPDcars[16] = AddStaticVehicle(596,1544.9880,-1680.1925,5.6122,91.2329,223,1); // lspd car
	LSPDcars[17] = AddStaticVehicle(596,1545.0446,-1676.3159,5.6111,87.9955,223,1); // lspd car
	LSPDcars[18] = AddStaticVehicle(596,1545.0046,-1672.0522,5.6106,90.8129,223,1); // lspd car
	LSPDcars[19] = AddStaticVehicle(596,1544.9818,-1667.9825,5.6110,91.1066,223,1); // lspd car
	LSPDcars[20] = AddStaticVehicle(596,1544.9541,-1662.9558,5.6119,89.5593,223,1); // lspd car
	LSPDcars[21] = AddStaticVehicle(596,1544.8456,-1659.0441,5.6110,90.0935,223,1); // lspd car
	LSPDcars[22] = AddStaticVehicle(596,1544.9690,-1655.2334,5.6119,90.2791,223,1); // lspd car
	LSPDcars[23] = AddStaticVehicle(523,1530.1555,-1680.0177,5.4524,270.5510,223,1); // lspd мото
	LSPDcars[24] = AddStaticVehicle(523,1529.8428,-1676.0414,5.4617,269.6563,223,1); // lspd мото
	LSPDcars[25] = AddStaticVehicle(601,1585.6292,-1667.6991,5.6508,270.1084,223,1); // lspd водяной танк
	LSPDcars[26] = AddStaticVehicle(601,1585.6046,-1671.5515,5.6523,268.9081,223,1); // lspd водяной танк
	LSPDweap[0] = CreateDynamicPickup(334,23,219.5150,69.8740,1005.0391,-1,6,-1,50.0);
	LSPDweap[1] = CreateDynamicPickup(348,23,218.0300,80.7121,1005.0391,-1,6,-1,50.0);
	LSPDweap[2] = CreateDynamicPickup(353,23,218.1401,76.1587,1005.0391,-1,6,-1,50.0);

	SFPDcars[0] =	AddStaticVehicle(523,-1639.6364,686.1583,-5.6715,267.7099,223,223); // sfpd мото
	SFPDcars[1] =	AddStaticVehicle(523,-1639.5387,682.1600,-5.6709,273.3316,223,223); // sfpd мото
	SFPDcars[2] =	AddStaticVehicle(427,-1639.2128,665.8414,-5.0820,267.2626,223,1); // sfpd car enforcer
	SFPDcars[3] =	AddStaticVehicle(427,-1639.2144,661.6683,-5.1104,271.4380,223,1); // sfpd car enforcer
	SFPDcars[4] =	AddStaticVehicle(427,-1639.0123,657.5793,-5.0830,269.1387,223,1); // sfpd car enforcer
	SFPDcars[5] =	AddStaticVehicle(528,-1638.5645,653.8429,-5.1986,268.4882,223,223); // sfpd car fbi truck
	SFPDcars[6] =	AddStaticVehicle(528,-1638.5304,649.9525,-5.1988,269.4641,223,223); // sfpd car fbi truck
	SFPDcars[7] =	AddStaticVehicle(601,-1622.5659,649.5421,-5.5889,90.2144,223,223); // sfpd car swat tank
	SFPDcars[8] =	AddStaticVehicle(601,-1622.4468,653.7252,-5.5858,90.4645,223,223); // sfpd car swat tank
	SFPDcars[9] =	AddStaticVehicle(597,-1573.8119,706.0064,-5.4648,88.8591,223,1); // sfpd car начальства
	SFPDcars[10] = AddStaticVehicle(597,-1574.1989,718.1556,-5.4729,88.5271,223,223); // sfpd car
	SFPDcars[11] = AddStaticVehicle(597,-1574.0320,722.5477,-5.4739,90.1211,223,223); // sfpd car
	SFPDcars[12] = AddStaticVehicle(597,-1574.0320,726.6093,-5.4738,91.0088,223,223); // sfpd car
	SFPDcars[13] = AddStaticVehicle(597,-1573.9832,730.4521,-5.4737,89.5830,223,223); // sfpd car
	SFPDcars[14] = AddStaticVehicle(597,-1573.9014,734.6940,-5.4772,91.2855,223,223); // sfpd car
	SFPDcars[15] = AddStaticVehicle(597,-1573.8467,738.7039,-5.4742,90.7550,223,223); // sfpd car
	SFPDcars[16] = AddStaticVehicle(597,-1573.8909,742.7186,-5.5400,90.4740,223,223); // sfpd car
	SFPDcars[17] = AddStaticVehicle(599,-1572.2566,710.2693,-5.0518,88.3701,223,1); // sfpd авто шерифа
	SFPDcars[18] = AddStaticVehicle(497,-1678.9755,705.2334,30.7632,79.8522,223,1); // sfpd верт
	SFPDweap[0] = CreateDynamicPickup(334,23,274.4378,122.2275,1004.6172,-1,10,-1,50.0);
	SFPDweap[1] = CreateDynamicPickup(348,23,273.2901,119.7857,1004.6172,-1,10,-1,50.0);
	SFPDweap[2] = CreateDynamicPickup(353,23,273.3184,117.1537,1004.6172,-1,10,-1,50.0);

	LVPDcars[0] = AddStaticVehicle(598,2317.0342,2429.5928,3.0519,359.8092,223,1); // lvpd car
	LVPDcars[1] = AddStaticVehicle(598,2312.1204,2429.6582,3.0505,0.5267,223,1); // lvpd car
	LVPDcars[2] = AddStaticVehicle(598,2307.6829,2429.6577,3.0499,0.2626,223,1); // lvpd car
	LVPDcars[3] = AddPlayerClass(283,2304.6272,2429.2703,3.2105,359.9828,0,0,0,0,0,0); // lvpd car
	LVPDcars[4] = AddStaticVehicle(598,2303.1599,2429.6895,3.0522,359.9838,223,1); // lvpd car
	LVPDcars[5] = AddStaticVehicle(598,2299.0520,2429.7068,3.0491,0.5137,223,1); // lvpd car
	LVPDcars[6] = AddStaticVehicle(598,2294.5105,2429.6614,2.9258,0.7175,223,1); // lvpd car
	LVPDcars[7] = AddStaticVehicle(598,2290.1262,2429.6719,3.0480,0.1743,223,1); // lvpd car
	LVPDcars[8] = AddStaticVehicle(598,2285.7620,2429.5747,2.9258,358.0751,223,1); // lvpd car
	LVPDcars[9] = AddStaticVehicle(598,2277.2939,2429.5620,3.0184,0.7469,1,1); // lvpd car начальника
	LVPDcars[10] = AddStaticVehicle(598,2272.8840,2429.4412,3.0189,359.0305,223,1); // lvpd car
	LVPDcars[11] = AddStaticVehicle(598,2268.1729,2429.6533,3.0561,1.8897,223,1); // lvpd car
	LVPDcars[12] = AddStaticVehicle(598,2263.9163,2429.6299,2.9258,359.5374,223,1); // lvpd car
	LVPDcars[13] = AddStaticVehicle(598,2259.2896,2429.5247,2.9258,359.2562,223,1); // lvpd car
	LVPDcars[14] = AddStaticVehicle(598,2255.2002,2429.6548,2.9258,0.3109,223,1); // lvpd car
	LVPDcars[15] = AddStaticVehicle(598,2250.5974,2429.8418,2.9260,358.7921,223,1); // lvpd car
	LVPDcars[16] = AddStaticVehicle(598,2246.6812,2429.5444,2.9260,0.0921,223,1); // lvpd car
	LVPDcars[17] = AddStaticVehicle(599,2312.8088,2499.9268,3.4629,89.6175,223,1); // car sherifa
	LVPDcars[18] = AddStaticVehicle(528,2312.5078,2495.1670,3.3167,88.7636,223,1); // car fbi truck
	LVPDcars[19] = AddStaticVehicle(528,2312.6926,2490.1636,3.3156,89.6942,223,1); // car fbi truck
	LVPDcars[20] = AddStaticVehicle(528,2312.7222,2485.3384,3.3168,88.5939,223,1); // car fbi truck
	LVPDcars[21] = AddStaticVehicle(601,2313.3699,2480.4563,3.0322,90.9006,223,1); // car tank
	LVPDcars[22] = AddStaticVehicle(601,2313.3247,2475.5134,3.0322,89.1100,223,1); // car tank
	LVPDcars[23] = AddStaticVehicle(427,2313.4258,2470.2244,3.4052,89.0010,223,1); // enforcer
	LVPDcars[24] = AddStaticVehicle(427,2313.4595,2465.1755,3.4054,90.1731,223,1); // enforcer
	LVPDcars[25] = AddStaticVehicle(427,2313.4958,2460.1045,3.4053,88.8753,223,1); // enforcer
	LVPDcars[26] = AddStaticVehicle(523,2301.1235,2464.5684,2.8438,275.1277,223,1); // moto
	LVPDcars[27] = AddStaticVehicle(523,2301.2437,2460.4409,2.8432,270.5704,223,1); // moto
	LVPDcars[28] = AddStaticVehicle(523,2301.1843,2456.2539,2.8432,272.0820,223,1); // moto
	LVPDcars[29] = AddStaticVehicle(523,2301.0515,2451.7673,2.8444,271.9288,223,1); // moto
	LVPDcars[30] = AddStaticVehicle(497,2311.9729,2448.8567,11.0318,179.7444,223,1); // lvpd maverick
	LVPDweap[0] = CreateDynamicPickup(334,23,260.0479,190.2193,1008.1719,-1,3,-1,50.0);
	LVPDweap[1] = CreateDynamicPickup(348,23,255.8809,190.3423,1008.1719,-1,3,-1,50.0);
	LVPDweap[2] = CreateDynamicPickup(353,23,249.8642,190.2158,1008.1719,-1,3,-1,50.0);

	ArmsWeap[0] = CreateDynamicPickup(348,23,1028.1484,17.8697,957.2468,-1,1,-1,50.0);
	ArmsWeap[1] = CreateDynamicPickup(355,23,1028.1484,19.3666,957.2468,-1,1,-1,50.0);
	ArmsWeap[2] = CreateDynamicPickup(356,23,1028.1484,20.8635,957.2468,-1,1,-1,50.0);
	ArmsWeap[3] = CreateDynamicPickup(1242,23,1029.9061,14.8566,957.2468,-1,1,-1,50.0);

	LSHPcars[0] = AddStaticVehicle(416,1178.0127,-1308.6887,13.9963,268.3060,1,3); // hostpital Ambulance
	LSHPcars[1] = AddStaticVehicle(416,1145.5477,-1300.8557,13.7967,88.9927,1,3); // hostpital Ambulance
	LSHPcars[2] = AddStaticVehicle(416,1145.3713,-1304.2651,13.8027,90.5395,1,3); // hostpital Ambulance
	LSHPcars[3] = AddStaticVehicle(416,1145.2690,-1308.0903,13.8053,93.2164,1,3); // hostpital Ambulance
	LSHPcars[4] = AddStaticVehicle(416,1145.5872,-1313.7085,13.7854,90.0603,1,3); // hostpital Ambulance
	LSHPcars[5] = AddStaticVehicle(487,1098.8010,-1317.4423,13.8908,267.6495,1,3); // hostpital maverick
	LSHPcars[6] = AddStaticVehicle(416,1145.4298,-1297.0781,13.7879,90.0737,1,3); // Ambulance
	LSHPcars[7] = AddStaticVehicle(416,1145.6788,-1292.7578,13.7830,92.8122,1,3); //Ambulance
	LSHPcars[8] = AddStaticVehicle(416,1178.0468,-1338.5050,14.0336,271.0046,1,3); //Ambulance

	SFHPcars[0] = AddStaticVehicle(416,-2589.3369,622.6161,14.6086,268.9371,1,3); // sf hostpital car
	SFHPcars[1] = AddStaticVehicle(416,-2589.3596,627.4071,14.6081,270.1727,1,3); // sf hostpital car
	SFHPcars[2] = AddStaticVehicle(416,-2589.2632,632.3448,14.6025,268.2130,1,3); // sf hostpital car
	SFHPcars[3] = AddStaticVehicle(416,-2589.2964,637.9537,14.6022,271.4056,1,3); // sf hostpital car
	SFHPcars[4] = AddStaticVehicle(416,-2589.3086,647.3909,14.6022,270.0261,1,3); // sf hostpital car
	SFHPcars[5] = AddStaticVehicle(416,-2589.2700,652.6161,14.6024,268.7396,1,3); // sf hostpital car
	SFHPcars[6] = AddStaticVehicle(416,-2589.3125,657.8755,14.6025,269.4978,1,3); // sf hostpital car
	SFHPcars[7] = AddStaticVehicle(416,-2572.2925,657.7382,14.6022,269.5117,1,3); // sf hostpital car
	SFHPcars[8] = AddStaticVehicle(416,-2572.3757,647.5280,14.6022,271.5772,1,3); // sf hostpital car
	SFHPcars[9] = AddStaticVehicle(416,-2572.0623,632.2042,14.6082,269.9979,1,3); // sf hostpital car
	SFHPcars[10] = AddStaticVehicle(416,-2572.2380,627.6974,14.6020,270.0987,1,3); // sf hostpital car
	SFHPcars[11] = AddStaticVehicle(416,-2572.3079,621.7023,14.6027,271.4713,1,3); // sf hostpital car
	SFHPcars[12] = AddStaticVehicle(416,-2545.8345,658.1005,14.6086,93.3862,1,3); // sf hostpital car
	SFHPcars[13] = AddStaticVehicle(416,-2545.6548,652.6831,14.6081,88.9617,1,3); // sf hostpital car
	SFHPcars[14] = AddStaticVehicle(416,-2545.5801,647.5623,14.6084,90.5998,1,3); // sf hostpital car
	SFHPcars[15] = AddStaticVehicle(416,-2545.7585,637.6590,14.6022,90.7905,1,3); // sf hostpital car
	SFHPcars[16] = AddStaticVehicle(416,-2545.6790,632.8705,14.6022,90.8666,1,3); // sf hostpital car
	SFHPcars[17] = AddStaticVehicle(416,-2545.7129,627.3383,14.6026,87.3349,1,3); // sf hostpital car
	SFHPcars[18] = AddStaticVehicle(416,-2545.7754,622.1189,14.6022,86.6555,1,3); // sf hostpital car
	SFHPcars[19] = AddStaticVehicle(416,-2543.5403,610.4106,14.6026,92.1321,1,3); // sf hostpital car
	SFHPcars[20] = AddStaticVehicle(416,-2543.5984,605.1411,14.6018,90.0758,1,3); // sf hostpital car
	SFHPcars[21] = AddStaticVehicle(416,-2543.6975,599.1005,14.6025,89.9664,1,3); // sf hostpital car
	SFHPcars[22] = AddStaticVehicle(416,-2543.4473,593.0317,14.6024,88.2110,1,3); // sf hostpital car
	SFHPcars[23] = AddStaticVehicle(416,-2543.4939,587.0983,14.6025,87.1770,1,3); // sf hostpital car
	SFHPcars[24] = AddStaticVehicle(487,-2566.7397,650.2664,27.9861,182.5390,1,3); // sf hostpital maverick

	LVHPcars[0] = AddStaticVehicle(416,1880.5393,2256.0029,10.9697,180.0,1,3); // car hosp
	LVHPcars[1] = AddStaticVehicle(416,1886.6312,2256.0029,10.9697,180.0,1,3); // car hosp
	LVHPcars[2] = AddStaticVehicle(416,1893.5502,2256.0029,10.9697,180.0,1,3); // car hosp
	LVHPcars[3] = AddStaticVehicle(416,1900.4692,2256.0029,10.9697,180.0,1,3); // car hosp
	LVHPcars[4] = AddStaticVehicle(416,1907.3882,2256.0029,10.9697,180.0,1,3); // car hosp
	LVHPcars[5] = AddStaticVehicle(487,1847.6183,2251.6941,11.0498,266.8943,1,3); // lv hostpital maverick

	LSNcars[0] = AddStaticVehicle(582,1668.4443,-1694.0325,15.6529,89.1352,6,1); //
	LSNcars[1] = AddStaticVehicle(582,1668.4935,-1698.1742,15.7112,89.0937,6,1); //
	LSNcars[2] = AddStaticVehicle(582,1668.5121,-1702.6913,15.6668,89.7970,6,1); //
	LSNcars[3] = AddStaticVehicle(582,1668.5209,-1707.1846,15.6973,90.7573,6,1); //
	LSNcars[4] = AddStaticVehicle(582,1668.5776,-1711.8175,15.6688,90.3506,6,1); //
	LSNcars[5] = AddStaticVehicle(488,1648.6536,-1683.0217,21.5500,178.4491,6,1); // ls news maverick
	LSNcars[6] = AddStaticVehicle(582,1668.5193,-1716.9012,15.6734,90.8382,6,1); //
	LSNcars[7] = AddStaticVehicle(582,1647.8102,-1708.1244,15.6637,270.2103,6,1); //
	LSNcars[8] = AddStaticVehicle(582,1647.9191,-1703.5693,15.6688,269.2673,6,1); //

	SFNcars[0] = AddStaticVehicle(582,-2535.5613,-602.6922,132.6210,180.0,128,1); // sf news car
	SFNcars[1] = AddStaticVehicle(582,-2531.7822,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[2] = AddStaticVehicle(582,-2528.0031,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[3] = AddStaticVehicle(582,-2524.224,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[4] = AddStaticVehicle(582,-2520.4449,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[6] = AddStaticVehicle(582,-2516.6658,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[7] = AddStaticVehicle(582,-2512.8867,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[8] = AddStaticVehicle(582,-2509.1076,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[9] = AddStaticVehicle(582,-2505.3285,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[10] = AddStaticVehicle(582,-2501.5494,-602.6922,132.6210,180.0,128,1); // SNcar
	SFNcars[5] = AddStaticVehicle(488,-2504.2593,-656.3397,139.2583,7.0539,128,1); // sf news maverick

	LVNcars[0] = AddStaticVehicle(582,2096.4973,2349.1770,10.8031,303.8445,211,1); // lv news car
	LVNcars[1] = AddStaticVehicle(582,2103.9036,2352.8591,10.7965,291.3968,211,1); // lv news car
	LVNcars[2] = AddStaticVehicle(582,2111.0283,2355.4893,10.8047,287.7960,211,1); // lv news car
	LVNcars[3] = AddStaticVehicle(582,2147.0364,2355.9111,10.7935,79.2138,211,1); // lv news car
	LVNcars[4] = AddStaticVehicle(582,2159.5593,2352.0020,10.7882,77.3451,211,1); // lv news car
	LVNcars[5] = AddStaticVehicle(488,2070.8398,2337.9087,11.3720,182.0276,211,1); // lv news maverick

	SVcars[0] = AddStaticVehicle(445, 213.0000, 1861.5338, 12.6371, 0.0000, 159, 159);  //Адмирал 1 (для генерала и зама)
	SVcars[1] = AddStaticVehicle(500, 209.0000, 1861.5338, 12.9571, 0.0000, 159, 159); // Меса 1 (для подполковников)
	SVcars[2] = AddStaticVehicle(500, 217.0000, 1861.5338, 12.9771, 0.0000, 159, 159);  //Меса 2 (для подполковников)
	SVcars[3] = AddStaticVehicle(432, 276.5906, 2024.0000, 17.5848, 268.7350, 159, 159);  // Танк 1
	SVcars[4] = AddStaticVehicle(432, 276.5906, 2018.0000, 17.5848, 268.7350, 159, 159);  // Танк 2
	SVcars[5] = AddStaticVehicle(432, 276.5906, 2030.0000, 17.5848, 268.7350, 159, 159);  // Танк 3
	SVcars[6] = AddStaticVehicle(433, 275.1827, 1982.5000, 18.0310, 270.0000, 159, 159);  // Грузовик 1 (для перевозки БП)
	SVcars[7] = AddStaticVehicle(433, 275.1827, 1987.5000, 18.0310, 270.0000, 159, 159);  // Грузовик 2 (для перевозки БП)
	SVcars[8] = AddStaticVehicle(433, 275.1827, 1992.5000, 18.0310, 270.0000, 159, 159);  // Грузовик 3 (для перевозки БП)
	SVcars[9] = AddStaticVehicle(433, 275.1827, 1997.5000, 18.0310, 270.0000, 159, 159);  // Грузовик 4 (для перевозки БП)
	SVcars[10] = AddStaticVehicle(470, 273.1226, 1948.0000, 17.3258, 270.0000, 159, 159);  // Патриот 1
	SVcars[11] = AddStaticVehicle(470, 273.1226, 1952.0000, 17.3258, 270.0000, 159, 159);  // Патриот 2
	SVcars[12] = AddStaticVehicle(470, 273.1226, 1956.0000, 17.3258, 270.0000, 159, 159);  // Патриот 3
	SVcars[13] = AddStaticVehicle(470, 273.1226, 1960.0000, 17.3258, 270.0000, 159, 159);  // Патриот 4
	SVcars[14] = AddStaticVehicle(470, 273.1226, 1964.0000, 17.3258, 270.0000, 159, 159);  // Патриот 5
	SVcars[15] = AddStaticVehicle(548, 239.4000, 2029.0000, 22.2832, 0.0000, 159, 159);  // Вертолёт 1

	VMFcars[0] = AddStaticVehicle(417,-2228.5557,2328.1030,9.4188,182.1368,0,0); // верт вмф
	VMFcars[1] = AddStaticVehicle(446,-2232.5984,2390.6125,-0.1143,41.0665,159,159); // лодка вмф
	VMFcars[2] = AddStaticVehicle(452,-2224.0735,2400.9482,-0.3943,42.4283,159,159); // лодка вмф
	VMFcars[3] = AddStaticVehicle(446,-2213.5078,2411.9573,-0.1621,46.5963,159,159); // лодка вмф
	VMFcars[4] = AddStaticVehicle(452,-2203.5134,2421.0168,-0.3904,46.7819,159,1); // лодка вмф
	VMFcars[5] = AddStaticVehicle(470,-2271.9976,2336.2349,4.9194,270.0,159,159); // Mesa вмф   5,9898
	VMFcars[6] = AddStaticVehicle(470,-2271.9976,2330.2451,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[7] = AddStaticVehicle(470,-2271.9976,2324.2553,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[8] = AddStaticVehicle(470,-2271.9976,2318.2655,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[9] = AddStaticVehicle(470,-2271.9976,2312.2757,4.9194,270.0,159,159); // Mesa вмф == = =  = =
	VMFcars[10] = AddStaticVehicle(500,-2271.9976,2306.2859,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[11] = AddStaticVehicle(500,-2271.9976,2300.2961,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[12] = AddStaticVehicle(500,-2271.9976,2294.3063,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[13] = AddStaticVehicle(500,-2271.9976,2288.3165,4.9194,270.0,159,159); // Mesa вмф
	VMFcars[14] = AddStaticVehicle(445,-2252.6753,2329.814,4.6216,90.0,159,159);
	VMFcars[15] = AddStaticVehicle(445,-2252.6753,2323.5753,4.6216,90.0,159,159);
	VMFcars[16] = AddStaticVehicle(445,-2252.6753,2317.3366,4.6216,90.0,159,159);
	VMFcars[17] = AddStaticVehicle(445,-2252.6753,2311.0979,4.6216,90.0,159,159);
	VMFcars[18] = AddStaticVehicle(445,-2252.6753,2304.8592,4.6216,90.0,159,159);
	VMFcars[19] = AddStaticVehicle(470,-2252.6753,2298.6205,4.6216,90.0,159,159);
	VMFcars[20] = AddStaticVehicle(470,-2252.6753,2292.3818,4.6216,90.0,159,159);
	VMFcars[21] = AddStaticVehicle(470,-2252.6753,2286.1431,4.6216,90.0,159,159);

	VVScars[0] = AddStaticVehicle(469,421.9022,2496.6028,16.6000,90.0000,0,0);// врт в ввс
	VVScars[1] = AddStaticVehicle(487,421.9022,2518.2793,16.6000,90.0000,0,0);// врт в ввс
	VVScars[2] = AddStaticVehicle(520,328.7800,2462.1948,17.1400,0.0000,0,0); // истребитель
	VVScars[3] = AddStaticVehicle(520,362.9392,2462.1948,17.1400,0.0000,0,0); // истребитель
	VVScars[4] = AddStaticVehicle(470,334.0000,2549.3601,16.6400,90.0000,0,0); // хаммер1
	VVScars[5] = AddStaticVehicle(470,334.0000,2553.2000,16.6400,90.0000,0,0); // хаммер1    6,3673
	VVScars[6] = AddStaticVehicle(470,334.0000,2545.2000,16.6400,90.0000,0,0); // хаммер1
	VVScars[7] = AddStaticVehicle(470,334.0000,2541.2000,16.6400,90.0000,0,0); // хаммер1
	VVScars[8] = AddStaticVehicle(470,334.0000,2537.0000,16.6400,90.0000,0,0); // хаммер1
	VVScars[9] = AddStaticVehicle(500,318.9,2553.2,16.7,-90,159,159); // авто ввс MESa1           6,4303
	VVScars[10] = AddStaticVehicle(500,318.9,2537.001,16.7,-90,159,159); // авто ввс MESa
	VVScars[11] = AddStaticVehicle(500,318.9,2541.2,16.7,-90,159,159); // авто ввс MESa
	VVScars[12] = AddStaticVehicle(500,318.9,2545.2,16.7, -90,159,159); // авто ввс MESa
	VVScars[13] = AddStaticVehicle(500,318.9,2549.3601,16.7,-90,159,159); // авто ввс MESa5
	VVScars[14] = AddStaticVehicle(425,384.2000,2606.0000,20.2068,-180.0000,0,0);// апач в ввс

	LicCars[0] = AddStaticVehicle(445,-2093.4951,-83.6610,34.9735,360.0,2,0); //
	LicCars[1] = AddStaticVehicle(445,-2089.5989,-83.6610,34.9738,360.0,2,0); //
	LicCars[2] = AddStaticVehicle(445,-2085.3394,-83.6610,34.9736,360.0,2,0); //
	LicCars[3] = AddStaticVehicle(445,-2081.0735,-83.6610,34.9730,360.0,2,0); //
	LicCars[4] = AddStaticVehicle(445,-2076.9795,-83.6610,34.9733,360.0,2,0); //
	LicCars[5] = AddStaticVehicle(445,-2072.5947,-83.6610,34.9731,360.0,2,0); //
	LicCars[6] = AddStaticVehicle(445,-2068.4595,-83.6610,34.9735,360.0,2,0); //
	LicCars[7] = AddStaticVehicle(445,-2064.2026,-83.6610,34.9724,360.0,2,0); //

	TaxiCars[0] = AddStaticVehicle(420,1283.9342,-1293.9979,13.1958,90.0,128,1); // taxi1 LS
	TaxiCars[1] = AddStaticVehicle(420,1283.9342,-1301.3057,13.2069,90.0,129,1); // taxi2 LS
	TaxiCars[2] = AddStaticVehicle(420,1283.9342,-1315.0272,13.2074,90.0,130,1); // taxi3 LS
	TaxiCars[3] = AddStaticVehicle(420,1283.9342,-1322.2605,13.2081,90.0,140,1); // taxi4 LS
	TaxiCars[4] = AddStaticVehicle(420,1283.9342,-1335.7593,13.2138,90.0,150,1); // taxi5 LS
	TaxiCars[5] = AddStaticVehicle(420,1283.9342,-1342.9838,13.2187,90.0,160,1); // taxi6 LS
	TaxiCars[6] = AddStaticVehicle(420,1283.9342,-1356.4371,13.2062,90.0,170,1); // taxi7 LS
	TaxiCars[7] = AddStaticVehicle(420,1283.9342,-1363.6261,13.1976,90.0,180,1); // taxi8 LS
	TaxiCars[8] = AddStaticVehicle(420,-1926.2408,585.2242,34.8790,180.0,214,0); // taxi1 SF
	TaxiCars[9] = AddStaticVehicle(420,-1929.2754,585.2242,34.8771,180.0,0,0); // taxi2 SF
	TaxiCars[10] = AddStaticVehicle(420,-1932.31,585.2242,34.8771,180.0,228,0); // taxi3 SF
	TaxiCars[11] = AddStaticVehicle(420,-1935.3446,585.2242,34.8771,180.0,223,0); // taxi4 SF
	TaxiCars[12] = AddStaticVehicle(420,-1938.3792,585.2242,34.8771,180.0,222,0); // taxi5 SF
	TaxiCars[13] = AddStaticVehicle(420,-1941.4138,585.2242,34.8771,180.0,221,0); // taxi6 SF
	TaxiCars[14] = AddStaticVehicle(420,-1944.4484,585.2242,34.8771,180.0,111,0); // taxi7 SF
	TaxiCars[15] = AddStaticVehicle(420,-1947.483,585.2242,34.8771,180.0,131,0); // taxi8 SF
	TaxiCars[16] = AddStaticVehicle(420,-1950.5176,585.2242,34.8771,180.0,167,0); // taxi9 SF
	TaxiCars[17] = AddStaticVehicle(420,-1953.5522,585.2242,34.8771,180.0,155,0); // taxi10 SF
	TaxiCars[18] = AddStaticVehicle(420,-1956.5868,585.2242,34.8771,180.0,148,0); // taxi11 SF
	TaxiCars[19] = AddStaticVehicle(420,-1959.6214,585.2242,34.8771,180.0,190,0); // taxi12 SF
	TaxiCars[20] = AddStaticVehicle(420,2805.2288,1326.1759,10.5378,270.0,123,1); // taxi LV
	TaxiCars[21] = AddStaticVehicle(420,2805.2288,1329.3695,10.5378,270.0,112,1); // taxi LV
	TaxiCars[22] = AddStaticVehicle(420,2805.2288,1332.5631,10.5378,270.0,131,1); // taxi LV
	TaxiCars[23] = AddStaticVehicle(420,2805.2288,1335.7567,10.5378,270.0,142,1); // taxi LV
	TaxiCars[24] = AddStaticVehicle(420,2805.2288,1338.9503,10.5378,270.0,153,1); // taxi LV
	TaxiCars[25] = AddStaticVehicle(420,2805.2288,1342.1439,10.5378,270.0,166,1); // taxi LV
	TaxiCars[26] = AddStaticVehicle(420,2805.2288,1345.3375,10.5378,270.0,121,1); // taxi LV
	TaxiCars[27] = AddStaticVehicle(420,2805.2288,1348.5311,10.5378,270.0,77,1); // taxi LV
	TaxiCars[28] = AddStaticVehicle(420,2805.2288,1351.7247,10.5378,270.0,23,1); // taxi LV
	TaxiCars[29] = AddStaticVehicle(420,2805.2288,1354.9183,10.5378,270.0,111,1); // taxi LV
	TaxiCars[30] = AddStaticVehicle(420,2805.2288,1358.1119,10.5378,270.0,22,1); // taxi LV
	TaxiCars[31] = AddStaticVehicle(420,2805.2288,1361.3055,10.5378,270.0,162,1); // taxi LV
	TaxiCars[32] = AddStaticVehicle(420,2805.2288,1364.4991,10.5378,270.0,163,1); // taxi LV
	TaxiCars[33] = AddStaticVehicle(420,2805.2288,1367.6927,10.5378,270.0,168,1); // taxi LV
	for(new i;i<sizeof(TaxiCars);i++) MiniTaxi[i] = CreateDynamicObject(19181, POS_X, POS_Y, POS_Z, 0.0, 0.0, 0.0);

	Bus[0] = AddStaticVehicle(437,1080.8390,-1754.9589,13.5242,270.0,1,3); // автобус ЛС
	Bus[1] = AddStaticVehicle(437,1080.8390,-1760.8560,13.5202,270.0,1,3); // автобус ЛС
	Bus[2] = AddStaticVehicle(437,1080.8390,-1766.7535,13.4974,270.0,1,3); // автобус ЛС
	Bus[3] = AddStaticVehicle(437,1080.8390,-1772.6300,13.4843,270.0,1,3); // автобус ЛС
	Bus[4] = AddStaticVehicle(437,2794.7209,1292.5634,10.8833,180.0,1,0); // автобус ЛВ
	Bus[5] = AddStaticVehicle(437,2766.9846,1265.6293,10.8834,270.0,1,0); // bus LV
	Bus[6] = AddStaticVehicle(437,2788.3413,1292.6698,10.8833,180.0,1,0); // автобус ЛВ
	Bus[7] = AddStaticVehicle(437,2766.9846,1271.9349,10.8834,270.0,1,0); // bus LV
	Bus[8] = AddStaticVehicle(437,2781.9556,1292.4436,10.8833,180.0,1,0); // автобус ЛВ
	Bus[9] = AddStaticVehicle(437,2766.9846,1278.2405,10.8834,270.0,1,0); // bus LV
	Bus[10] = AddStaticVehicle(437,2775.5339,1292.5621,10.8833,180.0,1,0); // автобус ЛВ
	Bus[11] = AddStaticVehicle(437,2766.9846,1284.5461,10.8834,270.0,1,0); // bus LV
	Bus[12] = AddStaticVehicle(437,-1968.2040,81.0,27.8208,89.3462,0,86); // автобус СФ
	Bus[13] = AddStaticVehicle(437,-1968.2040,87.0,27.8206,90.4646,0,86); // автобус СФ
	Bus[14] = AddStaticVehicle(437,-1968.2040,93.0,27.8206,90.4646,0,86); // автобус СФ
	Bus[15] = AddStaticVehicle(437,-1968.2040,99.0,27.8206,90.4646,0,86); // автобус СФ
	Bus[16] = AddStaticVehicle(437,-1968.2040,105.0,27.8206,90.4646,0,86); // автобус СФ
	Bus[17] = AddStaticVehicle(437,1276.5891,-1796.5565,13.5261,90.0,1,3); // bus LS
	Bus[18] = AddStaticVehicle(437,1276.5891,-1801.5565,13.5261,90.0,1,3); // bus LS
	Bus[19] = AddStaticVehicle(437,1276.5891,-1806.5565,13.5261,90.0,1,3); // bus LS
	Bus[20] = AddStaticVehicle(437,1276.5891,-1811.5565,13.5261,90.0,1,3); // bus LS
	Bus[21] = AddStaticVehicle(437,1276.5891,-1816.5565,13.5261,90.0,1,3); // bus LS
	Bus[22] = AddStaticVehicle(437,1276.5891,-1821.5565,13.5261,90.0,1,3); // bus LS
	Bus[23] = AddStaticVehicle(437,1276.5891,-1826.5565,13.5261,90.0,1,3); // bus LS
	for(new i;i<sizeof(Bus);i++) MiniBus[i] = CreateDynamicObject(19177, POS_X, POS_Y, POS_Z, 0.0, 0.0, 0.0);
	for(new i;i<MAX_VEHICLES;i++) if(!IsBike(i)) Fuel[i] = 100.0;
	return true;
}

public OnGameModeExit()
{
	saveall();
	new tmp[64];
	format(query1,sizeof(query1),"");
	format(tmp,sizeof(tmp),"UPDATE `recordonline` SET `Date` = '%s',", R[Date]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`Time` = '%s',", R[Time]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`Players` = '%d' ", R[Players]);
	strcat(query1, tmp);
	strcat(query1,"WHERE `ID` = '1'");
	mysql_query(mysql1, query1, false);
	mysql_query(mysql1, "UPDATE `users` SET `Online` = '0'", false);
	printf("MySQL: отключение от %s",SQL_HOST);
	mysql_close(mysql1);
	return true;
}

public OnPlayerRequestClass(playerid, classid)
{
	if(GetPVarInt(playerid, "Logged") == 0) return false;
	if(GetPVarInt(playerid, "Register") == 1)
	{
	    spawnPlayer(playerid);
		SetPlayerCameraPos(playerid, 204.3684,-163.2691,1000.5234);
		SetPlayerCameraLookAt(playerid, 204.3667,-159.6693,1000.5234);
		SetPlayerInterior(playerid, 14);
		ShowPlayerDialog(playerid, D_SEX, DIALOG_STYLE_MSGBOX, "{FFFFFF}Выбор пола", "{FFFFFF}Укажи свой пол", "Мужчина", "Женщина");
	} else {
	    spawnPlayer(playerid);
	}
	return true;
}

public OnPlayerConnect(playerid)
{
	SetPlayerColor(playerid, COLOR_SYSTEM);
	ClearAccount(playerid);
	TogglePlayerAllDynamicRaceCPs(playerid, false);
	TogglePlayerAllDynamicCPs(playerid, false);
    for(new i;i<100;i++) SendClientMessage(playerid, 0, "");
	SendClientMessage(playerid, 0xFFD280FF, "Добро пожаловать на игровой сервер Georgia Role Play!");
	SendClientMessage(playerid, 0xFFD280FF, "Сайт сервера {FFB120}georgia-game.ru");
	SendClientMessage(playerid, 0xFFD280FF, "Группа ВКонтакте {FFB120}vk.com/georgiagame");
	SendClientMessage(playerid, 0xFFD280FF, "Администрация сервера желает Вам приятной игры!");
	RemoveBuildingForPlayer(playerid, 8229, 1136.2141,1361.9269,10.8203, 3.0);
	RemoveBuildingForPlayer(playerid, 8229, 1136.2141,1361.9269,10.8203, 3.0);
	RemoveBuildingForPlayer(playerid, 3113, 0.0, 0.0, 0.0, 3000.0);
	RemoveBuildingForPlayer(playerid, 3114, 0.0, 0.0, 0.0, 3000.0);
	RemoveBuildingForPlayer(playerid, 3115, 0.0, 0.0, 0.0, 3000.0);
	RemoveBuildingForPlayer(playerid, 1411, 347.1953, 1799.2656, 18.7578, 0.25);
	RemoveBuildingForPlayer(playerid, 1411, 342.9375, 1796.2891, 18.7578, 0.25);
	RemoveBuildingForPlayer(playerid, 16602, 307.9531, 2543.4531, 20.3984, 0.25);
	RemoveBuildingForPlayer(playerid, 16098, 307.9531, 2543.4531, 20.3984, 0.25);
	RemoveBuildingForPlayer(playerid, 3345, 400.1172, 2543.5703, 15.4844, 0.25);
	RemoveBuildingForPlayer(playerid, 3368, 311.1328, 2614.6172, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3368, 338.0078, 2587.7422, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3368, 323.0078, 2411.3828, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3369, 349.8750, 2438.2500, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3367, 284.2656, 2587.7422, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3367, 296.1406, 2438.2500, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 16596, 412.8281, 2542.8672, 15.5391, 0.25);
	RemoveBuildingForPlayer(playerid, 3295, 392.7109, 2596.4531, 17.6328, 0.25);
	RemoveBuildingForPlayer(playerid, 3296, 376.2969, 2606.3438, 20.1719, 0.25);
	RemoveBuildingForPlayer(playerid, 3295, 390.8203, 2604.0703, 20.0234, 0.25);
	RemoveBuildingForPlayer(playerid, 3295, 389.1328, 2611.0625, 20.1719, 0.25);
	RemoveBuildingForPlayer(playerid, 3295, 382.1875, 2609.4766, 19.8203, 0.25);
	RemoveBuildingForPlayer(playerid, 3271, 296.1406, 2438.2500, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3271, 284.2656, 2587.7422, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3270, 323.0078, 2411.3828, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 16101, 321.6719, 2463.4922, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 16368, 321.6719, 2463.4922, 25.6641, 0.25);
	RemoveBuildingForPlayer(playerid, 3269, 349.8750, 2438.2500, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 316.3672, 2531.6094, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 316.1641, 2534.6484, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 316.2656, 2533.0781, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1308, 316.3984, 2570.3672, 15.3047, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 316.3516, 2545.1406, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 315.5625, 2551.6250, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 315.6641, 2550.0625, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1308, 361.3750, 2571.8125, 15.4063, 0.25);
	RemoveBuildingForPlayer(playerid, 3270, 338.0078, 2587.7422, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3270, 311.1328, 2614.6172, 15.4766, 0.25);
	RemoveBuildingForPlayer(playerid, 3287, 376.2969, 2606.3438, 20.1719, 0.25);
	RemoveBuildingForPlayer(playerid, 3286, 382.1875, 2609.4766, 19.8203, 0.25);
	RemoveBuildingForPlayer(playerid, 16375, 387.6016, 2525.5469, 15.6641, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 410.8281, 2528.5703, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 409.8047, 2529.6328, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 408.7188, 2530.7656, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 407.1563, 2530.4688, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 3172, 400.1172, 2543.5703, 15.4844, 0.25);
	RemoveBuildingForPlayer(playerid, 1224, 407.8828, 2532.0078, 16.1563, 0.25);
	RemoveBuildingForPlayer(playerid, 1308, 405.3594, 2563.0859, 15.6250, 0.25);
	RemoveBuildingForPlayer(playerid, 16370, 385.3438, 2598.6250, 17.0156, 0.25);
	RemoveBuildingForPlayer(playerid, 3286, 390.8203, 2604.0703, 20.0234, 0.25);
	RemoveBuildingForPlayer(playerid, 3286, 392.7109, 2596.4531, 17.6328, 0.25);
	RemoveBuildingForPlayer(playerid, 3286, 389.1328, 2611.0625, 20.1719, 0.25);
	RemoveBuildingForPlayer(playerid, 16327, 412.8281, 2542.8672, 15.5391, 0.25);
	RemoveBuildingForPlayer(playerid, 16374, 425.4688, 2531.0000, 22.5547, 0.25);
	RemoveBuildingForPlayer(playerid, 16790, 425.4688, 2531.0000, 22.5547, 0.25);
	RemoveBuildingForPlayer(playerid, 14602, 376.53125, 173.75781, 1012.75, 0);
    SetPlayerTime(playerid, glhour, glmins);
	GetPlayerIp(playerid, PI[playerid][IP], 16);
	new tmpname[24];
	GetPlayerName(playerid, tmpname, sizeof(tmpname));
	for(new i; tmpname[i] != EOS; i++) if(tmpname[i] < 0 ) tmpname[i] += 256;
	format(PI[playerid][Nick], 24, tmpname);
	SetTimerEx("LoginCamera", 100, false, "d", playerid);
	if(IsRPNick(Name(playerid)))
	{
		firstJoin(playerid);
	} else {
 		ShowPlayerDialog(playerid, D_NONRPNICK, DIALOG_STYLE_INPUT, "{FFFFFF}Неподходящий ник", "{FFFFFF}На нашем сервере необходимо использовать ник в формате {FF0000}Имя_Фамилия {FFFFFF}\nВведи новый ник, чтобы играть на нашем сервере:", "Изменить", "");
	}
	return true;
}

public OnPlayerDisconnect(playerid, reason)
{
	if(GetPVarInt(playerid, "Logged") == 0) return false;
	SaveAccount(playerid);
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(GetPVarInt(i, "SpecID") == playerid) specOff(i);
	}
	if(GetPVarInt(playerid, "InCarShop")) ExitPlayerCarShop(playerid);
	if(GetPVarInt(playerid, "InSkinShop")) ExitPlayerSkinShop(playerid);
	mysql_format(mysql1, query1,sizeof(query1),"UPDATE `users` SET `Online` = '0' WHERE `Nick` = '%s'", Name(playerid));
	mysql_query(mysql1, query1, false);
	DestroyPlayerTD(playerid);
	EndJob(playerid);
	Bed[GetPVarInt(playerid, "Bed")] = false;
	if(AdminCarCount[playerid] != 0)
	{
		for(new i;i<AdminCarCount[playerid];i++)
		{
			DestroyVehicle(AdminCarID[playerid][i]);
		}
		AdminCarCount[playerid] = 0;
	}
	if(CP_112[playerid]) DestroyDynamicCP(CP_112[playerid]); 
	if(PI[playerid][House] != 0 || PIcar[playerid][CarID] != 0 || PI[playerid][Renter] == 0) DestroyPlayerCar(playerid);
	return true;
}

public OnPlayerSpawn(playerid)
{
    if(GetPVarInt(playerid, "Logged") == 0) return false;
    if(PI[playerid][Faction] == 0)
    {
		SetPlayerSkin(playerid, PI[playerid][Skin]);
	} else {
		SetPlayerSkin(playerid, PI[playerid][fSkin]);
	}
	if(PIpen[playerid][JailTime] > 0)
	{
		SetPVarInt(playerid, "InHouse", 0);
	    new rand = random(sizeof(jailspawn));
		SetPlayerPos(playerid,  jailspawn[rand][0], jailspawn[rand][1], jailspawn[rand][2]);
		SetPlayerInterior(playerid, 10);
		setPlayerHealth(playerid, 100.0);
	}
	else if(PIpen[playerid][Cheater] == 1)
	{
		SetPlayerPos(playerid,  2489.0308,-1669.8937,13.3359);
		SetPlayerInterior(playerid, 0);
		SetPlayerVirtualWorld(playerid, 666777);
	}
	else if(GetPVarInt(playerid, "Dead") == 1)
	{
		SetPVarInt(playerid, "InHouse", 0);
		SetPlayerInterior(playerid, 3);
		SetPlayerVirtualWorld(playerid, PI[playerid][sZone]);
		setPlayerHealth(playerid, 5.0);
	    switch(random(1)+2)
	    {
	        case 1: SetPlayerPos(playerid,144.7120,-113.2619,845.2156);
	        case 2: SetPlayerPos(playerid,155.2437,-113.4005,845.2078);
	        case 3: SetPlayerPos(playerid,166.3891,-113.4146,845.2078);
	    }
		TogglePlayerDynamicCP(playerid, HealCP[1], true);
	} else {
		setPlayerHealth(playerid, PI[playerid][Health]);
	}
	return true;
}

public OnPlayerClickTextDraw(playerid, Text:clickedid)
{
	if(_:clickedid == INVALID_TEXT_DRAW) return CallLocalFunction("OnPlayerClickPlayerTextDraw", "dd", playerid, INVALID_TEXT_DRAW);
	return true;
}

public OnPlayerClickPlayerTextDraw(playerid, PlayerText:playertextid)
{
	if(_:playertextid == INVALID_TEXT_DRAW && GetPVarInt(playerid, "InCarShop") == 1) ExitPlayerCarShop(playerid);
	else if(_:playertextid == INVALID_TEXT_DRAW && GetPVarInt(playerid, "InSkinShop") == 1) ExitPlayerSkinShop(playerid);
	else if(_:playertextid == INVALID_TEXT_DRAW && GetPVarInt(playerid, "InSelfie") == 1) OutSelfie(playerid);
	else if(_:playertextid == INVALID_TEXT_DRAW && GetPVarInt(playerid, "Register") == 1) return SelectTextDraw(playerid, 0xFFFFFF80);
	else if(_:playertextid == INVALID_TEXT_DRAW && GetPVarInt(playerid, "MenuBoxMode") != 0) SelectTextDraw(playerid, 0xFFFFFF50);
	else if(playertextid == BuyCar[playerid])
	{
		if(PIcar[playerid][CarID] != 0) return ShowPlayerDialog(playerid, D_SELLCAR, DIALOG_STYLE_MSGBOX, "{FFFFFF}Продажа", "{FFFF00}Чтобы купить новый транспорт, тебе нужно продать старый\nПродав его, ты получишь 50% стоимости. Продолжить?", "Да", "Нет");
	    format(glstr,sizeof(glstr),"{FFFF00}Купить {FF0000}%s{FFFF00}, стоимостью {FF0000}%d${FFFF00}?\nЧтобы купить этот транспорт, тебе необходим {FF0000}%d {FFFF00}уровень.", vName[CarsForShop[NowCarShop[playerid]][0]-400], CarsForShop[NowCarShop[playerid]][1], CarsForShop[NowCarShop[playerid]][2]);
	    ShowPlayerDialog(playerid, D_BUYCAR, DIALOG_STYLE_MSGBOX, "{FFFFFF}Покупка автомобиля", glstr, "Да", "Нет");
	}
	else if(playertextid == SellCar[playerid])
	{
		if(PIcar[playerid][CarID] == 0) 
		{
			ShowPlayerDialog(playerid, D_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Продажа", "{FFFF00}У тебя нет транспорта", "ОК", "");
		} else {
			ShowPlayerDialog(playerid, D_SELLCAR, DIALOG_STYLE_MSGBOX, "{FFFFFF}Продажа", "{FFFF00}Чтобы купить новый транспорт, тебе нужно продать старый\nПродав его, ты получишь 50% стоимости. Продолжить?", "Да", "Нет");
		}
	}
	else if(playertextid == PrevCar[playerid]) PrevCarShop(playerid);
	else if(playertextid == NextCar[playerid]) NextCarShop(playerid);
	else if(playertextid == AngleCarLeft[playerid])
	{
		ShopCarAngle[playerid] -= 20.0;
		if(ShopCarAngle[playerid] <= 0) ShopCarAngle[playerid] = 360;
		SetVehicleZAngle(ShopCar[playerid], ShopCarAngle[playerid]);
	}
	else if(playertextid == AngleCarRight[playerid])
	{
		ShopCarAngle[playerid] += 20.0;
		if(ShopCarAngle[playerid] >= 360) ShopCarAngle[playerid] = 0;
		SetVehicleZAngle(ShopCar[playerid], ShopCarAngle[playerid]);
	}
	else if(playertextid == SkinRegEnter[playerid])
	{
		if(GetPVarInt(playerid, "Register") == 1)
	    {
			PI[playerid][Level] = 1;
			SetPlayerInterior(playerid, 0);
			SetPVarInt(playerid, "Register", 0);
			PI[playerid][Skin] = SkinsForReg[NowSkinReg[playerid]][PI[playerid][Sex]];
			spawnPlayer(playerid);
			SetPlayerSkin(playerid, PI[playerid][Skin]);
			SetPlayerCameraPos(playerid, 388.0546,-1532.6357,32.2734);
			SetPlayerCameraLookAt(playerid, 325.4841,-1523.0325,56.9564);
			SetPlayerFactionColor(playerid);
			SetPVarInt(playerid, "History", 1);
			if(PI[playerid][Sex] == 1)
			{
				ShowPlayerDialog(playerid, D_HISTORY, DIALOG_STYLE_MSGBOX, "{FFFFFF}Предыстория", "{FFFF00}Когда-то ты был успешным адвокатом, любящим мужем и заботливым отцом. Однажды ты\n изменил своей жене и она от тебя ушла, забрав детей. После этого ты начал пить. \nКогда денег стало не хватать, ты продал свой дом и поселился в отеле. Вскоре тебе стало \nне хватать денег на комнату в отеле и тебя выселили...", "Понятно", "");
			} else {
			    ShowPlayerDialog(playerid, D_HISTORY, DIALOG_STYLE_MSGBOX, "{FFFFFF}Предыстория", "{FFFF00}Когда-то ты была успешным адвокатом, любящей женой и заботливой матерью. Однажды ты\n изменила своему мужу и он от тебя ушёл, забрав детей. После этого ты начала пить. \nКогда денег стало не хватать, ты продала свой дом и поселилась в отеле. Вскоре тебе стало \nне хватать денег на комнату в отеле и тебя выселили...", "Понятно", "");
			}
			CancelSelectTextDraw(playerid);
			PlayerTextDrawHide(playerid, SkinRegNext[playerid]);
			PlayerTextDrawHide(playerid, SkinRegPrev[playerid]);
			PlayerTextDrawHide(playerid, SkinRegEnter[playerid]);
	    }
	}
	else if(playertextid == SkinShopNext[playerid]) NextSkinShop(playerid);
	else if(playertextid == SkinRegNext[playerid]) NextSkinReg(playerid);
	else if(playertextid == SkinShopPrev[playerid]) PrevSkinShop(playerid);
	else if(playertextid == SkinRegPrev[playerid]) PrevSkinReg(playerid);
	else if(playertextid == SkinShopBuy[playerid])
	{
		if(PI[playerid][Money] < SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]+2]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе не хватает денег");
		CancelSelectTextDraw(playerid);
		removePlayerMoney(playerid, SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]+2]);
		PI[playerid][Skin] = SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]];
		if(PI[playerid][Faction] == 0) SetPlayerSkin(playerid, PI[playerid][Skin]);
		ExitPlayerSkinShop(playerid);
	}

	else if(playertextid == S_RIGHT[playerid]) 
	{
		if(S_Angle[playerid] <= 0) 
		{
			S_Angle[playerid] = 350.0;
		} else {
			S_Angle[playerid] -= 10.0;
		}
		InSelfie(playerid, S_Angle[playerid]);
	}	
	else if(playertextid == S_LEFT[playerid]) 
	{
		if(S_Angle[playerid] >= 359)
		{
			S_Angle[playerid] = 10.0;
		} else {
			S_Angle[playerid] += 10.0;
		}
		InSelfie(playerid, S_Angle[playerid]);
	}
	else if(playertextid == S_UP[playerid])
	{
		if(S_Height[playerid] >= 0.9) 
		{
			S_Height[playerid] = 0.65;
		} else {
			S_Height[playerid] += 0.05;
		}
		InSelfie(playerid, S_Angle[playerid]);
	}
	else if(playertextid == S_DOWN[playerid])
	{
		if(S_Height[playerid] <= 0.65) 
		{
			S_Height[playerid] = 0.9;
		} else {
			S_Height[playerid] -= 0.05;
		}
		InSelfie(playerid, S_Angle[playerid]);
	}
	else if(playertextid == S_BACK[playerid]) 
	{
		OutSelfie(playerid);
		ShowMenu(playerid, DM_PHONE);
	}
	if(GetPVarInt(playerid, "MenuBoxMode") != 0)
	{
		for(new i;i<sizeof(MenuButton);i++)
		{
			if(playertextid != MenuButton[playerid][i]) continue;
			new plid = GetPVarInt(playerid, "ClickedPlayer");
			switch(GetPVarInt(playerid, "MenuBoxMode"))
			{
				case 1:
				{
					if(i == 0)
					{
						SetPVarInt(playerid, "MenuBoxMode", 0);
						HideBoxMenu(playerid);
						ShowMenu(playerid, P_MENU_FACTION);
					} else {
						if(PI[plid][Faction] != 0)
						{
							PI[plid][fSkin] = MenuButtonModel[playerid][i];
							SetPlayerSkin(plid, PI[plid][fSkin]);
						} else {
							PI[plid][Skin] = MenuButtonModel[playerid][i];
							SetPlayerSkin(plid, PI[plid][Skin]);
						}
					}
				}
				case 2:
				{
					if(i != 0)
					{
						PI[playerid][PhoneObject] = MenuButtonModel[playerid][i];
						removePlayerMoney(playerid, 100);
						SendClientMessage(playerid, 0x00FF00FF, "Ты купил новый корпус для своего телефона за 100$");
					}
					SetPVarInt(playerid, "MenuBoxMode", 0);
					HideBoxMenu(playerid);
					ShowMenu(playerid, D_247);
				}
			}
		}
	}
 	return true;
}

public OnPlayerDeath(playerid, killerid, reason)
{
	SetPVarInt(playerid, "Dead", 1);
	//setPlayerHealth(playerid, 0.0);
	setPlayerArmour(playerid, 0.0);
	SetPVarInt(playerid, "InHouse", 0);
	if(killerid != INVALID_PLAYER_ID)
	{
		format(glstr,sizeof(glstr),"Убит игроком %s [%d]", Name(killerid), killerid);
		AddPlayerEvent(playerid, glstr);
		SetPlayerChatBubble(playerid, glstr, 0xFF0000FF, 50.0, 5000);
		format(glstr,sizeof(glstr),"Убил игрока %s [%d]", Name(playerid), playerid);
		AddPlayerEvent(killerid, glstr);
		if(PI[killerid][Law] > 0) LawPlayer(killerid, 1);
	}
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || !PlayerInRadius(i, playerid, 50.0) && !PI[i][ShowKills]) continue;
		SendDeathMessageToPlayer(i, killerid, playerid, reason);
	}
	if(PI[playerid][Wanted] > 0)
	{
		if(PI[killerid][Faction] == 4 || PI[killerid][Faction] == 5 || PI[killerid][Faction] == 6)
		{
			PIpen[playerid][JailTime] = 300*PI[playerid][Wanted];
			setPlayerWantedLevel(playerid, 0);
			format(glstr,sizeof(glstr),"%s ликвидировал %s", Name(killerid), Name(playerid));
			SetPVarInt(playerid, "HandBlock", 0);
			RemovePlayerAttachedObject(playerid,0);
			Do(killerid, glstr);
		}
	}
	return true;
}

public OnVehicleSpawn(vehicleid)
{
	if(!VehOfPlayer[vehicleid])
	{
		Engine[vehicleid] = false;
		CarLocked[vehicleid] = false;
		Fuel[vehicleid] = 100.0;
	}
	return true;
}

public OnVehicleDeath(vehicleid, killerid)
{
	SetTimerEx("RespawnVehicle", 3000, false, "d", vehicleid);
	return true;
}

public OnPlayerText(playerid, text[])
{
	if(GetPVarInt(playerid, "Logged") == 0) return false;
	if(strlen(text) > 100) strdel(text, 100, strlen(text));
	if(text[0] == '.')
	{
		text[0] = '/';
		OnPlayerCommandText(playerid, text);
		return false;
	}
	if(PIpen[playerid][MuteTime] > 0)
	{
		format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
		SendClientMessage(playerid, 0xFF0000FF, glstr);
	}
	else if(allflood >= 30 || flood[playerid])
	{
		SendClientMessage(playerid, COLOR_SYSTEM, "Подожди немного");
		if(allflood < 30) allflood++;
	}
	else
	{
		flood[playerid] = true;
		if(CheckPR(text))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, text);
			SendAdminMessage(100, glstr, playerid);
			SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
			return false;
		}
		else if(GetPVarInt(playerid, "InSpec") == 1)
		{
			SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь");
			return false;
		}
		new msg[70];
		sscanf(text, "s[70]", msg);
		ReplaceID(msg);
		if(emptyMessage(text))
		{
			SendClientMessage(playerid, COLOR_SYSTEM, "Ты ничего не ввёл");
		}
		else if(strlen(text) > 70)
		{
			SendClientMessage(playerid, COLOR_SYSTEM, "Укороти сообщение");
		}
		else if(text[0] == '*')
		{
			SayOOC(playerid, msg[1]);
			return false;
		}
		else if(text[0] == '!' && text[1] == '*')
		{
			format(glstr,sizeof(glstr),"/rb %s", msg[2]);
			OnPlayerCommandText(playerid, glstr);
			return false;
		}
		else if(text[0] == '!' && text[1] == '!' && text[2] == '*')
		{
			format(glstr,sizeof(glstr),"/arb %s", msg[3]);
			OnPlayerCommandText(playerid, glstr);
			return false;
		}
		else if(text[0] == '!' && text[1] == '!')
		{
			format(glstr,sizeof(glstr),"/ar %s", msg[2]);
			OnPlayerCommandText(playerid, glstr);
			return false;
		}
		else if(text[0] == '!')
		{
			format(glstr,sizeof(glstr),"/r %s", msg[1]);
			OnPlayerCommandText(playerid, glstr);
			return false;
		}
		else if(text[0] == ')' && text[1] == ')' && text[2] == ')' && strlen(text) == 3)
		{
			format(glstr,sizeof(glstr),"%s падает от смеха", Name(playerid));
			Do(playerid, glstr);
			return false;
		}
		else if(text[0] == ')' && text[1] == ')' && strlen(text) == 2)
		{
			format(glstr,sizeof(glstr),"%s смеётся", Name(playerid));
			Do(playerid, glstr);
			return false;
		}
		else if(text[0] == ')' && strlen(text) == 1)
		{
			format(glstr,sizeof(glstr),"%s улыбается", Name(playerid));
			Do(playerid, glstr);
			return false;
		}
		else if(text[0] == '(' && text[1] == '(' && text[2] == '(' && strlen(text) == 3)
		{
			format(glstr,sizeof(glstr),"%s расстроен", Name(playerid));
			Do(playerid, glstr);
			return false;
		}
		else if(text[0] == '(' && text[1] == '(' && strlen(text) == 2)
		{
			format(glstr,sizeof(glstr),"%s очень недоволен", Name(playerid));
			Do(playerid, glstr);
			return false;
		}
		else if(text[0] == '(' && strlen(text) == 1)
		{
			format(glstr,sizeof(glstr),"%s недоволен", Name(playerid));
			Do(playerid, glstr);
			return false;
		} else {
			if(globalchat)
			{
				new s[144];
				format(s,sizeof(s),"(( %s [%d]: %s {FFFFFF}))", Name(playerid), playerid, colorStr(msg));
				SendClientMessageToAll(-1, s);
				chatlog(playerid, msg, 9);
			}
			else if(GetPVarInt(GetPVarInt(playerid, "InCall"), "InCall") == playerid && GetPVarInt(playerid, "Calling") == 2)
			{
				format(glstr,sizeof(glstr),"{00FF00}Телефон {FF8000}от %s [%d]: %s", Name(playerid), PI[playerid][PhoneNumber], msg);
				SendClientMessage(GetPVarInt(playerid, "InCall"), -1, glstr);
				format(glstr,sizeof(glstr),"{00FF00}Телефон {FFBB77}для %s [%d]: %s", Name(GetPVarInt(playerid, "InCall")), PI[GetPVarInt(playerid, "InCall")][PhoneNumber], msg);
				SendClientMessage(playerid, -1, glstr);
				for(new i;i<PLAYERS;i++)
				{
					if(!InGame(i) || i == playerid || i == GetPVarInt(playerid, "InCall")) continue;
					if(PlayerInRadius(playerid, i, 10.0))
					{
						format(glstr,sizeof(glstr),"%s (телефон): %s", Name(playerid), msg);
						SendClientMessage(i, 0xFFFFFFFF, glstr);
					} else {
						if(GetPVarInt(i, "ShowIC") == 0) continue;
						format(glstr,sizeof(glstr),"[Телефон] %s [%d] игроку %s [%d]: %s", Name(playerid),playerid,Name(GetPVarInt(playerid, "InCall")),GetPVarInt(playerid, "InCall"),msg);
						SendClientMessage(i, 0x417B1CFF, glstr);
						continue;
					}
				}
				chatlog(playerid, msg, 8);
			} else {
				if(!strcmp(msg, ":D", true))
				{
					format(glstr,sizeof(glstr),"%s валяется от смеха", Name(playerid));
					Do(playerid, glstr);
				}
				else if(!strcmp(msg, "xD", true) || !strcmp(msg, "хД", true))
				{
					format(glstr,sizeof(glstr),"%s хохочет", Name(playerid));
					Do(playerid, glstr);
				}
				else if(!strcmp(msg, "хочу инфернус", true))
				{
					if(PI[playerid][Admin] >= 700)
					{
						OnPlayerCommandText(playerid, "/м 411");
					} else {
						SendClientMessage(playerid, 0xFF0000FF, "Хоти :-)");
					}
				} else {
					if(GetPVarInt(playerid, "iViewing") == 3)
					{
						format(glstr, sizeof(glstr), "[%s] Интервьювер %s: %s", fName[PI[playerid][Faction]], Name(playerid), msg);
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i) || GetPVarInt(i, "NowRadio") == 0) continue;
							else if(GetPVarInt(i, "NowRadio") == PI[playerid][Faction]-6)
							{
								SendClientMessage(i, 0x00FF00FF, glstr);
							}
						}
					}
					else if(GetPVarInt(playerid, "iViewing") == 2)
					{
						format(glstr, sizeof(glstr), "[%s] Респондент %s: %s", fName[PI[GetPVarInt(playerid, "iViewer")][Faction]], Name(playerid), msg);
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i) || GetPVarInt(i, "NowRadio") == 0) continue;
							else if(GetPVarInt(i, "NowRadio") == PI[GetPVarInt(playerid, "iViewer")][Faction]-6)
							{
								SendClientMessage(i, 0x00FF00FF, glstr);
							}
						}
					}
					else if(GetPVarInt(playerid, "InReportage") == 1)
					{
						format(glstr, sizeof(glstr), "[%s] Репортёр %s: %s", fName[PI[playerid][Faction]], Name(playerid), msg);
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i) || GetPVarInt(i, "NowRadio") == 0) continue;
							else if(GetPVarInt(i, "NowRadio") == PI[GetPVarInt(playerid, "iViewer")][Faction]-6)
							{
								SendClientMessage(i, 0x00FF00FF, glstr);
							}
						}
					} else {
						Say(playerid, msg);
					}
				}
			}
		}
	}
	return false;
}

public OnPlayerCommandText(playerid, cmdtext[])
{
	if(GetPVarInt(playerid, "Logged") == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Сначала нужно залогиниться");
	if(PIpen[playerid][Cheater] == 1 && PI[playerid][Admin] < 2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать команды");
	new cmd[20], params[96];
	sscanf(cmdtext, "s[20]s[96]", cmd, params);
	if(!strcmp(cmd, "/от", true))
	{
		if(PI[playerid][Admin] < 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/от [ID] [текст]");
		else if(strlen(params) > 70) return SendClientMessage(playerid, COLOR_SYSTEM, "Длинное сообщение");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new plid, msg[70];
		sscanf(params, "ds[70]", plid, msg);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(playerid == plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты вписал свой ID");
		if(emptyMessage(msg)) return SendClientMessage(playerid, COLOR_SYSTEM, "Напиши текст");
		format(glstr, sizeof(glstr), "Ответ от {00FF00}%s [%d]{FF8000}: %s", Name(playerid), playerid, msg);
		SendClientMessage(plid, 0xFF8000FF, glstr);
		format(glstr, sizeof(glstr), "Ответ игроку {00FF00}%s [%d]{FFC891}: %s", Name(plid), plid, msg);
		SendClientMessage(playerid, 0xFFC891FF, glstr);
		format(glstr, sizeof(glstr), "{808080}Ответ от %s [%d] игроку %s [%d]: %s", Name(playerid), playerid, Name(plid), plid, msg);
		SendAdminMessage(10, glstr, playerid);
		format(glstr, sizeof(glstr), "Ответ от %s [%d] игроку %s [%d]: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], msg);
		alog(glstr, 3);
	    return true;
	}
	if(PIpen[playerid][MuteCMD] > 0 && !IsPlayerAdmin(playerid))
	{
		format(glstr,sizeof(glstr),"Тебе запрещено использовать меню и команды, осталось %s", MTF(PIpen[playerid][MuteCMD]));
		return SendClientMessage(playerid, 0xFF0000FF,glstr);
	}
	if(!strcmp(cmd, "/рестарт", true))
	{
		if(PI[playerid][Admin] < 2000 && playerid != MAX_PLAYERS) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		printf("%s [%d] IP: %s запустил рестарт",Name(playerid),PI[playerid][ID],PI[playerid][IP]);
		mysql_query(mysql1, "UPDATE  `users` SET  `Online` =  '0'", false);
		if(emptyMessage(params))
		{
			SendClientMessage(playerid, COLOR_SYSTEM, "Перезапуск сервера без новостей");
		} else {
			new opt;
			sscanf(params, "d", opt);
			switch(opt)
			{
				case 1: 
				{
					mysql_query(mysql1, "UPDATE  `users` SET  `ReadNews` =  '10'", false);
					mysql_query(mysql1, "UPDATE  `news` SET  `Type` =  '0' WHERE `Type` = '3'", false);
				}
			}
		}
		Restart();
		return true;
	}

	else if(!strcmp(cmd, "/сохракк", true))
	{
		if(PI[playerid][Admin] < 2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		SendClientMessage(playerid, COLOR_ERROR, "Запущено сохранение аккаунтов");
		saveall();
		SendClientMessage(playerid, COLOR_SUCCESS, "Сохранение аккаунтов завершено");
		return true;
	}

	else if(!strcmp(cmd, "/загрнов", true))
	{
		if(PI[playerid][Admin] < 2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		LoadNews();
		SendClientMessage(playerid, COLOR_SUCCESS, "Новости загружены");
		return true;
	}

	else if(!strcmp(cmd, "/уровень", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/уровень [ID] [кол-во] [действие]");
		new level, opt, plid, exp;
		sscanf(params, "dddd", plid, level, opt, exp);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(level > 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Слишком большой уровень");
		else if(level < 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Слишком маленький уровень");
		switch(opt)
		{
		    case 1:
			{
				if(PI[plid][Level] >= 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "У игрока достаточно большой уровень");
				GivePlayerLevel(plid, level);
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты повысил уровень игроку");
				format(glstr, sizeof(glstr), "Админ %s [%d] повысил игроку %s [%d] уровень на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], level);
				alog(glstr, 0);
			}
		    case 2:
			{
				SetPlayerLevel(plid, level);
				PI[plid][Exp] = exp;
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты изменил уровень игроку");
				format(glstr, sizeof(glstr), "Админ %s [%d] изменил игроку %s [%d] уровень на %d и опыт на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], level, exp);
				alog(glstr, 0);
			}
			default: SendClientMessage(playerid, COLOR_SYSTEM, "Действия: 1 - повысить, 2 - изменить");
		}
		return true;
	}

	else if(!strcmp(cmd, "/лдр", true))
	{
		if(PI[playerid][Admin] < 800) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/лдр [ID] [фракция]");
		new fid, plid;
		sscanf(params, "dd", plid, fid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(fid > (sizeof(fName))-1 || fid < 1 && PI[plid][Faction] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер фракции");
		if(PI[plid][Faction] != 0 && PI[plid][Rank] == 10)
		{
			format(glstr, sizeof(glstr), "{4169E1}Админ {00FF60}%s {4169E1}снял с тебя лидерство фракции {00FF60}%s", Name(playerid), fName[PI[plid][Faction]]);
			SendClientMessage(plid, -1, glstr);
			format(glstr, sizeof(glstr), "{4169E1}Ты снял с {00FF60}%s [%d] {4169E1}лидерство фракции {00FF60}%s", Name(plid), plid, fName[PI[plid][Faction]]);
			SendClientMessage(playerid, -1, glstr);
			format(glstr, sizeof(glstr), "Админ %s [%d] снял с %s [%d] лидерство фракции %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], fName[PI[plid][Faction]]);
			alog(glstr, 0);
			PI[plid][Faction] = 0;
			PI[plid][Rank] = 0;
			SetPlayerFactionColor(plid);
			SetLeaderSkin(plid);
			mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Faction` = '0', `Rank` = '0' WHERE `ID` = '%d'", PI[plid][ID]);
			mysql_query(mysql1, query1, false);
		}
		else if(PI[plid][Faction] != 0)
		{
			format(glstr, sizeof(glstr), "{4169E1}Админ {00FF60}%s {4169E1}выгнал тебя из фракции {00FF60}%s", Name(playerid), fName[PI[plid][Faction]]);
			SendClientMessage(plid, -1, glstr);
			format(glstr, sizeof(glstr), "{4169E1}Ты выгнал {00FF60}%s [%d] {4169E1}из фракции {00FF60}%s", Name(plid), plid, fName[PI[plid][Faction]]);
			SendClientMessage(playerid, -1, glstr);
			format(glstr, sizeof(glstr), "Админ %s [%d] выгнал %s [%d] из фракции %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], fName[PI[plid][Faction]]);
			alog(glstr, 0);
			PI[plid][Faction] = 0;
			PI[plid][Rank] = 0;
			SetPlayerFactionColor(plid);
			SetLeaderSkin(plid);
			mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Faction` = '0', `Rank` = '0' WHERE `ID` = '%d'", PI[plid][ID]);
			mysql_query(mysql1, query1, false);
		} else {
		    PI[plid][Faction] = fid;
			PI[plid][Rank] = 10;
			PI[playerid][Job] = 0;
			SetPlayerFactionColor(plid);
			SetLeaderSkin(plid);
			format(glstr, sizeof(glstr), "{4169E1}Админ {00FF60}%s {4169E1}назначил тебя лидером фракции {00FF60}%s", Name(playerid), fName[fid]);
			SendClientMessage(plid, -1, glstr);
			format(glstr, sizeof(glstr), "{4169E1}Ты назначил {00FF60}%s [%d] {4169E1}лидером фракции {00FF60}%s", Name(plid), plid, fName[fid]);
			SendClientMessage(playerid, -1, glstr);
			format(glstr, sizeof(glstr), "Админ %s [%d] назначил %s [%d] лидером фракции %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], fName[fid]);
			alog(glstr, 0);
			mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Faction` = '%d', `Rank` = '10' WHERE `ID` = '%d'", fid, PI[plid][ID]);
			mysql_query(mysql1, query1, false);
		}
		return true;
	}

	else if(!strcmp(cmd, "/ранг", true))
	{
		if(PI[playerid][Admin] < 800) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/ранг [ID] [ранг]");
		new rank, plid;
		sscanf(params, "dd", plid, rank);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(PI[plid][Faction] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не во фракции");
		else if(rank > 10 || rank < 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный ранг");
		PI[plid][Rank] = rank;
		format(glstr, sizeof(glstr), "{00FF60}Админ %s {4169E1}изменил твой ранг на {00FF60}%s", Name(playerid), GetRank(plid));
		SendClientMessage(plid, -1, glstr);
		format(glstr, sizeof(glstr), "{4169E1}Ты изменил ранг {00FF60}%s [%d] {4169E1}на {00FF60}%s", Name(plid), plid, GetRank(plid));
		SendClientMessage(playerid, -1, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил ранг %s [%d] на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], GetRank(plid));
		alog(glstr, 0);
		mysql_format(mysql1, query1, sizeof(query1), "UPDATE `users` SET `Rank` = '%d' WHERE `ID` = '%d'", rank, PI[plid][ID]);
		mysql_query(mysql1, query1, false);
		return true;
	}

	else if(!strcmp(cmd, "/зкн", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/зкн [ID] [0-100]");
		new law, plid;
		sscanf(params, "dd", plid, law);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(law > 100 || law < 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверное количество");
		PI[plid][Law] = law;
		format(glstr, sizeof(glstr), "Админ %s изменил твою законопослушность на %d", Name(playerid), law);
		SendClientMessage(plid, COLOR_ADMIN_P, glstr);
		format(glstr, sizeof(glstr), "Ты изменил законопослушность %s [%d] на %d", Name(plid), plid, law);
		SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил законопослушность %s [%d] на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], law);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/вскин", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/вскин [ID] [скин]");
		new skinid, plid;
		sscanf(params, "dd", plid, skinid);
		if(skinid < 0 || skinid > 299) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер скина");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		SetPlayerSkin(plid, skinid);
		format(glstr, sizeof(glstr), "Админ %s [%d] временно изменил скин игрока %s [%d] на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], skinid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/скин", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/скин [ID] [скин]");
		new skinid, plid;
		sscanf(params, "dd", plid, skinid);
		if(PI[playerid][Admin] < 1000 && playerid != plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты можешь изменять скин только себе");
		if(skinid < 0 || skinid > 299) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер скина");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(PI[plid][Faction] != 0)
		{
			PI[plid][fSkin] = skinid;
			SetPlayerSkin(plid, PI[plid][fSkin]);
		} else {
			PI[plid][Skin] = skinid;
			SetPlayerSkin(plid, PI[plid][Skin]);
		}
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил скин игрока %s [%d] на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], skinid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/скилл", true))
	{
		if(PI[playerid][Admin] < 800) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/скилл [ID] [ID скилла] [уровень]");
		new skillid, plid, skill;
		sscanf(params, "ddd", plid, skillid, skill);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(skillid < 0 || skillid > 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный ID скилла");
		if(skill < 0 || skill > 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный уровень скилла");
		setPlayerSkill(plid, skillid, skill);
		format(glstr, sizeof(glstr), "Ты изменил скилл оружия %s игроку %s [%d] на %d", sName[skillid], Name(plid), plid, skill);
		SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил тебе скилл оружия %s на %d", Name(playerid), playerid, sName[skillid], skill);
		if(playerid != plid) SendClientMessage(plid, COLOR_ADMIN_P, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил скилл оружия %s у игрока %s [%d] на %d", Name(playerid), PI[playerid][ID], sName[skillid], Name(plid), PI[plid][ID], skill);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/инттест", true))
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		new intid;
		sscanf(params, "d", intid);
		if(intid > (sizeof(HouseInt))-1 || intid < 0) return false;
		SetPlayerInterior(playerid, HouseInt[intid]);
		SetPlayerPos(playerid, HouseCoord[intid][0], HouseCoord[intid][1], HouseCoord[intid][2]);
		SetPlayerFacingAngle(playerid, HouseCoord[intid][3]);
		return true;
	}

	else if(!strcmp(cmd, "/тест", true))
	{
		if(PI[playerid][Admin] < 2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		AddPlayerEvent(playerid, "Что-то тестирует");
		new t,d;
		sscanf(params, "dd",t,d);
		NowSkinReg[playerid] = t-1;
		switch(t)
		{
			case 1:
			{
				ApplyAnimation(playerid, "BEACH", "ParkSit_M_loop", 4.0999, 0, 1, 1, 1, 1, 1);
			}
			case 2:
			{
				ApplyAnimation(playerid, "ped", "facsurp", 4.0999, 0, 1, 1, 1, 1, 1);
			}
			case 3:
			{
				SetVehicleZAngle(ShopCar[playerid], d);
			}
			case 4:
			{
				ShopCarAngle[playerid] = d;
			}
			case 5:
			{
				SendClientMessage(playerid, -1, PI[playerid][ReadNews]);
			}
		}
		return true;
	}

	else if(strcmp(cmd, "/ник", true) == 0)
	{
	    new plid, newnick[24];
	    sscanf(params, "ds[24]", plid, newnick);
	    if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
        else if(emptyMessage(newnick)) return SendClientMessage(playerid, COLOR_SYSTEM, "/ник [ID] [новый ник]");
	    else if(!IsRPNick(newnick)) return SendClientMessage(playerid, COLOR_SYSTEM, "Этот ник НонРП");
	    //else if(IsPlayerRegister(newnick)) return SendClientMessage(playerid, COLOR_SYSTEM, "Этот ник занят");
	    else if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
	    else
		{
	   		format(glstr, sizeof(glstr), "Админ %s [%d] изменил ник игроку %s [%d] на %s", Name(playerid), playerid, Name(plid), plid, newnick);
			SendClientMessageToAll(COLOR_SYSTEM, glstr);
			format(glstr,sizeof(glstr), "Админ %s [%d] изменил ник игроку %s [%d] на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], newnick);
			alog(glstr, 0);
			setPlayerName(plid, newnick);
		}
	 	return true;
	}

	else if(!strcmp(cmd, "/удоружие", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		new plid;
		sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		resetPlayerWeapons(playerid);
		format(glstr, sizeof(glstr), "Ты удалил оружие у %s [%d]", Name(plid), plid);
		SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] удалил у тебя оружие", Name(playerid), playerid);
		if(playerid != plid) SendClientMessage(plid, COLOR_ADMIN_P, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] удалил оружие у игрока %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/радоружие", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/радоружие [ID оружия] [патроны] [радиус]");
	    new weap, ammo, Float:radius;
	    sscanf(params, "ddf", weap, ammo, radius);
		if(weap < 1 || weap > 46) return SendClientMessage(playerid, COLOR_SYSTEM, "Не меньше 1 и не больше 46");
		else if(ammo < -10000 || ammo > 10000) return SendClientMessage(playerid, COLOR_SYSTEM, "Не меньше 0 и не больше 10000");
		else if(radius < 1 || radius > 50) return SendClientMessage(playerid, COLOR_SYSTEM, "Максимальный радиус 50, минимальный 1");
		else
		{
			switch(weap)
			{
				case 40: return SendClientMessage(playerid, COLOR_SYSTEM, "Выдавай 39 оружие");
				case 0 .. 15,44 .. 46:
				{
					for(new i;i<PLAYERS;i++)
					{
						if(!PlayerInRadius(playerid, i, radius) || i == playerid || !InGame(i)) continue;
						givePlayerWeapon(i, weap, 1);
						format(glstr, sizeof(glstr), "Админ %s [%d] выдал тебе %s", Name(playerid), playerid, wName[weap]);
						SendClientMessage(i, COLOR_ADMIN_P, glstr);
					}
					format(glstr, sizeof(glstr), "Ты дал %s игрокам в радиусе %.0f", wName[weap], radius);
					SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
					format(glstr, sizeof(glstr), "Админ %s [%d] выдал %s игрокам в радиусе %.0f %s", Name(playerid), PI[playerid][ID], wName[weap], radius);
					alog(glstr, 0);
				}
				default:
				{
					for(new i;i<PLAYERS;i++)
					{
						if(!PlayerInRadius(playerid, i, radius) || i == playerid || !InGame(i)) continue;
						givePlayerWeapon(i, weap, ammo);
						if(weap == 39) GivePlayerWeapon(i, 40, 1);
						format(glstr, sizeof(glstr), "Админ %s [%d] выдал тебе %s, c количеством патронов: %d", Name(playerid), playerid, wName[weap],ammo);
						SendClientMessage(i, COLOR_ADMIN_P, glstr);
					}
					format(glstr, sizeof(glstr), "Ты дал %s игрокам в радиусе %.0f, с количеством патронов: %d", wName[weap], radius, ammo);
					SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
					format(glstr, sizeof(glstr), "Админ %s [%d] выдал игрокам в радиусе %.0f %s, с количеством патронов: %d", Name(playerid), PI[playerid][ID], radius, wName[weap], ammo);
					alog(glstr, 0);
				}
			}
		}
		return true;
	}

	else if(!strcmp(cmd, "/оружие", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/оружие [ID] [ID оружия] [патроны]");
	    new plid, weap, ammo;
	    sscanf(params, "ddd", plid, weap, ammo);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(weap < 1 || weap > 46) return SendClientMessage(playerid, COLOR_SYSTEM, "Не меньше 1 и не больше 46");
		else if(ammo < -10000 || ammo > 10000) return SendClientMessage(playerid, COLOR_SYSTEM, "Не меньше 0 и не больше 10000");
		else
		{
			switch(weap)
			{
				case 40: return SendClientMessage(playerid, COLOR_SYSTEM, "Выдавай 39 оружие");
				case 0 .. 15,44 .. 46:
				{
					givePlayerWeapon(plid, weap, 1);
					format(glstr, sizeof(glstr), "Ты дал %s игроку %s [%d]", wName[weap], Name(plid), plid);
					SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
					format(glstr, sizeof(glstr), "Админ %s [%d] выдал тебе оружие", Name(playerid), playerid);
					if(playerid != plid) SendClientMessage(plid, COLOR_ADMIN_P, glstr);
					format(glstr, sizeof(glstr), "Админ %s [%d] выдал игроку %s [%d] %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], wName[weap]);
					alog(glstr, 0);
				}
				default:
				{
					givePlayerWeapon(plid, weap, ammo);
					if(weap == 39) GivePlayerWeapon(plid, 40, 1);
					format(glstr, sizeof(glstr), "Ты дал %s игроку %s [%d] с количеством патронов: %d", wName[weap], Name(plid), plid, ammo);
					SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
					format(glstr, sizeof(glstr), "Админ %s [%d] выдал тебе %s, c количеством патронов: %d", Name(playerid), playerid, wName[weap], ammo);
					if(playerid != plid) SendClientMessage(plid, COLOR_ADMIN_P, glstr);
					format(glstr, sizeof(glstr), "Админ %s [%d] выдал игроку %s [%d] %s с количеством патронов: %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], wName[weap], ammo);
					alog(glstr, 0);
				}
			}
		}
		return true;
	}

	else if(!strcmp(cmd, "/тпк", true))
	{
		if(PI[playerid][Admin] < 800) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/тпк [X],[Y],[Z]");
		else
		{
			new Float:x, Float:y, Float:z;
	    	sscanf(params, "p<,>fff", x, y, z);
		    SetPlayerPos(playerid, x, y, z);
			format(glstr, sizeof(glstr), "Админ %s [%d] телепортировался в X:%.3f Y:%.3f Z:%.3f", Name(playerid), PI[playerid][ID], x, y, z);
		    alog(glstr, 0);
		}
		return true;
	}

	else if(!strcmp(cmd, "/ттп", true))
	{
		if(PI[playerid][Admin] < 800) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		if(emptyMessage(params))
		{
			format(glstr, sizeof(glstr), "Сохранённые точки/%s [%d].ini", Name(playerid), PI[playerid][ID]);
			new iniFile = ini_openFile(glstr);
			ini_getFloat(iniFile, "X", PI[playerid][X]);
			ini_getFloat(iniFile, "Y", PI[playerid][Y]);
			ini_getFloat(iniFile, "Z", PI[playerid][Z]);
			ini_getFloat(iniFile, "A", PI[playerid][A]);
			ini_getInteger(iniFile, "VW", PI[playerid][VW]);
			ini_getInteger(iniFile, "Interior", PI[playerid][Interior]);
			ini_closeFile(iniFile);
			SetPlayerInterior(playerid, PI[playerid][Interior]);
			SetPlayerVirtualWorld(playerid, PI[playerid][VW]);
			if(IsPlayerInAnyVehicle(playerid))
			{
				SetVehiclePos(GetPlayerVehicleID(playerid),PI[playerid][X],PI[playerid][Y],PI[playerid][Z]);
				LinkVehicleToInterior(GetPlayerVehicleID(playerid), PI[playerid][Interior]);
				SetVehicleVirtualWorld(GetPlayerVehicleID(playerid), PI[playerid][VW]);
			} else {
				SetPlayerPos(playerid,PI[playerid][X],PI[playerid][Y],PI[playerid][Z]);
				SetPlayerFacingAngle(playerid, PI[playerid][A]);
			}
			format(glstr, sizeof(glstr), "Админ %s [%d] телепортировался с сохранённую точку", Name(playerid), PI[playerid][ID]);
			alog(glstr, 0);
		} else {
		    new opt;
			sscanf(params, "d", opt);
			switch(opt)
			{
			    case 1:
			    {
					GetPlayerPos(playerid,PI[playerid][X],PI[playerid][Y],PI[playerid][Z]);
				 	GetPlayerFacingAngle(playerid, PI[playerid][A]);
					SendClientMessage(playerid, COLOR_ADMIN_A, "Точка сохранена");
					format(glstr, sizeof(glstr), "Сохранённые точки/%s [%d].ini", Name(playerid), PI[playerid][ID]);
					new iniFile = ini_createFile(glstr);
					if(iniFile < 0)
					iniFile = ini_openFile(glstr);
					ini_setFloat(iniFile, "X", PI[playerid][X]);
					ini_setFloat(iniFile, "Y", PI[playerid][Y]);
					ini_setFloat(iniFile, "Z", PI[playerid][Z]);
					ini_setFloat(iniFile, "A", PI[playerid][A]);
					ini_setInteger(iniFile, "VW", GetPlayerVirtualWorld(playerid));
					ini_setInteger(iniFile, "Interior", GetPlayerInterior(playerid));
					ini_closeFile(iniFile);
				}
			}
		}

	    return true;
	}

	else if(!strcmp(cmd, "/тп", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/тп [ID]");
		new plid, opt;
		sscanf(params, "dd", plid, opt);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(playerid == plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты ввёл свой ID");
		else if(GetPVarInt(plid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в наблюдении");
		else if(GetPVarType(plid, "FlyMode")) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в режиме полета");
		else if(PIpen[plid][Cheater] == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в читерском мире");
		GetPlayerPos(plid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
		GetPlayerFacingAngle(plid, PI[playerid][A]);
		if(IsPlayerInAnyVehicle(playerid))
		{
			GetFrontPlayer(plid, PI[playerid][X], PI[playerid][Y], 3.0);
			SetVehicleVirtualWorld(GetPlayerVehicleID(playerid), GetPlayerVirtualWorld(plid));
			LinkVehicleToInterior(GetPlayerVehicleID(playerid), GetPlayerInterior(plid));
			SetVehiclePos(GetPlayerVehicleID(playerid), PI[playerid][X], PI[playerid][Y], PI[playerid][Z]+0.8);
		} else {
			GetFrontPlayer(plid, PI[playerid][X], PI[playerid][Y], 1.0);
			SetPlayerInterior(playerid, GetPlayerInterior(plid));
			SetPlayerVirtualWorld(playerid, GetPlayerVirtualWorld(plid));
			SetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]+0.8);
			SetPlayerFacingAngle(playerid, PI[playerid][A]-180.0);
		}
		SetPVarInt(playerid, "InHouse",GetPVarInt(plid, "InHouse"));
		if(IsPlayerInAnyVehicle(plid) && !IsPlayerInAnyVehicle(playerid))
		{
		    new vid = GetPlayerVehicleID(plid), fs;
		    for(new i;i<vMaxSeats[GetVehicleModel(vid)-400];i++)
		    {
		       if(IsSeatTaken(vid, i)) continue;
			   fs = i;
			   break;
		    }
		    PutPlayerInVehicle(playerid, vid, fs);
		}
		format(glstr, sizeof(glstr), "Админ %s [%d] телепортировался к тебе", Name(playerid), playerid);
		SendClientMessage(plid, COLOR_ADMIN_P, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] телепортировался к %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
		alog(glstr, 0);
		SendClientMessage(playerid, COLOR_ADMIN_A, "Ты телепортировался к игроку");
		return true;
	}
	else if(!strcmp(cmd, "/тпи", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/тп [ID]");
		new plid, opt;
		sscanf(params, "dd", plid, opt);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(playerid == plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты ввёл свой ID");
		else if(GetPVarInt(plid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в наблюдении");
		else if(GetPVarType(plid, "FlyMode")) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в режиме полета");
		else if(PIpen[plid][Cheater] == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в читерском мире");
		GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
		GetPlayerFacingAngle(playerid, PI[playerid][A]);
		if(IsPlayerInAnyVehicle(plid))
		{
			GetFrontPlayer(playerid, PI[playerid][X], PI[playerid][Y], 3.0);
			SetVehicleVirtualWorld(GetPlayerVehicleID(plid), GetPlayerVirtualWorld(playerid));
			LinkVehicleToInterior(GetPlayerVehicleID(plid), GetPlayerInterior(playerid));
			SetVehiclePos(GetPlayerVehicleID(plid), PI[playerid][X], PI[playerid][Y], PI[playerid][Z]+0.8);
		} else {
			GetFrontPlayer(playerid, PI[playerid][X], PI[playerid][Y], 1.0);
			SetPlayerInterior(plid, GetPlayerInterior(playerid));
			SetPlayerVirtualWorld(plid, GetPlayerVirtualWorld(playerid));
			SetPlayerPos(plid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]+0.8);
			SetPlayerFacingAngle(plid, PI[playerid][A]-180.0);
		}
		SetPVarInt(plid, "InHouse", GetPVarInt(playerid, "InHouse"));
		if(IsPlayerInAnyVehicle(playerid) && !IsPlayerInAnyVehicle(plid))
		{
		    new vid = GetPlayerVehicleID(playerid), fs;
		    for(new i;i<vMaxSeats[GetVehicleModel(vid)-400];i++)
		    {
		       if(IsSeatTaken(vid, i)) continue;
			   fs = i;
			   break;
		    }
		    PutPlayerInVehicle(plid, vid, fs);
		}
		format(glstr, sizeof(glstr), "Админ %s [%d] телепортировал тебя к себе", Name(playerid), playerid);
		SendClientMessage(plid, COLOR_ADMIN_P, glstr);
		format(glstr, sizeof(glstr), "Админ %s [%d] телепортировал %s [%d] к себе", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
		alog(glstr, 0);
		SendClientMessage(playerid, COLOR_ADMIN_A, "Ты телепортировал игрока");
		return true;
	}

	else if(!strcmp(cmd, "/деньги", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/деньги [ID] [кол-во] [действие]");
		new money, plid, opt;
		sscanf(params, "ddd", plid, money, opt);
		if(money < -10000000 || money > 20000000) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверное количество");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		switch(opt)
		{
		    case 1:
			{
				givePlayerMoney(plid, money);
				format(glstr, sizeof(glstr), "Админ %s [%d] добавил $%d игроку %s [%d]", Name(playerid), PI[playerid][ID], money, Name(plid), PI[plid][ID]);
				alog(glstr, 0);
				SendClientMessage(plid, COLOR_ADMIN_P, "Тебе добавили денег");
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты добавил денег игроку");
			}
		    case 2:
			{
				setPlayerMoney(plid, money);
				format(glstr, sizeof(glstr), "Админ %s [%d] изменил деньги игрока %s [%d] на $%d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], money);
				alog(glstr, 0);
				SendClientMessage(plid, COLOR_ADMIN_P, "Тебе изменили количество денег");
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты изменил количество денег игроку");
			}
			default: SendClientMessage(playerid, COLOR_SYSTEM, "Действия: 1 - добавить, 2 - изменить");
		}
		return true;
	}

	else if(!strcmp(cmd, "/донат", true))
	{
		if(PI[playerid][Admin] < 2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/донат [ID] [кол-во] [действие]");
		new Float:money, plid, opt;
		sscanf(params, "dfd", plid, money, opt);
		if(money < -10000000 || money > 20000000) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверное количество");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		switch(opt)
		{
		    case 1:
			{
				givePlayerDonate(plid, money);
				format(glstr, sizeof(glstr), "Админ %s [%d] добавил %.2f р. доната игроку %s [%d]", Name(playerid), PI[playerid][ID], money, Name(plid), PI[plid][ID]);
				alog(glstr, 0);
				SendClientMessage(plid, COLOR_ADMIN_P, "Тебе добавили донат");
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты добавил донат игроку");
			}
		    case 2:
			{
				setPlayerDonate(plid, money);
				format(glstr, sizeof(glstr), "Админ %s [%d] изменил донат игрока %s [%d] на %.2f р.", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], money);
				alog(glstr, 0);
				SendClientMessage(plid, COLOR_ADMIN_P, "Тебе изменили количество доната");
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты изменил количество доната игроку");
			}
			default: SendClientMessage(playerid, COLOR_SYSTEM, "Действия: 1 - добавить, 2 - изменить");
		}
		return true;
	}

	else if(!strcmp(cmd, "/инт", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/инт [ID] [интерьер]");
		new intid, plid;
		sscanf(params, "dd", plid, intid);
		if(intid < 0 || intid > 99) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный интерьер");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		SetPlayerInterior(plid, intid);
		SendClientMessage(plid, COLOR_ADMIN_P, "Тебе изменили интерьер");
		SendClientMessage(playerid, COLOR_ADMIN_A, "Ты изменил интерьер игроку");
		format(glstr, sizeof(glstr), "Админ %s [%d] выставил игроку %s [%d] интерьер %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], intid);
		alog(glstr, 0);
		return true;
	}

	if (!strcmp(cmd, "/погода", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/погода [ID]");
		new weathid;
		sscanf(params, "d", weathid);
		if(weathid < 0 || weathid > (sizeof(gRandomWeatherIDs))-1) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный ID");
		SetWeather(gRandomWeatherIDs[weathid]);
		NowWeather = gRandomWeatherIDs[weathid];
		SendClientMessage(playerid, COLOR_ADMIN_A, "Погода изменена");
		format(glstr, sizeof(glstr), "Админ %s [%d] выставил погоду %d", Name(playerid), PI[playerid][ID], weathid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/вмир", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/вмир [ID] [номер]");
		new intid, plid;
		sscanf(params, "dd", plid, intid);
		if(intid < 0 || intid > 1000000) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		SetPlayerVirtualWorld(plid, intid);
		SendClientMessage(plid, COLOR_ADMIN_P, "Тебе изменили виртуальный мир");
		SendClientMessage(playerid, COLOR_ADMIN_A, "Ты изменил виртуальный мир игроку");
		format(glstr, sizeof(glstr), "Админ %s [%d] выставил игроку %s [%d] виртуальный мир %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], intid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/урадм", true))
	{
		if(PI[playerid][Admin] < 1000 && !IsPlayerAdmin(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/урадм [ID] [уровень]");
		new level, plid;
		sscanf(params, "dd", plid, level);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		switch(level)
		{
			case 0:
			{
				format(glstr, sizeof(glstr), "%s [%d] снял с тебя права админа", Name(playerid), playerid, level);
				SendClientMessage(plid, COLOR_ADMIN_P, glstr);
				format(glstr, sizeof(glstr), "Ты снял с %s [%d] права админа", Name(plid), plid, level);
				SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
				PI[plid][Admin] = level;
			}
			case 10:
			{
				format(glstr, sizeof(glstr), "%s [%d] сделал тебя хелпером", Name(playerid), playerid, level);
				SendClientMessage(plid, COLOR_ADMIN_P, glstr);
				format(glstr, sizeof(glstr), "Ты сделал %s [%d] хелпером", Name(plid), plid, level);
				SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
				PI[plid][Admin] = level;
			}
			case 100,500,700,800,1000,1500,2000:
			{
				if(PI[playerid][Admin] < 2000 && level > 1000 && !IsPlayerAdmin(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя повышать до этого уровня админки");
				else if(PI[plid][Admin] >= PI[playerid][Admin] && !IsPlayerAdmin(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя этого делать");
				format(glstr, sizeof(glstr), "%s [%d] сделал тебя админом %d уровня", Name(playerid), playerid, level);
				SendClientMessage(plid, COLOR_ADMIN_P, glstr);
				format(glstr, sizeof(glstr), "Ты сделал %s [%d] админом %d уровня", Name(plid), plid, level);
				SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
				PI[plid][Admin] = level;
			}
			default:
			{
				return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный уровень админки");
			}
		}
		format(glstr, sizeof(glstr), "Админ %s [%d] выдал %d уровень админки игроку %s [%d]", Name(playerid), PI[playerid][ID], level, Name(plid), PI[plid][ID]);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/ддом", true))
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/ддом [интерьер] [класс]");
		else if(OnHouseEnter(playerid) != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Слишком близко к другому дому");
		new interior,level,cost;
		sscanf(params, "dd", interior,level);
		if(interior < 0 || interior > (sizeof(HouseInt))-1) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный интерьер");
		if(level < 1 || level > 7) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный класс");
		cost = generateCost(level);
		GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
		GetPlayerFacingAngle(playerid, PI[playerid][A]);
		CreateHouse(PI[playerid][X], PI[playerid][Y], PI[playerid][Z], PI[playerid][A], interior, cost, level, GetPlayerVirtualWorld(playerid), GetPlayerInterior(playerid));
		format(glstr, sizeof(glstr), "Админ %s [%d] добавил дом номер %d", Name(playerid), PI[playerid][ID], housecount);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/интдом", true))
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/интдом [номер] [номер интерьера]");
		new hid,interior;
		sscanf(params, "dd", hid,interior);
		if(interior < 0 || interior > (sizeof(HouseInt))-1) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный интерьер");
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер");
		SetHouseInterior(hid, interior);
		SendClientMessage(playerid, COLOR_ADMIN_A, "Интерьер дома изменен");
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил интерьер дома %d на %d", Name(playerid), PI[playerid][ID], hid, interior);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/ценадом", true))
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/ценадом [номер] [цена]");
		new hid,cost;
		sscanf(params, "dd", hid,cost);
		if(cost < 1 || cost > 20000000) return SendClientMessage(playerid, COLOR_SYSTEM, "Не так дорого");
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер");
		SetHouseCost(hid, cost);
		SendClientMessage(playerid, COLOR_ADMIN_A, "Цена дома изменена");
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил цену дома номер %d на $%d", Name(playerid), PI[playerid][ID], hid, cost);
		alog(glstr, 0);
		return true;
	}	
	
	else if(!strcmp(cmd, "/аценадом", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/аценадом [номер]");
		new hid,cost;
		sscanf(params, "d", hid);
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер");
		cost = generateCost(HI[hid][Level]);
		SetHouseCost(hid, cost);
		SendClientMessage(playerid, COLOR_ADMIN_A, "Цена дома изменена");
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил цену дома номер %d на $%d (автоматически)", Name(playerid), PI[playerid][ID], hid, cost);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/урдом", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/урдом [номер] [уровень]");
		new hid,level;
		sscanf(params, "dd", hid,level);
		if(level < 1 || level > 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный уровень");
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер");
		SetHouseLevel(hid, level);
		SendClientMessage(playerid, COLOR_ADMIN_A, "Класс дома изменен");
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил класс дома номер %d на %d", Name(playerid), PI[playerid][ID], hid, level);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/пдом", true))
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/пдом [номер]");
		new hid;
		sscanf(params, "d", hid);
		if(OnHouseEnter(playerid) != 0 && OnHouseEnter(playerid) != hid) return SendClientMessage(playerid, COLOR_SYSTEM, "Слишком близко к другому дому");
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер");
		if(hid == GetPVarInt(playerid, "InHouse")) return SendClientMessage(playerid, COLOR_SYSTEM, "Дом не может быть внутри себя");
		GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
		GetPlayerFacingAngle(playerid, PI[playerid][A]);
		SetHousePos(hid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z], PI[playerid][A], GetPlayerVirtualWorld(playerid), GetPlayerInterior(playerid));
		SendClientMessage(playerid, COLOR_ADMIN_A, "Позиция дома изменена");
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил позицию дома номер %d", Name(playerid), PI[playerid][ID], hid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/тдом", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/тдом [номер]");
		new hid;
		sscanf(params, "d", hid);
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер дома");
		SetPlayerPos(playerid, HI[hid][StreetX], HI[hid][StreetY], HI[hid][StreetZ]);
		SetPlayerInterior(playerid, 0);
		SetPlayerVirtualWorld(playerid, 0);
		format(glstr, sizeof(glstr), "Админ %s [%d] телепортировался к дому номер %d", Name(playerid), PI[playerid][ID], hid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/прдом", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/прдом [номер]");
		new hid, opt, plid;
		sscanf(params, "ddd", hid, opt, plid);
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер дома");
		if(HI[hid][Owner] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У дома нет владельца");
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(HI[hid][Owner] != PI[i][ID]) continue;
			opt = 1;
			plid = i;
			break;
		}
		if(opt == 1)
		{
			SellHouse(plid);
			SendClientMessage(plid, 0xFF0000FF, "Админ освободил твой дом, деньги возвращены");
		} else {
		    SetHouseOwner(hid, 0);
		}
		SendClientMessage(playerid, COLOR_ADMIN_A, "Дом освобожден");
		format(glstr, sizeof(glstr), "Админ %s [%d] освободил дом номер %d", Name(playerid), PI[playerid][ID], hid);
		alog(glstr, 0);
		return true;
	}

	else if(!strcmp(cmd, "/мдом", true))
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/мдом [номер]");
		new houseid;
		sscanf(params, "d", houseid);
		if(houseid < 1 || houseid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер дома");
		GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
		GetPlayerFacingAngle(playerid, PI[playerid][A]);
	    mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `VehX` = '%f', `VehY` = '%f', `VehZ` = '%f', `VehA` = '%f' WHERE `ID` = '%d'", PI[playerid][X], PI[playerid][Y], PI[playerid][Z], PI[playerid][A], houseid);
	    mysql_query(mysql1, query1, false);
	    HI[houseid][VehX] = PI[playerid][X];
	    HI[houseid][VehY] = PI[playerid][Y];
	    HI[houseid][VehZ] = PI[playerid][Z];
	    HI[houseid][VehA] = PI[playerid][A];
		SendClientMessage(playerid, 0x00FF00FF, "Позиция машины у дома изменена");
		format(glstr, sizeof(glstr), "Админ %s [%d] изменил позицию транспорта у дома номер %d", Name(playerid), PI[playerid][ID], houseid);
		alog(glstr, 0);
		return true;
	}

    else if(!strcmp(cmd, "/мдомтест", true))
    {
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/мдомтест [номер]");
		else if(AdminCarCount[playerid] >= 9) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты заспаунил слишком много машин, удали их");
		new hid;
		sscanf(params, "d", hid);
		if(hid < 1 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер дома");
		//DestroyVehicle(AdminCarID[playerid]);
		CreateAdminVehicle(playerid, 411, 1, 1);
        return true;
	}

    else if(!strcmp(cmd, "/хп", true))
    {
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/хп [ID] [кол-во]");
		new plid, opt, count;
		sscanf(params, "ddd", plid, count, opt);
		if(PI[playerid][Admin] < PI[plid][Admin] && !IsPlayerAdmin(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		if(PI[playerid][Admin] < 1000 && playerid != plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты можешь изменять количество здоровья только себе");
		if(count < 0 || count > 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверное количество");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		switch(opt)
		{
		    case 0:
			{
				setPlayerHealth(plid, count);
				SendClientMessage(plid, COLOR_ADMIN_P, "Тебе изменили уровень здоровья");
				format(glstr, sizeof(glstr), "Админ %s [%d] изменил уровень здоровья игрока %s [%d] на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], count);
				alog(glstr, 0);
			}
		    case 1:
		    {
		        setPlayerArmour(plid, count);
				SendClientMessage(plid, COLOR_ADMIN_P, "Тебе изменили уровень брони");
				format(glstr, sizeof(glstr), "Админ %s [%d] изменил уровень брони игрока %s [%d] на %d", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], count);
				alog(glstr, 0);
		    }
		}
        return true;
	}

    else if(!strcmp(cmd, "/упр", true))
    {
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/упр [ID]");
		new plid;
		sscanf(params, "d", plid);
		if(PI[playerid][Admin] < PI[plid][Admin] && !IsPlayerAdmin(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(GetPVarInt(plid, "OffKeys") == 0)
		{
		    SendClientMessage(plid, COLOR_ADMIN_P, "Тебе отключили управление");
		    SendClientMessage(playerid, COLOR_ADMIN_A, "Ты отключил игроку управление");
            SetPVarInt(plid, "OffKeys", 1);
            TogglePlayerControllable(plid, false);
			format(glstr, sizeof(glstr), "Админ %s [%d] отключил управление игроку %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
		} else {
		    SendClientMessage(plid, COLOR_ADMIN_P, "Тебе включили управление");
		    SendClientMessage(playerid, COLOR_ADMIN_A, "Ты включил игроку управление");
            SetPVarInt(plid, "OffKeys", 0);
            TogglePlayerControllable(plid, true);
			format(glstr, sizeof(glstr), "Админ %s [%d] включил управление игроку %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
		}
        return true;
	}

	else if(!strcmp(cmd, "/паспорт", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/паспорт [ID]");
		new plid;
		sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(PI[plid][Passport] != 0)
		{
			PI[plid][Passport] = 0;
			format(glstr, sizeof(glstr), "Админ %s [%d] удалил паспорт игрока %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
			SendClientMessage(plid, COLOR_ADMIN_P, "Админ забрал твой паспорт");
			SendClientMessage(playerid, COLOR_ADMIN_A, "Ты забрал паспорт у игрока");
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] выдал паспорт игроку %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
			SendClientMessage(playerid, COLOR_ADMIN_A, "Ты выдал паспорт игроку");
			ShowPlayerDialog(plid, D_PASSPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Паспорт", "{FF0000}Админ выдаёт тебе паспорт\n\n{FFFF00}Введи дату рождения своего персонажа", "Далее", "Выход");
		}
		return true;
	}

	else if(!strcmp(cmd, "/набл", true))
	{
		if(PI[playerid][Admin] < 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/набл [ID]");
		new plid;
		sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		specPlayer(playerid, plid);
		return true;
	}

	else if(!strcmp(cmd, "/прыг", true))
	{
		if(PI[playerid][Admin] < 500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/прыг [дистанция] [высота]");
		new Float:distance[2];
		sscanf(params, "ff", distance[0], distance[1]);
		if(distance[0] < 1 || distance[0] < 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверная дистанция или высота");
		new Float:Coords[3];
		GetPlayerPos(playerid, Coords[0], Coords[1], Coords[2]);
		GetFrontPlayer(playerid, Coords[0], Coords[1], distance[0]);
		SetPlayerPos(playerid, Coords[0], Coords[1], Coords[2]+distance[1]);
		return true;
	}

	else if(!strcmp(cmd, "/водправа", true))
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/водправа [ID]");
		new plid;
		sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(PI[plid][DriveLicence] != 0)
		{
			PI[plid][DriveLicence] = 0;
			format(glstr, sizeof(glstr), "Админ %s [%d] удалил водительское удостоверение игрока %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
			SendClientMessage(plid, COLOR_ADMIN_P, "Админ забрал у тебя водительское удостоверение");
			SendClientMessage(playerid, COLOR_ADMIN_A, "Ты забрал водительское удостоверение у игрока");
		} else {
			format(glstr, sizeof(glstr), "Админ %s [%d] выдал водительское удостоверение игроку %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
			SendClientMessage(plid, COLOR_ADMIN_P, "Админ выдал тебе водительское удостоверение");
			SendClientMessage(playerid, COLOR_ADMIN_A, "Ты выдал водительское удостоверение игроку");
			PI[plid][DriveLicence] = 1;
		}
		return true;
	}

	else if(!strcmp(cmd, "/пол", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/пол [ID]");
		new plid;
		sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		if(PI[plid][Sex] != 0)
		{
			SetPlayerSex(plid, 0);
			format(glstr, sizeof(glstr), "Админ %s [%d] сменил пол игроку %s [%d] на женский", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
			SendClientMessage(plid, COLOR_ADMIN_P, "Админ поменял твой пол на женский");
			SendClientMessage(playerid, COLOR_ADMIN_A, "Ты сменил пол игроку на женский");
		} else {
			SetPlayerSex(plid, 1);
			format(glstr, sizeof(glstr), "Админ %s [%d] сменил пол игроку %s [%d] на мужской", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			alog(glstr, 0);
			SendClientMessage(plid, COLOR_ADMIN_P, "Админ поменял твой пол на мужской");
			SendClientMessage(playerid, COLOR_ADMIN_A, "Ты сменил пол игроку на мужской");
		}
		return true;
	}

	else if(!strcmp(cmd, "/а", true) || !strcmp(cmd, "/a", true))
	{
		if(PI[playerid][Admin] < 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/а [текст]");
		ReplaceID(params);
		if(strlen(params) > 95) return SendClientMessage(playerid, COLOR_SYSTEM, "Укороти сообщение");
		else if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new msg[95];
		sscanf(params, "s[95]", msg);
		if(emptyMessage(msg)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты ничего не ввёл");
		if(PI[playerid][Admin] < 100)
		{
		    format(glstr,sizeof(glstr),"{FFFF00}[H] %s [%d]: %s",Name(playerid),playerid,msg);
		} else {
  			format(glstr,sizeof(glstr),"{FFFF00}[А] %s [%d]: %s",Name(playerid),playerid,msg);
		}
		SendAdminMessage(10, glstr);
		if(PI[playerid][Admin] < 100)
		{
		    format(glstr,sizeof(glstr),"Хелпер %s [%d]: %s",Name(playerid),PI[playerid][ID],msg);
		} else {
  			format(glstr,sizeof(glstr),"Админ %s [%d]: %s",Name(playerid),PI[playerid][ID],msg);
  		}
  		alog(glstr, 1);
	    return true;
	}

	else if(!strcmp(cmd, "/удак", true))
	{
		if(PI[playerid][Admin] < 2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/удак [ник]");
		new nick[24];
		sscanf(params, "s[24]", nick);
		//if(!IsPlayerRegister(playerid, nick)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого аккаунта нет");
		format(glstr, sizeof(glstr), "Админ %s [%d] удалил аккаунт %s", Name(playerid), playerid, nick);
		SendClientMessageToAll(0x962929FF, glstr);
		DeleteAccount(nick);
		format(glstr, sizeof(glstr), "Админ %s [%d] удалил аккаунт %s", Name(playerid), PI[playerid][ID], nick);
		alog(glstr, 0);
	    return true;
	}

	else if(!strcmp(cmd, "/lock", true))
	{
		if(!IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен находиться в транспорте");
		ToggleCarLock(playerid);
	    return true;
	}

	if(!strcmp(cmd, "/гос", true) || !strcmp(cmd, "/нвс", true) || !strcmp(cmd, "/gnews", true) || !strcmp(cmd, "/gov", true) || !strcmp(cmd, "/нов", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
		else if(PI[playerid][Rank] != 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не лидер фракции");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты ничего не ввёл");
		ReplaceID(params);
		if(strlen(params) > 70) return SendClientMessage(playerid, COLOR_SYSTEM, "Длинная новость");
		else if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		format(glstr,sizeof(glstr),"[Гос. новости %s] %s: %s", fName[PI[playerid][Faction]], Name(playerid), params);
		SendClientMessageToAll(0x00FF00FF, glstr);
		chatlog(playerid, params, 6);
	    return true;
	}

	else if(!strcmp(cmd, "/r", true))
	{
		if(PI[playerid][Faction] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не состоишь во фракции");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "![текст]");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new msg[64];
		sscanf(params, "s[64]", msg);
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(PI[i][Faction] == PI[playerid][Faction]) 
			{
				format(glstr,sizeof(glstr),"%s %s: %s", GetRank(playerid), Name(playerid),msg);
				SendClientMessage(i, 0x00FFFFFF, glstr);
			} else {
				if(GetPVarInt(i, "ShowIC") == 0) continue;
				format(glstr,sizeof(glstr),"[F IC] %s [%d]: %s",Name(playerid),playerid,msg);
				SendClientMessage(i, 0x417B1CFF, glstr);
			}
		}
		chatlog(playerid, msg, 2);
	    return true;
	}

	else if(!strcmp(cmd, "/ar", true))
	{
		if(PI[playerid][Faction] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не состоишь во фракции");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "!![текст]");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new msg[64];
		sscanf(params, "s[64]", msg);
		if(PI[playerid][Faction] < 4)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 1 || PI[i][Faction] == 2 || PI[i][Faction] == 3) 
				{
					format(glstr,sizeof(glstr),"%s %s: %s", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA IC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x417B1CFF, glstr);
				}
			}
		}
		else if(PI[playerid][Faction] < 7)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 4 || PI[i][Faction] == 5 || PI[i][Faction] == 6) 
				{
					format(glstr,sizeof(glstr),"%s %s: %s", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA IC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x417B1CFF, glstr);
				}
			}
		}
		else if(PI[playerid][Faction] < 10)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 7 || PI[i][Faction] == 8 || PI[i][Faction] == 9) 
				{
					format(glstr,sizeof(glstr),"%s %s: %s", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA IC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x417B1CFF, glstr);
				}
			}
		}
		else if(PI[playerid][Faction] < 13)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 10 || PI[i][Faction] == 11 || PI[i][Faction] == 12) 
				{
					format(glstr,sizeof(glstr),"%s %s: %s", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA IC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x417B1CFF, glstr);
				}
			}
		}
		chatlog(playerid, msg, 3);
	    return true;
	}

	else if(!strcmp(cmd, "/arb", true))
	{
		if(PI[playerid][Faction] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не состоишь во фракции");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "!!*[текст]");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new msg[64];
		sscanf(params, "s[64]", msg);
		if(PI[playerid][Faction] < 4)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 1 || PI[i][Faction] == 2 || PI[i][Faction] == 3) 
				{
					format(glstr,sizeof(glstr),"%s {AFEEEE}(( {FFFFFF}%s: %s {AFEEEE}))", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA OOC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x41707EFF, glstr);
				}
			}
		}
		else if(PI[playerid][Faction] < 7)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 4 || PI[i][Faction] == 5 || PI[i][Faction] == 6) 
				{
					format(glstr,sizeof(glstr),"%s {AFEEEE}(( {FFFFFF}%s: %s {AFEEEE}))", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA OOC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x41707EFF, glstr);
				}
			}
		}
		else if(PI[playerid][Faction] < 10)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 7 || PI[i][Faction] == 8 || PI[i][Faction] == 9) 
				{
					format(glstr,sizeof(glstr),"%s {AFEEEE}(( {FFFFFF}%s: %s {AFEEEE}))", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA OOC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x41707EFF, glstr);
				}
			}
		}
		else if(PI[playerid][Faction] < 13)
		{
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i)) continue;
				if(PI[i][Faction] == 10 || PI[i][Faction] == 11 || PI[i][Faction] == 12) 
				{
					format(glstr,sizeof(glstr),"%s {AFEEEE}(( {FFFFFF}%s: %s {AFEEEE}))", GetRank(playerid), Name(playerid),msg);
					SendClientMessage(i, 0x0080FFFF, glstr);
				} else {
					if(GetPVarInt(i, "ShowIC") == 0) continue;
					format(glstr,sizeof(glstr),"[FA OOC] %s [%d]: %s",Name(playerid),playerid,msg);
					SendClientMessage(i, 0x41707EFF, glstr);
				}
			}
		}
		chatlog(playerid, msg, 4);
	    return true;
	}

	else if(!strcmp(cmd, "/rb", true))
	{
		if(PI[playerid][Faction] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не состоишь во фракции");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "!*[текст]");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new msg[64];
		sscanf(params, "s[64]", msg);
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(PI[i][Faction] == PI[playerid][Faction]) 
			{
				format(glstr,sizeof(glstr),"%s {AFEEEE}(( {FFFFFF}%s: %s {AFEEEE}))",GetRank(playerid),Name(playerid),msg);
				SendClientMessage(i, 0x00FFFFFF, glstr);
			} else {
				if(GetPVarInt(i, "ShowIC") == 0) continue;
				format(glstr,sizeof(glstr),"[F OOC] %s [%d]: %s",Name(playerid),playerid,msg);
				SendClientMessage(i, 0x41707EFF, glstr);
			}
		}
		chatlog(playerid, msg, 5);
	    return true;
	}

	else if(!strcmp(cmd, "/ачат", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(strlen(params) > 95) return SendClientMessage(playerid, COLOR_SYSTEM, "Длинное сообщение");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/ачат [текст]");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
  		format(glstr,sizeof(glstr),"Админ %s: %s",Name(playerid),params);
	    SendClientMessageToAll(0xFFD324FF, glstr);
	    format(glstr,sizeof(glstr),"Объявление от %s [%d]: %s",Name(playerid),PI[playerid][ID],params);
	    alog(glstr, 2);
	    return true;
	}

	else if(!strcmp(cmd, "/м", true))
	{
		if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/м [ID транспорта] [ID цвета 1] [ID цвета 2]");
		else if(AdminCarCount[playerid] >= 9) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты заспаунил слишком много машин, удали их");
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в наблюдении");
		else if(GetPVarType(playerid, "FlyMode")) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в режиме полета");
 		new vid, color1, color2;
 		GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
 		GetPlayerFacingAngle(playerid, PI[playerid][A]);
	    sscanf(params, "ddd", vid, color1, color2);
		if(vid < 400 || vid > 611) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный ID");
		else
		{
			//DestroyVehicle(AdminCarID[playerid]);
			CreateAdminVehicle(playerid, vid, color1, color2);
			SendClientMessage(playerid, COLOR_ADMIN_A, "Транспорт заспаунен");
			format(glstr, sizeof(glstr), "Админ %s [%d] создал %s", Name(playerid), PI[playerid][ID], vName[vid - 400]);
			alog(glstr, 0);
		}
		return true;
	}

	else if(strcmp(cmd, "/кик", true) == 0)
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/кик [ID]");
		new plid;
	    sscanf(params, "d", plid);
	    if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!IsPlayerConnected(plid) || plid > PLAYERS) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(playerid == plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не можешь кикнуть себя");
		else
		{
		    format(glstr, sizeof(glstr), "Админ %s [%d] кикнул %s", Name(playerid), playerid, Name(plid), plid);
		    SendClientMessageToAll(0x962929FF, glstr);
		    format(glstr, sizeof(glstr), "Админ %s [%d] кикнул %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
		    alog(glstr, 0);
		    Kick(plid);
		}
		return true;
	}

	else if(strcmp(cmd, "/разбан", true) == 0)
	{
		if(PI[playerid][Admin] <  2000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/разбан [IP]");
		new ip[16];
	    sscanf(params, "s[16]", ip);
		mysql_format(mysql1, query1, sizeof(query1), "SELECT `ID` FROM `bans` WHERE `IP` = '%s'", ip);
		mysql_tquery(mysql1, query1, "UnBanIP", "ds", playerid, ip);
		return true;
	}

	else if(strcmp(cmd, "/бан", true) == 0)
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/бан [ID]");
		new plid;
	    sscanf(params, "d", plid);
	    if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!IsPlayerConnected(plid) || plid > PLAYERS) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(playerid == plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не можешь забанить себя");
		else
		{
		    format(glstr, sizeof(glstr), "Админ %s [%d] забанил %s", Name(playerid), playerid, Name(plid), plid);
		    SendClientMessageToAll(0x962929FF, glstr);
		    format(glstr, sizeof(glstr), "Админ %s [%d] забанил %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
		    alog(glstr, 0);
			mysql_format(mysql1, query1, sizeof(query1), "INSERT INTO `bans` (`IP`) VALUES ('%s')", PI[plid][IP]);
			mysql_query(mysql1, query1, false);
		    BanEx(plid, Name(playerid));
		}
		return true;
	}

	else if(strcmp(cmd, "/пбан", true) == 0)
	{
		if(PI[playerid][Admin] < 1000) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/пбан [ID]");
		new plid,ip[16],n1,n2,n3,n4;
	    sscanf(params, "d", plid);
	    if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!IsPlayerConnected(plid) || plid > PLAYERS) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else if(playerid == plid) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не можешь забанить себя");
		else
		{
		    format(glstr, sizeof(glstr), "Админ %s [%d] забанил подсеть %s", Name(playerid), playerid, Name(plid), plid);
		    SendClientMessageToAll(0x962929FF, glstr);
		    format(glstr, sizeof(glstr), "Админ %s [%d] забанил подсеть %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
		    alog(glstr, 0);
			GetPlayerIp(plid, ip, sizeof(ip));
			sscanf(ip, "p<.>dddd", n1,n2,n3,n4);
			format(glstr, sizeof(glstr), "banip %d.%d.*.*", n1, n2);
			SendRconCommand(glstr);
			mysql_format(mysql1, query1, sizeof(query1), "INSERT INTO `bans` (`IP`) VALUES ('%d.%d.*.*')", n1, n2);
			mysql_query(mysql1, query1, false);
			fKick(plid);
		}
		return true;
	}

	else if(strcmp(cmd, "/чм", true) == 0)
	{
 		new plid;
	    sscanf(params, "d", plid);
		if(PI[playerid][Admin] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/чм [ID]");
	    else if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
			if(PIpen[plid][Cheater] != 1)
			{
			    format(glstr, sizeof(glstr), "%s [%d] посадил %s [%d] в читерский мир", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
                alog(glstr, 0);
			    InCheat(plid);
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты посадил игрока в читерский мир");
			} else {
			    format(glstr, sizeof(glstr), "%s [%d] выпустил %s [%d] из читерского мира", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			    alog(glstr, 0);
			    OutCheat(plid);
				SendClientMessage(playerid, COLOR_ADMIN_A, "Ты выпустил игрока из читерского мира");
			}
		}
		return true;
	}

	else if(strcmp(cmd, "/обнз", true) == 0)
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/обнз [ID]");
	 	new plid;
	    sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
   			format(glstr, sizeof(glstr), "Ты обнулил количество заглушек у %s [%d]", Name(plid), plid);
			SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
			format(glstr, sizeof(glstr), "Админ %s [%d] обнулил тебе количество заглушек", Name(playerid), playerid);
			if(playerid != plid) SendClientMessage(plid, COLOR_ADMIN_P, glstr);
			PIpen[plid][MuteCount] = 0;
		}
		return true;
	}

	else if(strcmp(cmd, "/обнч", true) == 0)
	{
		if(PI[playerid][Admin] < 1500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
  		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/обнз [ID]");
	 	new plid;
	    sscanf(params, "d", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
   			format(glstr, sizeof(glstr), "Ты обнулил количество попаданий в ЧМ у %s [%d]", Name(plid), plid);
			SendClientMessage(playerid, COLOR_ADMIN_A, glstr);
			format(glstr, sizeof(glstr), "Админ %s [%d] обнулил тебе количество попаданий в читерский мир", Name(playerid), playerid);
			if(playerid != plid) SendClientMessage(plid, COLOR_ADMIN_P, glstr);
			PIpen[plid][CheaterCount] = 0;
		}
		return true;
	}

	else if(!strcmp(cmd, "/акз", true))
	{
	    if(PI[playerid][Admin] < 500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		new plid, mtime, reason[64];
		sscanf(params, "dds[64]", plid, mtime, reason);
		if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/акз [ID аккаунта] [время] [причина]");
		else {
			if(mtime < 0 || mtime > 2000000000) mtime = 2000000000;
			if(PI[playerid][Admin] == 500 && mtime > 3600) mtime = 3600;
			mysql_format(mysql1, query1, sizeof(query1), "SELECT MuteTime, MuteCount FROM `penalty` WHERE PlayerID = '%d'", plid);
			mysql_tquery(mysql1, query1, "MuteAccount", "ddds[64]", playerid, plid, mtime, reason);
		}
		return true;
	}

	else if(!strcmp(cmd, "/з", true))
	{
	    if(PI[playerid][Admin] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		if(PI[playerid][Admin] <= 100)
		{
		    if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/з [ID] [причина]");
		    new plid, reason[64];
		    sscanf(params, "ds[64]", plid, reason);
		    if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
			if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
			if(PIpen[plid][MuteTime] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок уже заглушен");
			if(PIpen[plid][MuteCount] == 0)
			{
			    if(emptyMessage(reason))
			    {
			   		format(glstr, sizeof(glstr), "Админ %s [%d] выдал предупреждение в чате %s [%d]", Name(playerid), playerid, Name(plid), plid);
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] выдал предупреждение в чате %s [%d], причина: %s", Name(playerid), playerid, Name(plid), plid, reason);
				}
			    SendClientMessageToAll(COLOR_ADMIN, glstr);
			    if(emptyMessage(reason))
			    {
			   		format(glstr, sizeof(glstr), "Админ %s [%d] выдал предупреждение в чате %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] выдал предупреждение в чате %s [%d], причина: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], reason);
				}
			   	alog(glstr, 0);
			    PIpen[plid][MuteCount]++;
			} else {
				new mtime = NextMuteTime(plid);
	           	if(emptyMessage(reason))
	           	{
			    	format(glstr, sizeof(glstr), "Админ %s [%d] заглушил %s [%d] на %s", Name(playerid), playerid, Name(plid), plid, MTF(mtime));
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] заглушил %s [%d] на %s, причина: %s", Name(playerid), playerid, Name(plid), plid, MTF(mtime), reason);
				}
			    SendClientMessageToAll(COLOR_ADMIN, glstr);
			    if(emptyMessage(reason))
	           	{
			    	format(glstr, sizeof(glstr), "Админ %s [%d] заглушил игрока %s [%d] на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mtime));
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] заглушил игрока %s [%d] на %s, причина: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mtime), reason);
				}
			   	alog(glstr, 0);
			    PIpen[plid][MuteTime] = mtime;
			    PIpen[plid][MuteCount]++;
			}
		} else {
		    new plid, mtime, reason[64];
		    sscanf(params, "dds[64]", plid, mtime, reason);
		    if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/з [ID] [время] [причина]");
		    if(mtime < 0 || mtime > 2000000000) mtime = 2000000000;
			if(PI[playerid][Admin] <= 500 && mtime > 3600) mtime = 3600;
		    if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		    if(mtime == 0)
		    {
                if(PIpen[plid][MuteTime] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не заглушен");
		    	format(glstr, sizeof(glstr), "Админ %s [%d] разглушил %s [%d]", Name(playerid), playerid, Name(plid), plid);
			    SendClientMessageToAll(0x00FF00FF, glstr);
			    format(glstr, sizeof(glstr), "Админ %s [%d] разглушил игрока %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			    alog(glstr, 0);
			    PIpen[plid][MuteTime] = mtime;
			    if(PIpen[plid][MuteCount] > 0) PIpen[plid][MuteCount]--;
			} else {
				if(PIpen[plid][MuteTime] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок уже заглушен");
				if(emptyMessage(reason))
	           	{
					format(glstr, sizeof(glstr), "Админ %s [%d] заглушил %s [%d] на %s", Name(playerid), playerid, Name(plid), plid, MTF(mtime));
				} else {
					format(glstr, sizeof(glstr), "Админ %s [%d] заглушил %s [%d] на %s, причина: %s", Name(playerid), playerid, Name(plid), plid, MTF(mtime), reason);
				}
			    SendClientMessageToAll(COLOR_ADMIN, glstr);
				if(emptyMessage(reason))
	           	{
					format(glstr, sizeof(glstr), "Админ %s [%d] заглушил игрока %s [%d] на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mtime));
				} else {
					format(glstr, sizeof(glstr), "Админ %s [%d] заглушил игрока %s [%d] на %s, причина: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mtime), reason);
				}
			    alog(glstr, 0);
			    PIpen[plid][MuteTime] = mtime;
			    PIpen[plid][MuteCount]++;
			}
		}
		return true;
	}

	else if(!strcmp(cmd, "/зр", true))
	{
 		new plid, mrtime, reason[64];
	    sscanf(params, "dds[64]", plid, mrtime, reason);
		if(PI[playerid][Admin] < 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/зр [ID] [время]");
	    else if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
			if(mrtime < 0 || mrtime > 2000000000) mrtime = 2000000000;
			if(PI[playerid][Admin] < 100 && mrtime > 3600) mrtime = 3600;
			else if(PI[playerid][Admin] < 700 && mrtime > 36000) mrtime = 36000;
		    if(mrtime == 0)
		    {
                if(PIpen[plid][MuteReport] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игроку не запрещено писать в репорт");
    			format(glstr, sizeof(glstr), "%s [%d] снял запрет на использование репорта у игрока %s [%d]", Name(playerid), playerid, Name(plid), plid);
			    SendClientMessageToAll(0x00FF00FF, glstr);
   				format(glstr, sizeof(glstr), "%s [%d] снял запрет на использование репорта у игрока %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			    alog(glstr, 0);
			    PIpen[plid][MuteReport] = mrtime;
		    } else {
		    	if(PIpen[plid][MuteReport] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игроку уже запрещено писать в репорт");
				if(emptyMessage(reason))
				{
			    	format(glstr, sizeof(glstr), "%s [%d] запретил писать в репорт игроку %s [%d] на %s", Name(playerid), playerid, Name(plid), plid, MTF(mrtime));
				} else {
				    format(glstr, sizeof(glstr), "%s [%d] запретил писать в репорт игроку %s [%d] на %s, причина: %s", Name(playerid), playerid, Name(plid), plid, MTF(mrtime), reason);
				}
			    SendClientMessageToAll(COLOR_ADMIN, glstr);
			    if(emptyMessage(reason))
			    {
			    	format(glstr, sizeof(glstr), "%s [%d] запретил писать в репорт игроку %s [%d] на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mrtime));
				} else {
				    format(glstr, sizeof(glstr), "%s [%d] запретил писать в репорт игроку %s [%d] на %s, причина: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mrtime), reason);
				}
			    alog(glstr, 0);
			    PIpen[plid][MuteReport] = mrtime;
		    }
		}
		return true;
	}

	else if(!strcmp(cmd, "/акт", true))
	{
 		new plid, ttime, reason[64];
	    sscanf(params, "dds[64]", plid, ttime, reason);
		if(PI[playerid][Admin] < 500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/акт [ID] [время] [причина]");
		else
		{
			if(ttime < 0 || ttime > 2000000000) ttime = 2000000000;
			if(PI[playerid][Admin] < 500 && ttime > 300) ttime = 300;
			else if(PI[playerid][Admin] < 700 && ttime > 36000) ttime = 36000;
			mysql_format(mysql1, query1, sizeof(query1), "SELECT `JailTime` FROM `penalty` WHERE `PlayerID` = '%d'", plid);        
			mysql_tquery(mysql1, query1, "JailAccount", "ddds", playerid, plid, ttime, reason);
		}
		return true;
	}

	else if(!strcmp(cmd, "/т", true))
	{
 		new plid, ttime, reason[64];
	    sscanf(params, "dds[64]", plid, ttime, reason);
		if(PI[playerid][Admin] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/т [ID] [время] [причина]");
	    else if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
			if(ttime < 0 || ttime > 2000000000) ttime = 2000000000;
			if(PI[playerid][Admin] < 500 && ttime > 300) ttime = 300;
			else if(PI[playerid][Admin] < 700 && ttime > 36000) ttime = 36000;
		    if(ttime == 0)
		    {
				if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя выпускать игроков из тюрьмы");
                if(PIpen[plid][JailTime] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не в тюрьме");
    			format(glstr, sizeof(glstr), "Админ %s [%d] выпустил %s [%d] из тюрьмы", Name(playerid), playerid, Name(plid), plid);
			    SendClientMessageToAll(0x00FF00FF, glstr);
   				format(glstr, sizeof(glstr), "Админ %s [%d] выпустил %s [%d] из тюрьмы", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			    alog(glstr, 0);
			    PIpen[plid][JailTime] = 1;
		    } else {
		    	if(PIpen[plid][JailTime] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок в тюрьме");
				if(emptyMessage(reason))
				{
			    	format(glstr, sizeof(glstr), "Админ %s [%d] посадил %s [%d] в тюрьму на %s", Name(playerid), playerid, Name(plid), plid, MTF(ttime));
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] посадил %s [%d] в тюрьму на %s, причина: %s", Name(playerid), playerid, Name(plid), plid, MTF(ttime), reason);
				}
			    SendClientMessageToAll(COLOR_ADMIN, glstr);
			    if(emptyMessage(reason))
			    {
			    	format(glstr, sizeof(glstr), "Админ %s [%d] посадил %s [%d] в тюрьму на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(ttime));
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] посадил %s [%d] в тюрьму на %s, причина: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(ttime), reason);
				}
			    alog(glstr, 0);
			    PIpen[plid][JailTime] = ttime;
				spawnPlayer(plid);
		    }
		}
		return true;
	}

	else if(!strcmp(cmd, "/допстат", true))
	{
 		new plid, title[64];
	    sscanf(params, "d", plid);
		if(PI[playerid][Admin] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(!strlen(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/допстат [ID]");
		else if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
			new body[1536];
			format(title, sizeof(title), "{FFFFFF}Дополнительная статистика %s [%d]", Name(plid), plid);
			/*strcat(body,"{FFFFFF}SA-MP Addon: ");
			if(Audio_IsClientConnected(playerid))
			{
				strcat(body,"{00FF00}Установлен");
			} else {
				strcat(body,"{FFFF00}Не установлен");
			}*/
			format(glstr, sizeof(glstr),"\n{FFFFFF}Уровень админки: {FFFF00}%d\n", PI[plid][Admin]);
			strcat(body, glstr);
			if(PI[playerid][Admin] > PI[plid][Admin])
			{
				format(glstr, sizeof(glstr),"{FFFFFF}IP сейчас: {FFFF00}%s\n", PI[plid][IP]);
				strcat(body, glstr);
				format(glstr, sizeof(glstr),"{FFFFFF}IP при регистрации: {FFFF00}%s\n", PI[plid][RegIP]);
				strcat(body, glstr);
				format(glstr, sizeof(glstr),"{FFFFFF}IP при последнем посещении: {FFFF00}%s\n", PI[plid][LastIP]);
				strcat(body, glstr);
				format(glstr, sizeof(glstr),"{FFFFFF}Донат: {FFFF00}%.2f р.\n", PI[plid][Donate]);
				strcat(body, glstr);
			}
			format(glstr, sizeof(glstr),"{FFFFFF}Время игры: {FFFF00}%s", MTF(NetStats_GetConnectedTime(plid)/1000));
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}Потеря данных: {FFFF00}%.1f%", NetStats_PacketLossPercent(plid));
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}Зарегистрирован: {FFFF00}%s {FFFFFF}в {FFFF00}%s", PI[plid][RegDate], PI[plid][RegTime]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}Последний вход: {FFFF00}%s {FFFFFF}в {FFFF00}%s", PI[plid][LoginDate], PI[plid][LoginTime]);
			strcat(body, glstr);
			strcat(body, "\n\n{FFFF00}Местоположение:\n");
			format(glstr, sizeof(glstr),"{FFFFFF}Город: {FFFF00}%s\n", City[PI[playerid][sZone]-1]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"{FFFFFF}Интерьер: {FFFF00}%d\n", GetPlayerInterior(plid));
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"{FFFFFF}Мир: {FFFF00}%d\n", GetPlayerVirtualWorld(plid));
			strcat(body, glstr);
			GetPlayerPos(plid, PI[plid][X], PI[plid][Y], PI[plid][Z]);
			GetPlayerFacingAngle(plid, PI[plid][A]);
			format(glstr, sizeof(glstr),"{FFFFFF}X: {FFFF00}%.4f {FFFFFF}Y: {FFFF00}%.4f {FFFFFF}Z: {FFFF00}%.4f {FFFFFF}A: {FFFF00}%.2f", PI[plid][X], PI[plid][Y], PI[plid][Z], PI[plid][A]);
			strcat(body, glstr);
			if(PIcar[plid][CarGUID] != INVALID_VEHICLE_ID || IsPlayerInAnyVehicle(plid))
			{
				strcat(body, "\n\n{FFFF00}Транспорт:\n");
				if(IsPlayerInAnyVehicle(plid))
				{
				    new Float:vhp;
				    GetVehicleHealth(GetPlayerVehicleID(plid), vhp);
					format(glstr, sizeof(glstr),"{FFFFFF}GUID текущего транспорта: {FFFF00}%d {FFFFFF}ХП: {FFFF00}%.0f\n", GetPlayerVehicleID(plid), vhp/10);
					strcat(body, glstr);
				}
				if(PIcar[plid][CarGUID] != INVALID_VEHICLE_ID)
				{
					format(glstr, sizeof(glstr),"{FFFFFF}GUID личного транспорта: {FFFF00}%d", PIcar[plid][CarGUID]);
					strcat(body, glstr);
				}
			}
			strcat(body, "\n\n{FFFF00}Наказания:\n");
			format(glstr, sizeof(glstr),"{FFFFFF}Кол-во заглушек: {FFFF00}%d", PIpen[plid][MuteCount]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}Кол-во попаданий в читмир: {FFFF00}%d", PIpen[plid][CheaterCount]);
			strcat(body, glstr);
			strcat(body, "\n\n{FFFF00}Последние действия:");
			format(glstr, sizeof(glstr),"\n{FFFFFF}1. %s", PI[plid][Event1]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}2. %s", PI[plid][Event2]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}3. %s", PI[plid][Event3]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}4. %s", PI[plid][Event4]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}5. %s", PI[plid][Event5]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}6. %s", PI[plid][Event6]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}7. %s", PI[plid][Event7]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}8. %s", PI[plid][Event8]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}9. %s", PI[plid][Event9]);
			strcat(body, glstr);
			format(glstr, sizeof(glstr),"\n{FFFFFF}10. %s", PI[plid][Event10]);
			strcat(body, glstr);
   			ShowPlayerDialog(playerid, D_STATS_ADMIN, DIALOG_STYLE_MSGBOX, title, body, "Выход", "");
		}
		return true;
	}

	else if(!strcmp(cmd, "/акзк", true))
	{
 		new plid, mctime, reason[64];
	    sscanf(params, "dds[64]", plid, mctime, reason);
		if(PI[playerid][Admin] < 500) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/акзк [ID] [время] [причина]");
		else
		{
			if(mctime < 0 || mctime > 2000000000) mctime = 2000000000;
			mysql_format(mysql1, query1, sizeof(query1), "SELECT `MuteCMD` FROM `penalty` WHERE `PlayerID` = '%d'", plid);        
			mysql_tquery(mysql1, query1, "MuteAccountCMD", "ddds", playerid, plid, mctime, reason); 
			//if(PI[playerid][Admin] < 500 && mctime > 300) mctime = 300;
			//else if(PI[playerid][Admin] < 700 && mctime > 36000) mctime = 36000;

		}
		return true;
	}

	else if(!strcmp(cmd, "/зк", true))
	{
 		new plid, mctime, reason[64];
	    sscanf(params, "dds[64]", plid, mctime, reason);
		if(PI[playerid][Admin] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя использовать эту команду");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/зк [ID] [время] [причина]");
	    else if(PI[playerid][Admin] <= PI[plid][Admin] && plid != playerid) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок администратор");
		else if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		else
		{
			if(mctime < 0 || mctime > 2000000000) mctime = 2000000000;
			//if(PI[playerid][Admin] < 500 && mctime > 300) mctime = 300;
			//else if(PI[playerid][Admin] < 700 && mctime > 36000) mctime = 36000;
		    if(mctime == 0)
		    {
				if(PI[playerid][Admin] < 700) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя снимать запрет на использвание команд и меню");
                if(PIpen[plid][MuteCMD] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игроку не запрещено использовать команды и меню");
		    	format(glstr, sizeof(glstr), "Админ %s [%d] снял запрет на использование команд и меню с %s [%d]", Name(playerid), playerid, Name(plid), plid);
			    SendClientMessageToAll(0x00FF00FF, glstr);
			    PIpen[plid][MuteCMD] = mctime;
				format(glstr, sizeof(glstr), "Админ %s [%d] снял запрет на использование команд и меню c %s [%d]", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID]);
			    alog(glstr, 0);
		    } else {
		    	if(PIpen[plid][MuteCMD] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игроку уже запрещено использовать команды и меню");
		    	if(emptyMessage(reason))
		    	{
			    	format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню %s [%d] на %s", Name(playerid), playerid, Name(plid), plid, MTF(mctime));
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню %s [%d] на %s, причина: %s", Name(playerid), playerid, Name(plid), plid, MTF(mctime), reason);
				}
			    SendClientMessageToAll(COLOR_ADMIN, glstr);
			    if(emptyMessage(reason))
		    	{
			    	format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню игроку %s [%d] на %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mctime));
				} else {
				    format(glstr, sizeof(glstr), "Админ %s [%d] запретил использовать команды и меню игроку %s [%d] на %s, причина: %s", Name(playerid), PI[playerid][ID], Name(plid), PI[plid][ID], MTF(mctime), reason);
				}
			    alog(glstr, 0);
			    PIpen[plid][MuteCMD] = mctime;
		    }
		}
		return true;
	}

	else if(!strcmp(cmd, "/об", true) || !strcmp(cmd, "/ad", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
		if(PI[playerid][PhoneNumber] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет телефона");
		else if(PI[playerid][PhoneBalance] < 10) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя не хватает денег на телефоне");
		else if(GetPVarInt(playerid, "Adv") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Подожди немного");
		else if(strlen(PI[playerid][Adv]) > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже отправлял объявление");
	    else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи текст");
		else if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
	    format(PI[playerid][Adv],64,"%s", params);
		SendClientMessage(playerid, 0x00FF00FF, "Ты отправил объявление");
		SetPVarInt(playerid, "Adv", 1);
		SetTimerEx("ClearAdv", 180000, false, "d", playerid);
		PI[playerid][PhoneBalance] -= 10;
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i) || i == playerid) continue;
			switch(PI[i][Faction])
			{
				case 7,8,9:
				{
					format(glstr,sizeof(glstr),"%s [%d] прислал объявление на проверку: %s", Name(playerid), playerid, PI[playerid][Adv]);
					SendClientMessage(i, 0x00FF00FF, glstr);
				}
			}
		}
	    return true;
	}

	else if(!strcmp(cmd, "/пр", true) || !strcmp(cmd, "/try", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
	    if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи текст");
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь"); 
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new chance = random(4);
		format(glstr, sizeof(glstr), "%s %s", Name(playerid), params);
		if(chance > 1)
		{
		    strcat(glstr, " {66CC00}| Удачно");
		} else {
		    strcat(glstr, " {FF6600}| Неудачно");
		}
		Do(playerid, glstr);
		return true;
	}

	else if(!strcmp(cmd, "/я", true) || !strcmp(cmd, "/me", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
	    if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи текст"); 
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь"); 
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
	    format(glstr,sizeof(glstr),"%s %s", Name(playerid), params);
		Do(playerid, glstr);
	    return true;
	}

	else if(!strcmp(cmd, "/do", true) || !strcmp(cmd, "/де", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
		if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи текст");
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь"); 
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
	    format(glstr,sizeof(glstr),"%s (%s)", params, Name(playerid));
		Do(playerid, glstr);
	    return true;
	}

	else if(strcmp(cmd, "/даун", true) == 0)
	{
		switch(random(2))
		{
			case 0:
			{
				format(glstr,sizeof(glstr),"%s даун", Name(playerid));
			    Do(playerid, glstr);
			}
			case 1:
			{
			    ResetPlayerMoney(playerid);
			    format(glstr,sizeof(glstr),"%s потерял все деньги", Name(playerid));
			    Do(playerid, glstr);
			}
			case 2:
			{
			    format(glstr,sizeof(glstr),"%s попытался украть у тебя деньги, но не смог потому, что даун", Name(playerid));
			    Do(playerid, glstr);
			}
		}
		return true;
	}

	else if(!strcmp(cmd, "/к", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
		if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи текст");
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь"); 
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		for(new i;i<PLAYERS;i++)
		{
			if(PlayerInRadius(playerid, i, 60.0))
			{
				format(glstr,sizeof(glstr),"%s {FFFFFF}(кричит): %s",Name(playerid),params);
				SendClientMessage(i, GetPlayerColor(playerid), glstr);
				AppAnim(playerid,"ON_LOOKERS", "shout_01",1000.0,0,0,0,0,0);
			} else {
				if(GetPVarInt(i, "ShowIC") == 1)
				{
					format(glstr,sizeof(glstr),"[Крик] %s [%d]: %s",Name(playerid),playerid,params);
					SendClientMessage(i, 0x417B1CFF, glstr);
				}
			}
		}
		return true;
	}

	else if(!strcmp(cmd, "/ш", true))
	{
		if(PIpen[playerid][MuteTime] > 0)
		{
			format(glstr, sizeof(glstr),"Тебе запрещено пользоваться чатом, осталось %s", MTF(PIpen[playerid][MuteTime]));
			return SendClientMessage(playerid, 0xFF0000FF, glstr);
		}
		if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи текст");
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь"); 
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		for(new i;i<PLAYERS;i++)
		{
			if(PlayerInRadius(playerid, i, 4.0))
			{
				format(glstr,sizeof(glstr),"%s (шепчет): %s",Name(playerid),params);
				SendClientMessage(i, 0xFFFFFFFF, glstr);
			} else {
				if(GetPVarInt(i, "ShowIC") == 1)
				{
					format(glstr,sizeof(glstr),"[Шепот] %s [%d]: %s",Name(playerid),playerid,params);
					SendClientMessage(i, 0x417B1CFF, glstr);
				}
			}
		}
		return true;
	}

	else if(!strcmp(cmd, "/смс", true))
	{
		if(PI[playerid][PhoneNumber] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет телефона");
		else if(PI[playerid][PhoneBalance] < 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает средств");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/смс [номер] [сообщение]");
		ReplaceID(params);
		if(CheckPR(params))
		{
			format(glstr,sizeof(glstr),"{FF0000}%s [%d] (подозрение на рекламу): %s", Name(playerid), playerid, params);
			SendAdminMessage(100, glstr, playerid);
			return SendClientMessage(playerid, 0xFF0000FF, "Подозрение на рекламу");
		}
		new plid, number, msg[64];
		sscanf(params, "ds[64]", number, msg);
		if(PI[playerid][PhoneNumber] == number) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не можешь отправлять смс себе");
		if(!IsNumberOnline(number)) return SendClientMessage(playerid, COLOR_SYSTEM, "Телефона с таким номером нет в сети");
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(PI[i][PhoneNumber] != number) continue;
			plid = i;
			break;
		}
		if(emptyMessage(msg)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не ввёл сообщение");
		format(glstr,sizeof(glstr),"{00FF00}СМС {FF8000}от %s [%d]: %s", Name(playerid), PI[playerid][PhoneNumber], msg);
		SendClientMessage(plid, -1, glstr);
		format(glstr,sizeof(glstr),"{00FF00}СМС {FFBB77}для %s [%d]: %s", Name(plid), PI[plid][PhoneNumber], msg);
		SendClientMessage(playerid, -1, glstr);
		SetPlayerChatBubble(playerid, "Отправил СМС", 0xFFFFFFFF, 10.0, 3000);
		PI[playerid][PhoneBalance] -= 5;
		for(new i;i<PLAYERS;i++)
		{
			if(GetPVarInt(i, "ShowIC") == 0) continue;
			if(i == plid || i == playerid) continue;
			format(glstr,sizeof(glstr),"[СМС] %s [%d] игроку %s [%d]: %s",Name(playerid),playerid,Name(plid),plid,msg);
			SendClientMessage(i, 0x417B1CFF, glstr);
			continue;
		}
		chatlog(playerid, msg, 7);
		return true;
	}

	else if(!strcmp(cmd, "/зв", true))
	{
		if(PI[playerid][PhoneNumber] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет телефона");
		else if(PI[playerid][PhoneBalance] < 20) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает средств");
		else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/зв [номер]");
		else if(GetPVarInt(playerid, "InSpec") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты наблюдаешь"); 
		new number,plid;
		sscanf(params, "d", number);
		if(PI[playerid][PhoneNumber] == number) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не можешь звонить себе");
		if(!IsNumberOnline(number)) return SendClientMessage(playerid, COLOR_SYSTEM, "Телефона с таким номером нет в сети");
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(PI[i][PhoneNumber] != number) continue;
			plid = i;
			break;
		}
		if(GetPVarInt(plid, "Calling") != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Занято");
		SendClientMessage(plid, -1, "К тебе входящий звонок, нажми N");
		SendClientMessage(playerid, -1, "Вызов отправлен");
		SetPVarInt(plid, "Caller", playerid);
		SetPVarInt(playerid, "InCall", plid);
		SetPVarInt(playerid, "Calling", 1);
		SetPVarInt(plid, "Calling", 1);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_USECELLPHONE);
		SetPlayerAttachedObject(playerid, 1, PI[playerid][PhoneObject], 6, 0.086043, 0.027719, 0.003817, 95.232246, 178.651031, 1.691840, 1.002077, 1.000000, 1.000000);
		return true;
	}

	if(!strcmp(cmd, "/mn", true) || !strcmp(cmd, "/mm", true) || !strcmp(cmd, "/help", true) || !strcmp(cmd, "/помощь", true) || !strcmp(cmd, "/меню", true) || !strcmp(cmd, "/menu", true))
	{
		if(PIpen[playerid][MuteCMD] > 0 || PIpen[playerid][Cheater] == 1)
		{
			AddDListItem(playerid, "{FF0000}Донат", MN_donate);
			ShowPlayerDList(playerid, MENU, "{FFFFFF}Главное меню", "Выбрать", "Выход");
		} else {
			if(PI[playerid][Admin] >= 100) AddDListItem(playerid, "Админка", MN_admin);
			AddDListItem(playerid, "{00FF00}Статистика", MN_stats);
			AddDListItem(playerid, "Навигатор", MN_gps);
			if(PI[playerid][PhoneNumber] != 0) AddDListItem(playerid, "Телефон", MN_phone);
			if(PI[playerid][Faction] != 0) AddDListItem(playerid, "Фракция", MN_frac);
			AddDListItem(playerid, "Информация", MN_inf);
			AddDListItem(playerid, "Настройки аккаунта", MN_options);
			if(PI[playerid][HealPacks] > 0) AddDListItem(playerid, "Использовать аптечку", MN_heal);
			AddDListItem(playerid, "{FFFF00}Связь с администрацией", MN_report);
			AddDListItem(playerid, "{FF0000}Донат", MN_donate);
			ShowPlayerDList(playerid, MENU, "{FFFFFF}Главное меню", "Выбрать", "Выход");
		}
		return true;
	}

	if(!strcmp(cmd, "/обпр", true))
	{
		if(PI[playerid][Faction] < 7 || PI[playerid][Faction] > 9) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не работник СМИ");
		else if(PI[playerid][Rank] < 2) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты пока не можешь редактировать объявления");
	    else if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/обпр [ID] [0 - отклонить | 1 - принять] [текст]");
	    new plid, opt, adv[70];
		sscanf(params, "dds[70]", plid, opt, adv);
		if(!strlen(PI[plid][Adv])) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не отправлял объявление");
	    else if(strlen(adv) > 70) return SendClientMessage(playerid, COLOR_SYSTEM, "Укороти редакцию");
		switch(opt)
		{
			case 0:
			{
				if(emptyMessage(adv)) return SendClientMessage(playerid, COLOR_SYSTEM, "Введи причину");
				format(glstr,sizeof(glstr), "%s отклонил твоё объявление, причина: %s", Name(playerid), adv);
				SendClientMessage(plid, -1, glstr);
				SendClientMessage(playerid, -1, "Ты отклонил объявление");
				for(new i;i<PLAYERS;i++)
				{
					if(!InGame(i) || i == playerid) continue;
					switch(PI[i][Faction])
					{
						case 7,8,9:
						{
							format(glstr,sizeof(glstr), "%s от %s", PI[plid][Adv], GetName(plid, true));
							SendClientMessage(i, 0xFF8951FF, glstr);
							format(glstr,sizeof(glstr), "%s, %s %s отклонил, причина: %s", fName[PI[playerid][Faction]], GetRank(playerid), Name(playerid), adv);
							SendClientMessage(i, 0xFF8951FF, glstr);
						}
					}
				}
			}
			case 1:
			{
				if(emptyMessage(adv))
				{
					format(glstr,sizeof(glstr), "%s. Контакт: %s, телефон: %d", PI[plid][Adv], Name(plid), PI[plid][PhoneNumber]);
					SendClientMessageToAll(0xFF8951FF, glstr);
					format(glstr,sizeof(glstr), "Объявление проверил %s, %s %s", fName[PI[playerid][Faction]], GetRank(playerid), Name(playerid));
					SendClientMessageToAll(0xFF8951FF, glstr);
				} else {
					format(glstr,sizeof(glstr), "%s. Контакт: %s, телефон: %d", adv, Name(plid), PI[plid][PhoneNumber]);
					SendClientMessageToAll(0xFF8951FF, glstr);
					format(glstr,sizeof(glstr), "Объявление отредактировал %s, %s %s", fName[PI[playerid][Faction]], GetRank(playerid), Name(playerid));
					SendClientMessageToAll(0xFF8951FF, glstr);
				}
			}
		}
		format(PI[plid][Adv],64,"");
		PI[playerid][Bank] += 10;
	    return true;
	}

	else if(!strcmp(cmd, "/и", true))
	{
		if(emptyMessage(params)) return SendClientMessage(playerid, COLOR_SYSTEM, "/и [ID]");
		new plid;
		sscanf(params, "d", plid);
		if(playerid == plid) return OnPlayerCommandText(playerid, "/mn");
		SetPVarInt(playerid, "ClickedPlayer", plid);
		if(!InGame(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Такого игрока нет");
		ShowPlayerMenu(plid, playerid);
	    return true;
	}

    else if(!strcmp(cmd, "/менюдома", true))
    {
        if(OnHouseEnter(playerid) == 0) return false;
        if(OnHouseEnter(playerid) != PI[playerid][House] && PI[playerid][House] != 0) return ShowPlayerDialog(playerid, D_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Меню дома", "{FFFF00}У тебя уже есть дом", "Выход", "");
		new hid;
		hid = GetPVarInt(playerid, "MenuHouse");
		if(HI[hid][Owner] == 0) AddDListItem(playerid, "Купить", H_buy);
		if(PI[playerid][Renter] == 0 && PI[playerid][House] == 0) AddDListItem(playerid, "Арендовать", H_rent);
		if(PI[playerid][Renter] == 1 && PI[playerid][House] == hid) AddDListItem(playerid, "Выселиться", H_unrent);
		if(HI[hid][CostSell] > 0 && PI[playerid][House] == 0) AddDListItem(playerid, "Купить у владельца", H_obuy);
		if(HI[hid][Owner] == PI[playerid][ID])
		{
			AddDListItem(playerid, "Продать", H_sell);
			AddDListItem(playerid, "Стоимость аренды", H_rentcost);
			AddDListItem(playerid, "Домашний сейф", H_safe);
			if(HI[hid][Locked]) AddDListItem(playerid, "Открыть дом", H_unlock);
			if(!HI[hid][Locked]) AddDListItem(playerid, "Закрыть дом", H_lock);
			AddDListItem(playerid, "Установить имя для дома", H_label);
			if(HI[hid][CostSell] > 0) AddDListItem(playerid, "Снять с продажи", H_unsell);
			if(HI[hid][CostSell] == 0) AddDListItem(playerid, "Выставить дом на продажу", H_tosell);
		}
		ShowPlayerDList(playerid, D_HOUSE, "{FFFFFF}Меню дома", "Выбрать", "Выход");
        return true;
    }
	return SendClientMessage(playerid, -1, "Такой команды не существует");
}

public OnPlayerEnterVehicle(playerid, vehicleid, ispassenger)
{
	if(GetPVarInt(playerid, "HandBlock") == 1)
	{
		SendClientMessage(playerid, COLOR_SYSTEM, "Ты в наручниках");
		ClearAnimations(playerid);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CUFFED);
	}
	if(CarLocked[vehicleid] && ispassenger) ClearAnimations(playerid);
	return true;
}

public OnPlayerExitVehicle(playerid, vehicleid)
{
	if(GetPVarInt(playerid, "IsOnJob") == 1) EndJobTimer[playerid] = SetTimerEx("EndJob", 10000, false, "d", playerid);
	return true;
}

public OnPlayerStateChange(playerid, newstate, oldstate)
{
	if(oldstate == PLAYER_STATE_DRIVER)
	{
		PlayerTextDrawHide(playerid, SpeedNameCar[playerid]);
		PlayerTextDrawHide(playerid, FuelCarLabel[playerid]);
		PlayerTextDrawHide(playerid, FuelCarLevel[playerid]);
		PlayerTextDrawHide(playerid, HPCar[playerid]);
		PlayerTextDrawHide(playerid, LockedCar[playerid]);
		PlayerTextDrawHide(playerid, SpeedCarLabel[playerid]);
		PlayerTextDrawHide(playerid, SpeedCar[playerid]);
		TextDrawHideForPlayer(playerid, SpeedCarBox);
		VehUsed[PI[playerid][LastCar]] = false;
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(GetPVarInt(i, "SpecID") == playerid) PlayerSpectatePlayer(i, playerid);
		}
		if(GetPVarInt(playerid, "InPoliceCar") != 0)
		{
			if(IsSeatTaken(GetPVarInt(playerid, "InPoliceCar"), 3))
			{
				PutPlayerInVehicle(playerid, GetPVarInt(playerid, "InPoliceCar"), 3);
			} else {
				PutPlayerInVehicle(playerid, GetPVarInt(playerid, "InPoliceCar"), 4);
			}
		}
		if(GetPVarInt(playerid, "InReportage") == 1) 
		{
			SetPVarInt(playerid, "InReportage", 0);
			SendClientMessage(playerid, -1, "Репортаж окончен");
		}
		if(GetPVarInt(playerid, "iViewing") != 0)
		{
			SetPVarInt(playerid, "iViewing", 0);
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i) || GetPVarInt(i, "iViewer") != playerid) continue;
				SetPVarInt(i, "iViewing", 0);
				SetPVarInt(i, "iViewer", PLAYERS);
				SendClientMessage(i, -1, "Интервью окончено");
				break;
			}
			SendClientMessage(playerid, -1, "Интервью окончено");
		}
	}
	else if(oldstate == PLAYER_STATE_PASSENGER)
	{
		if(GetPVarInt(playerid, "iViewing") != 0)
		{
			SetPVarInt(playerid, "iViewing", 0);
			SetPVarInt(GetPVarInt(playerid, "iViewer"), "iViewing", 0);
			SetPVarInt(playerid, "iViewer", PLAYERS);
			SendClientMessage(playerid, -1, "Интервью окончено");
		}
	}
	if(newstate == PLAYER_STATE_PASSENGER)
	{
		CheckPlayerSeat(playerid);
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(GetPlayerVehicleID(i) != GetPlayerVehicleID(playerid)) continue;
			if(GetPVarInt(i, "IsOnJob") == 0) continue;
			if(PI[i][Job] == 2)
			{
				removePlayerMoney(playerid, GetPVarInt(i, "BusCost"));
				givePlayerMoney(i, GetPVarInt(i, "BusCost"));
				break;
			}
		}
	}
	if(newstate == PLAYER_STATE_DRIVER)
	{
		new vid = GetPlayerVehicleID(playerid);
		VehUsed[vid] = true;
		for(new i;i<PLAYERS;i++)
		{
			if(!InGame(i)) continue;
			if(GetPVarInt(i, "SpecID") == playerid) PlayerSpectateVehicle(i, vid);
			break;
		}
		if(GetPlayerVehicleSeat(playerid) == 0)
		{
			if(IsBike(vid)) SetVehicleParamsEx(vid, true, lights, alarm, doors, bonnet, boot, objective), Engine[vid] = true;
			TextDrawShowForPlayer(playerid, SpeedCarBox);
			if(PI[playerid][LastCar] != INVALID_VEHICLE_ID)
			{
				CarLocked[PI[playerid][LastCar]] = false;
				GetVehicleParamsEx(PI[playerid][LastCar], engine, lights, alarm, doors, bonnet, boot, objective);
				SetVehicleParamsEx(PI[playerid][LastCar], engine, lights, alarm, CarLocked[PI[playerid][LastCar]], bonnet, boot, objective);
			}
			PI[playerid][LastCar] = vid;
			if(!IsBike(vid))
			{
				PlayerTextDrawShow(playerid, FuelCarLabel[playerid]);
				PlayerTextDrawShow(playerid, FuelCarLevel[playerid]);
				PlayerTextDrawShow(playerid, HPCar[playerid]);
				if(PI[playerid][Level] == 1 && PI[playerid][Exp] == 0) GameTextForPlayer(playerid, RTP("~w~Управление  двигателеМ ~y~Ctrl"), 3000, 4);
			}
			PlayerTextDrawShow(playerid, LockedCar[playerid]);
			PlayerTextDrawSetString(playerid, LockedCar[playerid], RTP("~g~ОТКРЫТО"));
			PlayerTextDrawShow(playerid, SpeedNameCar[playerid]);
			PlayerTextDrawShow(playerid, SpeedCarLabel[playerid]);
			PlayerTextDrawShow(playerid, SpeedCar[playerid]);
			if(IsLICcar(playerid))
			{
				if(GetPVarInt(playerid, "InLic") == 0) return RemovePlayerFromVehicle(playerid);
				else if(GetPVarInt(playerid, "InLic") == 1) return TogglePlayerDynamicRaceCP(playerid, LicWayCP[0], true);
			}
			if(PI[playerid][DriveLicence] == 0 && !IsBike(vid) && GetVehicleModel(vid) != 462)
			{
				SendClientMessage(playerid, COLOR_SYSTEM, "Чтобы водить машину, тебе необходимо получить водительское удостоверение");
				return RemovePlayerFromVehicle(playerid);
			}
			for(new i;i<sizeof(LSPDcars);i++)
			{
				if(vid != LSPDcars[i]) continue;
				if(PI[playerid][Faction] == 4) {
					if(PI[playerid][Rank] < 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LSPDcars[14] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LSPDcars[0] && PI[playerid][Rank] < 7 || vid == LSPDcars[4] && PI[playerid][Rank] < 7) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(SFPDcars);i++)
			{
				if(vid != SFPDcars[i]) continue;
				if(PI[playerid][Faction] == 5) {
					if(PI[playerid][Rank] < 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == SFPDcars[18] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == SFPDcars[9] && PI[playerid][Rank] < 7 || vid == SFPDcars[17] && PI[playerid][Rank] < 7) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(LVPDcars);i++)
			{
				if(vid != LVPDcars[i]) continue;
				if(PI[playerid][Faction] == 6) {
					if(PI[playerid][Rank] < 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LVPDcars[30] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LVPDcars[9] && PI[playerid][Rank] < 7 || vid == LVPDcars[17] && PI[playerid][Rank] < 7) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}

			for(new i;i<sizeof(LSHPcars);i++)
			{
				if(vid != LSHPcars[i]) continue;
				if(PI[playerid][Faction] == 1) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LSHPcars[5] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(SFHPcars);i++)
			{
				if(vid != SFHPcars[i]) continue;
				if(PI[playerid][Faction] == 2) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == SFHPcars[24] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(LVHPcars);i++)
			{
				if(vid != LVHPcars[i]) continue;
				if(PI[playerid][Faction] == 3) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LVHPcars[5] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}

			for(new i;i<sizeof(LSNcars);i++)
			{
				if(vid != LSNcars[i]) continue;
				if(PI[playerid][Faction] == 7) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LSNcars[5] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(SFNcars);i++)
			{
				if(vid != SFNcars[i]) continue;
				if(PI[playerid][Faction] == 8) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == SFNcars[5] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(LVNcars);i++)
			{
				if(vid != LVNcars[i]) continue;
				if(PI[playerid][Faction] == 9) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == LVNcars[5] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}

			for(new i;i<sizeof(SVcars);i++)
			{
				if(vid != SVcars[i]) continue;
				if(PI[playerid][Faction] == 10) {
					if(PI[playerid][Rank] < 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == SVcars[0])
					{
						if(PI[playerid][Rank] < 9) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					}
					else if(vid == SVcars[1] || vid == SVcars[2])
					{
						if(PI[playerid][Rank] < 7) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					}
					else if(vid == SVcars[3] || vid == SVcars[4] || vid == SVcars[5])
					{
						if(PI[playerid][Rank] < 5) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					}
					else if(vid == SVcars[6] || vid == SVcars[7] || vid == SVcars[8] || vid == SVcars[9])
					{
						if(PI[playerid][Rank] < 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					}
					else if(vid == SVcars[10] || vid == SVcars[11] || vid == SVcars[12] || vid == SVcars[13] || vid == SVcars[14])
					{
						if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					}
					else if(vid == SVcars[15])
					{
						if(PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					}
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(VMFcars);i++)
			{
				if(vid != VMFcars[i]) continue;
				if(PI[playerid][Faction] == 11) {
					if(PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == VMFcars[0] && PI[playerid][Rank] < 6) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == VMFcars[1] && PI[playerid][Rank] < 4 || vid == VMFcars[2] && PI[playerid][Rank] < 4 || vid == VMFcars[3] && PI[playerid][Rank] < 4 || vid == VMFcars[4] && PI[playerid][Rank] < 4) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			for(new i;i<sizeof(VVScars);i++)
			{
				if(vid != VVScars[i]) continue;
				if(PI[playerid][Faction] == 12) {
					if(PI[playerid][Rank] < 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт1");
					else if(vid == VVScars[0] && PI[playerid][Rank] < 5) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == VVScars[1] && PI[playerid][Rank] < 5 || vid == VVScars[2] && PI[playerid][Rank] < 8 || vid == VVScars[3] && PI[playerid][Rank] < 8 || vid == VVScars[14] && PI[playerid][Rank] < 9 || vid == VVScars[9] && PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
					else if(vid == VVScars[10] && PI[playerid][Rank] < 3 || vid == VVScars[11] && PI[playerid][Rank] < 3 || vid == VVScars[12] && PI[playerid][Rank] < 3 || vid == VVScars[13] && PI[playerid][Rank] < 3) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				} else return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
			}
			if(GetPVarInt(playerid, "IsOnJob") == 1) 
			{
				if(PI[playerid][Job] == 1 && IsTAXIcar(playerid) || PI[playerid][Job] == 2 && IsBUScar(playerid)) KillTimer(EndJobTimer[playerid]);
			}
			for(new i;i<sizeof(TaxiCars);i++)
			{
				if(vid != TaxiCars[i]) continue;
				if(PI[playerid][Job] != 1) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				break;
			}
			for(new i;i<sizeof(Bus);i++)
			{
				if(vid != Bus[i]) continue;
				if(PI[playerid][Job] != 2) return RemovePlayerFromVehicle(playerid), SendClientMessage(playerid, COLOR_SYSTEM, "Ты не имеешь права использовать этот транспорт");
				break;
			}
		}
	}
	return true;
}

public OnPlayerEnterCheckpoint(playerid)
{
	if(GetPVarInt(playerid,"InGPS") == 1) DisablePlayerCheckpoint(playerid), SetPVarInt(playerid,"InGPS", 0);
	return true;
}

public OnPlayerEnterDynamicCP(playerid, checkpointid)
{
	if(checkpointid == EatCP[0])
	{
		ShowPlayerDialog(playerid, D_EAT, DIALOG_STYLE_MSGBOX, "{FFFFFF}Закусочная", "{FFFFFF}Взять еду?\nСтоимость: {FFFF00}50$", "Да", "Нет");
	}
	else if(checkpointid == CP247[0])
	{
		ShowMenu(playerid, D_247);
	}
	else if(checkpointid == HealCP[0] || checkpointid == HealCP[1])
	{
		ShowMenu(playerid, D_HEAL);
	}
	else if(checkpointid == PackerCP[0])
	{
	    SetPVarInt(playerid, "Packed", 1);
	    SetPVarInt(playerid, "PackedTime", 15);
		ClearAnimations(playerid);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
	  	SetPlayerAttachedObject(playerid, 2, 2060, 5, 0.01, 0.1, 0.2, 100, 10, 85);
    	TogglePlayerDynamicCP(playerid, PackerCP[0], false);
    	TogglePlayerDynamicCP(playerid, PackerCP[1], true);
	}
	else if(checkpointid == PackerCP[1])
	{
		if(GetPVarInt(playerid, "PackedTime") > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Слишком быстро");
		SetPVarInt(playerid, "Packed", 0);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
		SetPVarInt(playerid, "PackerCount",GetPVarInt(playerid, "PackerCount")+1);
		if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);
		format(glstr, sizeof(glstr), "Перетащено мешков: {00FF00}%d",GetPVarInt(playerid, "PackerCount"));
		SendClientMessage(playerid, -1, glstr);
    	TogglePlayerDynamicCP(playerid, PackerCP[1], false);
    	TogglePlayerDynamicCP(playerid, PackerCP[0], true);
	}
	else if(checkpointid == WooderCP[1] || checkpointid == WooderCP[2] || checkpointid == WooderCP[3])
	{
		TogglePlayerControllable(playerid, false);
		ClearAnimations(playerid);
		ApplyAnimationEx(playerid, "CHAINSAW", "WEAPON_csaw", 4.0, 1, 0, 0, 0, 0);
		SetTimerEx("GiveWood", 5000, false, "d", playerid);
	}
	else if(checkpointid == WooderCP[0])
	{
		SetPVarInt(playerid, "Packed", 0);
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
		SetPVarInt(playerid, "AllWood", GetPVarInt(playerid, "AllWood")+GetPVarInt(playerid, "Wood"));
		SetPVarInt(playerid, "Wood", 0);
		if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);
    	TogglePlayerDynamicCP(playerid, WooderCP[0], false);
    	TogglePlayerDynamicCP(playerid, WooderCP[random(2)+1], true);
	}
	else if(checkpointid == MinerCP[0] || checkpointid == MinerCP[1])
	{
		SetPVarInt(playerid, "Metal", random(20)+10);
		TogglePlayerControllable(playerid, false);
		ClearAnimations(playerid);
		ApplyAnimationEx(playerid, "SWORD", "sword_4", 4.0, 1, 0, 0, 0, 0);
		SetTimerEx("GiveMetal", 5000, false, "db", playerid, false);
	}
	else if(checkpointid == MinerCP[2])
	{
		SetPVarInt(playerid, "Metal", random(30)+20);
		TogglePlayerControllable(playerid, false);
		ClearAnimations(playerid);
		ApplyAnimationEx(playerid, "SWORD", "sword_4", 4.0, 1, 0, 0, 0, 0);
		SetTimerEx("GiveMetal", 5000, false, "db", playerid, false);
	}
	else if(checkpointid == MinerCP[3] || checkpointid == MinerCP[4])
	{
		SetPVarInt(playerid, "Metal", random(70)+30);
		TogglePlayerControllable(playerid, false);
		ClearAnimations(playerid);
		ApplyAnimationEx(playerid, "SWORD", "sword_4", 4.0, 1, 0, 0, 0, 0);
		SetTimerEx("GiveMetal", 5000, false, "db", playerid, true);
	}
	else if(checkpointid == MinerCP[5])
	{
		if(GetPVarInt(playerid, "Packed") == 1)
		{
			SetPVarInt(playerid, "Packed", 0);
			SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
			SetPVarInt(playerid, "AllMetal", GetPVarInt(playerid, "AllMetal")+GetPVarInt(playerid, "Metal"));
			SetPVarInt(playerid, "Metal", 0);
			format(glstr, sizeof(glstr), "Добыл всего руды: {00FF00}%d кг",GetPVarInt(playerid, "AllMetal"));
			SendClientMessage(playerid, -1, glstr);
			if(IsPlayerAttachedObjectSlotUsed(playerid,2)) RemovePlayerAttachedObject(playerid,2);
			SetPlayerAttachedObject(playerid, 4, 18634, 6, 0.078222, 0.000000, 0.110844, 298.897308, 264.126861, 193.350555, 1.000000, 1.000000, 1.000000);
			TogglePlayerDynamicCP(playerid, MinerCP[5], false);
			new r = random(4);
			TogglePlayerDynamicCP(playerid, MinerCP[r], true);
		}
	}
	else if(checkpointid == CP_112[playerid])
	{
		switch(PI[playerid][Faction])
		{
			case 1,2,3: if(!IsHPcar(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не в машине скорой помощи");
			case 4,5,6: if(!IsPDcar(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не в машине полиции");
		}
		TogglePlayerDynamicCP(playerid, CP_112[playerid], false);
		DestroyDynamicCP(CP_112[playerid]);
		if(IsTAXIcar(playerid)) SetPVarInt(playerid, "TaxiDriver", 0);
		SendClientMessage(playerid, 0x00FF00FF, "Ты приехал на вызов");
	}
	else if(checkpointid == CP_HOUSE[playerid])
	{
		DestroyDynamicCP(CP_HOUSE[playerid]);
	}
	return true;
}

public OnPlayerLeaveDynamicCP(playerid, checkpointid)
{

	return true;
}

public OnPlayerLeaveCheckpoint(playerid)
{
	return true;
}

public OnPlayerEnterDynamicRaceCP(playerid, checkpointid)
{
	for(new i;i<sizeof(BusWay1CP);i++)
	{
		if(checkpointid == BusWay1CP[i])
		{
			for(new b;b<sizeof(Bus);b++)
			{
				if(GetPlayerVehicleID(playerid) != Bus[b])
				{
					continue;
				} else {
					TogglePlayerDynamicRaceCP(playerid, BusWay1CP[i], false);
					if(i == sizeof(BusWay1CP)-1)
					{
						givePlayerMoney(playerid, 4650);
						SendClientMessage(playerid, -1, "За пройденный маршрут ты получаешь {00FF00}$4650");
						TogglePlayerDynamicRaceCP(playerid, BusWay1CP[0], true);
					} else {
						TogglePlayerDynamicRaceCP(playerid, BusWay1CP[i+1], true);
					}
					switch(i)
					{
						case 0,7,14,20,25,27,38,41,45,49:
						{
							TogglePlayerControllable(playerid, false);
							SendClientMessage(playerid, -1, "Остановка, жди...");
							SetTimerEx("OnKeysBus", 10000, false, "d", playerid);
						}
					}
					break;
				}
			}
			break;
		}
	}
	for(new i;i<sizeof(BusWay2CP);i++)
	{
		if(checkpointid == BusWay2CP[i])
		{
			TogglePlayerDynamicRaceCP(playerid, BusWay2CP[i], false);
			if(i == sizeof(BusWay2CP)-1)
			{
				givePlayerMoney(playerid, 3790);
				SendClientMessage(playerid, -1, "За пройденный маршрут ты получаешь {00FF00}$3790");
				TogglePlayerDynamicRaceCP(playerid, BusWay2CP[0], true);
			} else {
				TogglePlayerDynamicRaceCP(playerid, BusWay2CP[i+1], true);
			}
			switch(i)
			{
				case 0,6,12,22,27,36:
				{
					TogglePlayerControllable(playerid, false);
					SendClientMessage(playerid, -1, "Остановка, жди...");
					SetTimerEx("OnKeysBus", 10000, false, "d", playerid);
				}
			}
			break;
		}
	}
	for(new i;i<sizeof(BusWay3CP);i++)
	{
		if(checkpointid == BusWay3CP[i])
		{
			TogglePlayerDynamicRaceCP(playerid, BusWay3CP[i], false);
			if(i == sizeof(BusWay3CP)-1)
			{
				givePlayerMoney(playerid, 3910);
				SendClientMessage(playerid, -1, "За пройденный маршрут ты получаешь {00FF00}$3910");
				TogglePlayerDynamicRaceCP(playerid, BusWay3CP[0], true);
			} else {
				TogglePlayerDynamicRaceCP(playerid, BusWay3CP[i+1], true);
			}
			switch(i)
			{
				case 0,11,32,46,56:
				{
					TogglePlayerControllable(playerid, false);
					SendClientMessage(playerid, -1, "Остановка, жди...");
					SetTimerEx("OnKeysBus", 10000, false, "d", playerid);
				}
			}
			break;
		}
	}
	for(new i;i<sizeof(BusWay4CP);i++)
	{
		if(checkpointid == BusWay4CP[i])
		{
			TogglePlayerDynamicRaceCP(playerid, BusWay4CP[i], false);
			if(i == sizeof(BusWay4CP)-1)
			{
				givePlayerMoney(playerid, 6730);
				SendClientMessage(playerid, -1, "За пройденный маршрут ты получаешь {00FF00}$6730");
				TogglePlayerDynamicRaceCP(playerid, BusWay4CP[0], true);
			} else {
				TogglePlayerDynamicRaceCP(playerid, BusWay4CP[i+1], true);
			}
			switch(i)
			{
				case 0, 3,8,10,15,18,22,27,29,32,40,43,50,57,60,65,89,93,97,102:
				{
					TogglePlayerControllable(playerid, false);
					SendClientMessage(playerid, -1, "Остановка, жди...");
					SetTimerEx("OnKeysBus", 10000, false, "d", playerid);
				}
			}
			break;
		}
	}
	for(new i;i<sizeof(LicWayCP);i++)
	{
		if(checkpointid == LicWayCP[i] && GetPVarInt(playerid, "InLic") == 1)
		{
			TogglePlayerDynamicRaceCP(playerid, LicWayCP[i], false);
			if(i == sizeof(LicWayCP)-1)
			{
				SetPVarInt(playerid, "InLic", 0);
				PI[playerid][DriveLicence] = 1;
				SendClientMessage(playerid, 0x00FF00FF, "Ты получил водительское удостоверение");
				SetVehicleToRespawn(GetPlayerVehicleID(playerid));
			} else {
				TogglePlayerDynamicRaceCP(playerid, LicWayCP[i+1], true);
			}
			break;
		}
	}
	return true;
}

public OnPlayerLeaveDynamicRaceCP(playerid, checkpointid)
{
	return true;
}

public OnRconCommand(cmd[])
{
	new cmdtext[20], params[96];
	sscanf(cmd, "s[20]s[96]", cmdtext, params);
	if(!strcmp(cmdtext, "restart", true))
	{
		OnPlayerCommandText(MAX_PLAYERS, "/рестарт");
	}
	return true;
}

public OnPlayerRequestSpawn(playerid)
{
    if(GetPVarInt(playerid, "Logged") == 0) return false;
	return true;
}

public OnObjectMoved(objectid)
{
	return true;
}

public OnPlayerObjectMoved(playerid, objectid)
{
	return true;
}

public OnPlayerEditDynamicObject(playerid, objectid, response, Float:x, Float:y, Float:z, Float:rx, Float:ry, Float:rz)
{
	if(response == 1)
	{
		ShowPlayerDialog(playerid, DIALOG_SAVE_1, DIALOG_STYLE_MSGBOX, "Объект изменён",\
		"Желаете ли вы сохранить объект в файл?\n\nФайл с объектами находится в {FFFFFF}scriptfiles/soe/*.txt",\
		"Сохранить...","Отмена");
		O[foX] = x;
		O[foY] = y;
		O[foZ] = z;
		O[roX] = rx;
		O[roY] = ry;
		O[roZ] = rz;
	}
	MoveDynamicObject(objectid, x,y,z,1.0,rx,ry,rz);
	return true;
}

public OnPlayerSelectDynamicObject(playerid, objectid, modelid, Float:x, Float:y, Float:z)
{

	ShowPlayerDialog(playerid, DIALOG_SELECT, DIALOG_STYLE_MSGBOX,"Действие с объектом", \
	"Выберите действие с объектом\nВы можете его отредактировать или удалить","Изменить","Удалить");
	SetPVarInt(playerid, "SelectedObject", objectid);
	SetPVarInt(playerid, "ModelID", modelid);
    return true;
}

public OnPlayerPickUpPickup(playerid, pickupid){return false;}
public OnPlayerPickUpDynamicPickup(playerid, pickupid)
{
	GetPlayerPos(playerid, PI[playerid][X],PI[playerid][Y],PI[playerid][Z]);
	if(GetPVarInt(playerid, "OnPickUp") > 0) return false;
	SetPVarInt(playerid, "OnPickUp", 2);
	if(pickupid == EnterCarShop[0]) if(PIcar[playerid][CarID] != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Чтобы купить новый транспорт, нужно продать старый");
	if(pickupid == spawnhelp) ShowMenu(playerid, D_HELP);
	if(pickupid == spawneat)
	{
		if(PI[playerid][Level] > 1) return false;
		else if(PI[playerid][Eat] + 20 > 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не голоден");
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
		SetPlayerAttachedObject(playerid, 5, 2219, 1, 0.096313, 0.334523, -0.267872, 109.200798, 122.924514, 313.923736, 1.025472, 1.000000, 1.000000 );
		SetPVarInt(playerid, "Eating", 1);
	}
	if(pickupid == works)
	{
		if(PI[playerid][DriveLicence] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Сначала тебе нужно получить водительское удостоверение в автошколе");
		new body[128];
		strcat(body, "{FFFFFF}Водитель такси\t{FFFF00}[2 уровень]");
		strcat(body, "\n{FFFFFF}Водитель автобуса\t{FFFF00}[3 уровень]");
		if(PI[playerid][Job] == 0) ShowPlayerDialog(playerid, D_WORK, DIALOG_STYLE_LIST, "{FFFFFF}Работа", body, "Выбрать", "Выход");
		else ShowPlayerDialog(playerid, D_WORK, DIALOG_STYLE_MSGBOX, "{FFFFFF}Работа", "{FFFFFF}Уволиться с работы?", "Да", "Нет");
	}
	for(new i;i<sizeof(EnterMeria);i++)
	{
		if(pickupid == EnterMeria[i])
		{
			if(i == 0)
			{
				SetPlayerInterior(playerid, 0);
				switch(GetPlayerVirtualWorld(playerid))
				{
					case 1: SetPlayerPos(playerid, MeriaEnter[1][0], MeriaEnter[1][1], MeriaEnter[1][2]);
					case 2: SetPlayerPos(playerid, MeriaEnter[2][0], MeriaEnter[2][1], MeriaEnter[2][2]);
					case 3: SetPlayerPos(playerid, MeriaEnter[3][0], MeriaEnter[3][1], MeriaEnter[3][2]);
				}
				SetPlayerVirtualWorld(playerid, 0);
			} else {
				SetPlayerPos(playerid, MeriaEnter[0][0], MeriaEnter[0][1], MeriaEnter[0][2]);
				SetPlayerInterior(playerid, 3);
				SetPlayerVirtualWorld(playerid, i);
			}
			break;
		}
	}
	if(pickupid == MeriaPassport)
	{
	    if(PI[playerid][Passport] == 1)
		{
			ShowPlayerDialog(playerid, D_PASSPORT, DIALOG_STYLE_MSGBOX, "{FFFFFF}Паспорт", "{FFFF00}Ты хочешь поменять свой паспорт за $30000?", "Да", "Нет");
		} else {
			ShowPlayerDialog(playerid, D_PASSPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Паспорт", "{FFFF00}Введи дату рождения своего персонажа", "Далее", "Выход");
		}
	}
	for(new i;i<sizeof(EnterArms);i++)
	{
		if(pickupid == EnterArms[i])
		{
			if(i == 0)
			{
				SetPlayerInterior(playerid, 0);
				switch(GetPlayerVirtualWorld(playerid))
				{
					case 1: SetPlayerPos(playerid, ArmsEnter[1][0], ArmsEnter[1][1], ArmsEnter[1][2]), SetPlayerFacingAngle(playerid, ArmsEnter[1][3]);
					case 2: SetPlayerPos(playerid, ArmsEnter[2][0], ArmsEnter[2][1], ArmsEnter[2][2]), SetPlayerFacingAngle(playerid, ArmsEnter[2][3]);
					case 3: SetPlayerPos(playerid, ArmsEnter[3][0], ArmsEnter[3][1], ArmsEnter[3][2]), SetPlayerFacingAngle(playerid, ArmsEnter[3][3]);
				}
				SetPlayerVirtualWorld(playerid, 0);
			} else {
				if(PI[playerid][Faction] != 9+i) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
				SetPlayerInterior(playerid, 1);
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, ArmsEnter[0][0], ArmsEnter[0][1], ArmsEnter[0][2]+1.25);
				SetPlayerFacingAngle(playerid, ArmsEnter[0][3]);
			}
			break;
		}
	}
	if(pickupid == ArmsEat[0])
	{
		if(PI[playerid][Eat] + 20 > 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не голоден");
		SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
		SetPlayerAttachedObject(playerid, 5, 2219, 1, 0.096313, 0.334523, -0.267872, 109.200798, 122.924514, 313.923736, 1.025472, 1.000000, 1.000000 );
		SetPVarInt(playerid, "Eating", 3);
	}
	if(pickupid == ArmsWeap[0])
	{
		new wp, ammo;
		GetPlayerWeaponData(playerid, 2, wp, ammo);
		if(wp != 24 || ammo == 0) givePlayerWeapon(playerid, 24, 30);
		PlayerPlaySound(playerid, 36401, 1028.1484,17.8697,957.2468);
	}
	if(pickupid == ArmsWeap[1])
	{
		new wp, ammo;
		GetPlayerWeaponData(playerid, 5, wp, ammo);
		if(ammo != 0) givePlayerWeapon(playerid, 30, -ammo);
		givePlayerWeapon(playerid, 30, 100);
		PlayerPlaySound(playerid, 36401, 1028.1517,19.3666,957.2468);
	}
	if(pickupid == ArmsWeap[2])
	{
		new wp, ammo;
		GetPlayerWeaponData(playerid, 5, wp, ammo);
		if(ammo != 0) givePlayerWeapon(playerid, 31, -ammo);
		givePlayerWeapon(playerid, 31, 100);
		PlayerPlaySound(playerid, 36401, 1028.1898,21.5399,957.2468);
	}
	if(pickupid == ArmsWeap[3])
	{
		if(PI[playerid][Armor] < 10) setPlayerArmour(playerid, 100.0);
	}
	for(new i;i<sizeof(EnterHospital);i++)
	{
		if(pickupid == EnterHospital[i])
		{
			if(i == 0)
			{
				if(PI[playerid][Health] < 50) return SendClientMessage(playerid, -1, "Тебе нужно подлечиться (подойди к кровати и нажми F или Enter)");
				SetPlayerInterior(playerid, 0);
				switch(GetPlayerVirtualWorld(playerid))
				{
					case 1: SetPlayerPos(playerid, HospitalEnter[1][0], HospitalEnter[1][1], HospitalEnter[1][2]), SetPlayerFacingAngle(playerid, HospitalEnter[1][3]);
					case 2: SetPlayerPos(playerid, HospitalEnter[2][0], HospitalEnter[2][1], HospitalEnter[2][2]), SetPlayerFacingAngle(playerid, HospitalEnter[2][3]);
					case 3: SetPlayerPos(playerid, HospitalEnter[3][0], HospitalEnter[3][1], HospitalEnter[3][2]), SetPlayerFacingAngle(playerid, HospitalEnter[3][3]);
				}
				SetPlayerVirtualWorld(playerid, 0);
				TogglePlayerDynamicCP(playerid, HealCP[1], false);
			}
			else if(i == 4)
			{
				if(PI[playerid][Health] < 50) return SendClientMessage(playerid, -1, "Тебе нужно подлечиться (подойди к кровати и нажми F или Enter)");
				SetPlayerInterior(playerid, 0);
				switch(GetPlayerVirtualWorld(playerid))
				{
					case 1: SetPlayerPos(playerid, HospitalEnter[5][0], HospitalEnter[5][1], HospitalEnter[5][2]), SetPlayerFacingAngle(playerid, HospitalEnter[5][3]);
					case 2: SetPlayerPos(playerid, HospitalEnter[6][0], HospitalEnter[6][1], HospitalEnter[6][2]), SetPlayerFacingAngle(playerid, HospitalEnter[6][3]);
					case 3: SetPlayerPos(playerid, HospitalEnter[7][0], HospitalEnter[7][1], HospitalEnter[7][2]), SetPlayerFacingAngle(playerid, HospitalEnter[7][3]);
				}
				SetPlayerVirtualWorld(playerid, 0);
				TogglePlayerDynamicCP(playerid, HealCP[1], false);
			} else if(i < 4) {
				SetPlayerPos(playerid, HospitalEnter[0][0], HospitalEnter[0][1], HospitalEnter[0][2]+1.3);
				SetPlayerFacingAngle(playerid, HospitalEnter[0][3]);
				SetPlayerInterior(playerid, 3);
				SetPlayerVirtualWorld(playerid, i);
				TogglePlayerDynamicCP(playerid, HealCP[1], true);
			} else {
				SetPlayerPos(playerid, HospitalEnter[4][0], HospitalEnter[4][1], HospitalEnter[4][2]+1.3);
				SetPlayerFacingAngle(playerid, HospitalEnter[4][3]);
				SetPlayerInterior(playerid, 3);
				SetPlayerVirtualWorld(playerid, i-4);
				TogglePlayerDynamicCP(playerid, HealCP[1], true);
			}
			break;
		}
	}
	if(pickupid == EnterLSPD[0])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LSPDEnter[1][0], LSPDEnter[1][1], LSPDEnter[1][2]);
		SetPlayerFacingAngle(playerid, LSPDEnter[1][3]);
	}
	if(pickupid == EnterLSPD[1])
	{
		if(PI[playerid][Faction] != 4) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 6);
		SetPlayerPos(playerid, LSPDEnter[0][0], LSPDEnter[0][1], LSPDEnter[0][2]);
		SetPlayerFacingAngle(playerid, LSPDEnter[0][3]);
	}
	if(pickupid == EnterLSPD[2])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LSPDEnter[3][0], LSPDEnter[3][1], LSPDEnter[3][2]);
		SetPlayerFacingAngle(playerid, LSPDEnter[3][3]);
	}
	if(pickupid == EnterLSPD[3])
	{
		if(PI[playerid][Faction] != 4) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 6);
		SetPlayerPos(playerid, LSPDEnter[2][0], LSPDEnter[2][1], LSPDEnter[2][2]);
		SetPlayerFacingAngle(playerid, LSPDEnter[2][3]);
	}
	if(pickupid == EnterSFPD[0])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, SFPDEnter[1][0], SFPDEnter[1][1], SFPDEnter[1][2]);
		SetPlayerFacingAngle(playerid, SFPDEnter[1][3]);
	}
	if(pickupid == EnterSFPD[1])
	{
		if(PI[playerid][Faction] != 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 10);
		SetPlayerPos(playerid, SFPDEnter[0][0], SFPDEnter[0][1], SFPDEnter[0][2]);
		SetPlayerFacingAngle(playerid, SFPDEnter[0][3]);
	}
	if(pickupid == EnterSFPD[2])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, SFPDEnter[3][0], SFPDEnter[3][1], SFPDEnter[3][2]);
		SetPlayerFacingAngle(playerid, SFPDEnter[3][3]);
	}
	if(pickupid == EnterSFPD[3])
	{
		if(PI[playerid][Faction] != 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 10);
		SetPlayerPos(playerid, SFPDEnter[2][0], SFPDEnter[2][1], SFPDEnter[2][2]);
		SetPlayerFacingAngle(playerid, SFPDEnter[2][3]);
	}
	if(pickupid == EnterLVPD[0])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LVPDEnter[1][0], LVPDEnter[1][1], LVPDEnter[1][2]);
		SetPlayerFacingAngle(playerid, LVPDEnter[1][3]);
	}
	if(pickupid == EnterLVPD[1])
	{
		if(PI[playerid][Faction] != 6) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 3);
		SetPlayerPos(playerid, LVPDEnter[0][0], LVPDEnter[0][1], LVPDEnter[0][2]);
		SetPlayerFacingAngle(playerid, LVPDEnter[0][3]);
	}
	if(pickupid == EnterLVPD[2])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LVPDEnter[3][0], LVPDEnter[3][1], LVPDEnter[3][2]);
		SetPlayerFacingAngle(playerid, LVPDEnter[3][3]);
	}
	if(pickupid == EnterLVPD[3])
	{
		if(PI[playerid][Faction] != 6) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 3);
		SetPlayerPos(playerid, LVPDEnter[2][0], LVPDEnter[2][1], LVPDEnter[2][2]);
		SetPlayerFacingAngle(playerid, LVPDEnter[2][3]);
	}
	if(pickupid == EnterLVPD[4])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LVPDEnter[5][0], LVPDEnter[5][1], LVPDEnter[5][2]);
		SetPlayerFacingAngle(playerid, LVPDEnter[5][3]);
	}
	if(pickupid == EnterLVPD[5])
	{
		if(PI[playerid][Faction] != 6) return SendClientMessage(playerid, COLOR_SYSTEM, "Посторонним нельзя");
		SetPlayerInterior(playerid, 3);
		SetPlayerPos(playerid, LVPDEnter[4][0], LVPDEnter[4][1], LVPDEnter[4][2]);
		SetPlayerFacingAngle(playerid, LVPDEnter[4][3]);
	}
	for(new i;i<sizeof(EnterNews);i++)
	{
		if(pickupid == EnterNews[i])
		{
			if(i == 0)
			{
				for(new j;j<sizeof(Enter247);j++)
				{
					if(j == GetPlayerVirtualWorld(playerid))
					{
						SetPlayerPos(playerid, NewsEnter[j][0], NewsEnter[j][1], NewsEnter[j][2]), SetPlayerFacingAngle(playerid, NewsEnter[j][3]);
					}
				}
				SetPlayerInterior(playerid, i);
				SetPlayerVirtualWorld(playerid, i);
			} else {
				SetPlayerInterior(playerid, 18);
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, NewsEnter[0][0], NewsEnter[0][1], NewsEnter[0][2]);
				SetPlayerFacingAngle(playerid, NewsEnter[0][3]);
			}
		}
	}
	for(new i;i<sizeof(Enter247);i++)
	{
		if(pickupid == Enter247[i])
		{
			if(i == 0)
			{
				TogglePlayerDynamicCP(playerid, CP247[0], false);
				for(new j;j<sizeof(Enter247);j++)
				{
					if(j == GetPlayerVirtualWorld(playerid))
					{
						SetPlayerPos(playerid, Enter_247[j][0], Enter_247[j][1], Enter_247[j][2]), SetPlayerFacingAngle(playerid, Enter_247[j][3]);
					}
				}
				SetPlayerInterior(playerid, i);
				SetPlayerVirtualWorld(playerid, i);
			} else {
				TogglePlayerDynamicCP(playerid, CP247[0], true);
				SetPlayerInterior(playerid, 6);
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, Enter_247[0][0], Enter_247[0][1], Enter_247[0][2]);
				SetPlayerFacingAngle(playerid, Enter_247[0][3]);
			}
			break;
		}
	}
	for(new i;i<sizeof(EnterBank);i++)
	{
		if(pickupid == EnterBank[i])
		{
			if(PIpen[playerid][Cheater] == 1) return false;
			if(i == 0)
			{
				for(new j;j<sizeof(EnterBank);j++)
				{
					if(j == GetPlayerVirtualWorld(playerid))
					{
						SetPlayerPos(playerid, BankEnter[j][0], BankEnter[j][1], BankEnter[j][2]), SetPlayerFacingAngle(playerid, BankEnter[j][3]);
					}
				}
				SetPlayerVirtualWorld(playerid, i);
			} else {
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, BankEnter[0][0], BankEnter[0][1], BankEnter[0][2]);
				SetPlayerFacingAngle(playerid, BankEnter[0][3]);
			}
			break;
		}
	}
	for(new i;i<sizeof(EnterHeal);i++)
	{
		if(pickupid == EnterHeal[i])
		{
			if(i == 0)
			{
				TogglePlayerDynamicCP(playerid, HealCP[0], false);
				SetPlayerInterior(playerid, 0);
				for(new j;j<sizeof(EnterHeal);j++)
				{
					if(j == GetPlayerVirtualWorld(playerid))
					{
						SetPlayerPos(playerid, HealEnter[j][0], HealEnter[j][1], HealEnter[j][2]), SetPlayerFacingAngle(playerid, HealEnter[j][3]);
					}
				}
				SetPlayerVirtualWorld(playerid, i);
			} else {
				TogglePlayerDynamicCP(playerid, HealCP[0], true);
				SetPlayerInterior(playerid, 1);
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, HealEnter[0][0], HealEnter[0][1], HealEnter[0][2]+0.3);
				SetPlayerFacingAngle(playerid, HealEnter[0][3]);
			}
			break;
		}
	}
	if(pickupid == EnterLic[0])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LicEnter[1][0], LicEnter[1][1], LicEnter[1][2]);
		SetPlayerFacingAngle(playerid, LicEnter[1][3]);
	}
	if(pickupid == EnterLic[1])
	{
		SetPlayerInterior(playerid, 3);
		SetPlayerPos(playerid, LicEnter[0][0], LicEnter[0][1], LicEnter[0][2]);
		SetPlayerFacingAngle(playerid, LicEnter[0][3]);
	}
	if(pickupid == EnterLic[2])
	{
		SetPlayerInterior(playerid, 0);
		SetPlayerPos(playerid, LicEnter[3][0], LicEnter[3][1], LicEnter[3][2]);
		SetPlayerFacingAngle(playerid, LicEnter[3][3]);
	}
	if(pickupid == EnterLic[3])
	{
		SetPlayerInterior(playerid, 3);
		SetPlayerPos(playerid, LicEnter[2][0], LicEnter[2][1], LicEnter[2][2]);
		SetPlayerFacingAngle(playerid, LicEnter[2][3]);
	}
	if(pickupid == EnterLic[4])
	{
		if(GetPVarInt(playerid, "InLic") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже на тестировании");
		else if(PI[playerid][DriveLicence] == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже получил права");
		else ShowPlayerDialog(playerid, D_LICD, DIALOG_STYLE_MSGBOX, "{FFFFFF}Экзамен", "{FFFF00}Начать тестирование?\nСтоимость: {FFFFFF}$300","Да","Нет");
	}
	for(new i;i<sizeof(EnterEat);i++)
	{
		if(pickupid == EnterEat[i])
		{
			if(i == 0)
			{
				TogglePlayerDynamicCP(playerid, EatCP[0], false);
				for(new j;j<sizeof(EnterEat);j++)
				{
					if(j == GetPlayerVirtualWorld(playerid))
					{
						SetPlayerPos(playerid, EatEnter[j][0], EatEnter[j][1], EatEnter[j][2]), SetPlayerFacingAngle(playerid, EatEnter[j][3]);
					}
				}
				SetPlayerInterior(playerid, i);
				SetPlayerVirtualWorld(playerid, i);
			} else {
				TogglePlayerDynamicCP(playerid, EatCP[0], true);
				SetPlayerInterior(playerid, 9);
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, EatEnter[0][0], EatEnter[0][1], EatEnter[0][2]);
				SetPlayerFacingAngle(playerid, EatEnter[0][3]);
			}
			break;
		}
	}
	for(new i;i<sizeof(EnterSkinShop);i++)
	{
		if(pickupid == EnterSkinShop[i])
		{
			if(i == 0)
			{
				for(new j;j<sizeof(EnterSkinShop);j++)
				{
					if(j == GetPlayerVirtualWorld(playerid))
					{
						SetPlayerPos(playerid, SkinShopEnter[j][0], SkinShopEnter[j][1], SkinShopEnter[j][2]), SetPlayerFacingAngle(playerid, SkinShopEnter[j][3]);
					}
				}
				SetPlayerInterior(playerid, i);
				SetPlayerVirtualWorld(playerid, i);
			}
			else if(i == 1)
			{
				ShowPlayerDialog(playerid, D_BUYSKIN, DIALOG_STYLE_MSGBOX, "{FFFFFF}Магазин одежды", "{FFFF00}Войти в магазин одежды?", "Да", "Нет");
			} else {
				SetPlayerInterior(playerid, 5);
				SetPlayerVirtualWorld(playerid, i);
				SetPlayerPos(playerid, SkinShopEnter[0][0], SkinShopEnter[0][1], SkinShopEnter[0][2]);
				SetPlayerFacingAngle(playerid, SkinShopEnter[0][3]);
			}
			break;
		}
	}
	if(pickupid == miner)
	{
	    if(GetPVarInt(playerid, "OutJob") == 0 || GetPVarInt(playerid, "OutJob") == 3)
	    {
	        if(GetPVarInt(playerid, "OutJob") == 3)
	        {
				new body[512], tmp[48];
				format(tmp,sizeof(tmp),"{FFFF00}Добыто руды: {FFFFFF}%d кг\n", GetPVarInt(playerid, "AllMetal"));
				strcat(body,tmp);
				format(tmp,sizeof(tmp),"{FFFF00}Твоя зарплата: ${FFFFFF}%d\n", GetPVarInt(playerid, "AllMetal")*4);
				strcat(body,tmp);
				strcat(body,"\n{00FF00}Закончить рабочий день?");
	            ShowPlayerDialog(playerid, D_MINER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Раздевалка",body,"Да","Нет");
	        } else {
	            ShowPlayerDialog(playerid, D_MINER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Раздевалка","{FFFF00}На этой работе тебе нужно будет добывать руду. За {FFFFFF}1 кг {FFFF00}руды платят {FFFFFF}4${FFFF00}.\n\n{00FF00}Начать рабочий день?","Да","Нет");
	        }
	    } else SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже подрабатываешь в другом месте");
	}
	if(pickupid == wooder)
	{
	    if(GetPVarInt(playerid, "OutJob") == 0 || GetPVarInt(playerid, "OutJob") == 2)
	    {
	        if(GetPVarInt(playerid, "OutJob") == 2)
	        {
				new body[512], tmp[48];
				format(tmp,sizeof(tmp),"{FFFF00}Дерева нарублено: {FFFFFF}%d кг\n", GetPVarInt(playerid, "AllWood"));
				strcat(body,tmp);
				format(tmp,sizeof(tmp),"{FFFF00}Твоя зарплата: ${FFFFFF}%d\n", GetPVarInt(playerid, "AllWood")*2);
				strcat(body,tmp);
				strcat(body,"\n{00FF00}Закончить рабочий день?");
	            ShowPlayerDialog(playerid, D_WOODER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Раздевалка",body,"Да","Нет");
	        } else {
	            ShowPlayerDialog(playerid, D_WOODER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Раздевалка","{FFFF00}На этой работе тебе нужно будет пилить дерево. За {FFFFFF}1 кг {FFFF00}дерева платят {FFFFFF}2${FFFF00}.\n\n{00FF00}Начать рабочий день?","Да","Нет");
	        }
	    } else SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже подрабатываешь в другом месте");
	}
	if(pickupid == packer)
	{
	    if(GetPVarInt(playerid, "OutJob") == 0 || GetPVarInt(playerid, "OutJob") == 1)
	    {
	        if(GetPVarInt(playerid, "OutJob") == 1)
	        {
				new body[512], tmp[48];
				format(tmp,sizeof(tmp),"{FFFF00}Мешков перетащено: {FFFFFF}%d\n", GetPVarInt(playerid, "PackerCount"));
				strcat(body,tmp);
				format(tmp,sizeof(tmp),"{FFFF00}Твоя зарплата: ${FFFFFF}%d\n", GetPVarInt(playerid, "PackerCount")*120);
				strcat(body,tmp);
				strcat(body,"\n{00FF00}Закончить рабочий день?");
	            ShowPlayerDialog(playerid, D_PACKER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Раздевалка",body,"Да","Нет");
	        } else {
	            ShowPlayerDialog(playerid, D_PACKER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Раздевалка","{FFFF00}На этой работе тебе нужно будет таскать груз. За {FFFFFF}1 {FFFF00}мешок платят {FFFFFF}120${FFFF00}.\n\n{00FF00}Начать рабочий день?","Да","Нет");
	        }
	    } else SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже подрабатываешь в другом месте");
	}
	if(pickupid == LSPDweap[0] || pickupid == SFPDweap[0] || pickupid == LVPDweap[0])
	{
		if(PI[playerid][Faction] == 4 || PI[playerid][Faction] == 5 || PI[playerid][Faction] == 6)
		{
			new wp, ammo;
			GetPlayerWeaponData(playerid, 1, wp, ammo);
			if(wp != 3 || ammo == 0)  givePlayerWeapon(playerid, 3, 1);
		}
	}
	if(pickupid == LSPDweap[1] || pickupid == SFPDweap[1] || pickupid == LVPDweap[1])
	{
		if(PI[playerid][Faction] == 4 || PI[playerid][Faction] == 5 || PI[playerid][Faction] == 6)
		{
			new wp, ammo;
			GetPlayerWeaponData(playerid, 2, wp, ammo);
			if(wp != 24 || ammo == 0) givePlayerWeapon(playerid, 24, 30);
		}
	}
	if(pickupid == LSPDweap[2] || pickupid == SFPDweap[2] || pickupid == LVPDweap[2])
	{
		if(PI[playerid][Faction] == 4 || PI[playerid][Faction] == 5 || PI[playerid][Faction] == 6)
		{
			new wp, ammo;
			GetPlayerWeaponData(playerid, 4, wp, ammo);
			if(wp != 29 || ammo == 0) givePlayerWeapon(playerid, 29, 100);
		}
	}
	return true;
}

public OnVehicleMod(playerid, vehicleid, componentid)
{
	if(vehicleid == PIcar[playerid][CarGUID])
	{
		switch(GetVehicleComponentType(componentid))
		{
		    case 0: PIcar[playerid][VehSlot0] = componentid;
		    case 1: PIcar[playerid][VehSlot1] = componentid;
		    case 2: PIcar[playerid][VehSlot2] = componentid;
		    case 3: PIcar[playerid][VehSlot3] = componentid;
		    case 4: PIcar[playerid][VehSlot4] = componentid;
		    case 5: PIcar[playerid][VehSlot5] = componentid;
		    case 6: PIcar[playerid][VehSlot6] = componentid;
		    case 7: PIcar[playerid][VehSlot7] = componentid;
		    case 8: PIcar[playerid][VehSlot8] = componentid;
		    case 9: PIcar[playerid][VehSlot9] = componentid;
		    case 10: PIcar[playerid][VehSlot10] = componentid;
		    case 11: PIcar[playerid][VehSlot11] = componentid;
		    case 12: PIcar[playerid][VehSlot12] = componentid;
		    case 13: PIcar[playerid][VehSlot13] = componentid;
		}
	}
	return true;
}

public OnVehiclePaintjob(playerid, vehicleid, paintjobid)
{
    if(vehicleid == PIcar[playerid][CarGUID]) PIcar[playerid][PaintJob] = paintjobid;
	return true;
}

public OnVehicleRespray(playerid, vehicleid, color1, color2)
{
    if(vehicleid == PIcar[playerid][CarGUID])
	{
		PIcar[playerid][Color1] = color1;
		PIcar[playerid][Color2] = color2;
	}
	return true;
}

public OnUnoccupiedVehicleUpdate(vehicleid, playerid, passenger_seat)
{

	return true;
}

public OnPlayerSelectedMenuRow(playerid, row)
{
	return true;
}

public OnPlayerExitedMenu(playerid)
{
	return true;
}

public OnPlayerInteriorChange(playerid, newinteriorid, oldinteriorid)
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i)) continue;
		if(GetPVarInt(i, "SpecID") == playerid)
		{
			SetPlayerInterior(i, newinteriorid);
			SetPlayerVirtualWorld(i, GetPlayerVirtualWorld(playerid));
		}
	}
	return true;
}

public OnPlayerKeyStateChange(playerid, newkeys, oldkeys)
{
	if(PIpen[playerid][Cheater] == 1) return false;
    if(PI[playerid][ShowKeys] == 1)
	{
		new animlib[32], animname[32];
        GetAnimationName(GetPlayerAnimationIndex(playerid),animlib,32,animname,32);
		format(glstr,sizeof(glstr),"~g~%d ~r~%d~n~~y~LIB:%s NAME:%s ~n~INDEX:%d",newkeys,oldkeys,animlib,animname,GetPlayerAnimationIndex(playerid));
		GameTextForPlayer(playerid, glstr, 1000, 3);
	}
	/*if(newkeys == 9 || newkeys == 33 && oldkeys != 9 || oldkeys != 33)
	{
		new vid = GetPlayerVehicleID(playerid);
		if(vid != PIcar[playerid][CarGUID])
		{
			new plid = -1;
			for(new i;i<PLAYERS;i++)
			{
				if(!IsPlayerConnected(i)) continue;
				if(vid == PIcar[i][CarGUID])
				{
					plid = i;
					break;
				}
			}
			if(PIcar[plid][VehSlot5] != 0 && plid != -1)
			{
				AddVehicleComponent(vid, PIcar[plid][VehSlot5]);
			}
		} else {
			if(PIcar[playerid][VehSlot5] != 0)
			{
				AddVehicleComponent(vid, PIcar[playerid][VehSlot5]);
			}
		}
	}*/
	if(oldkeys == 1 || oldkeys == 9 || oldkeys == 33)
	{
		if(IsPlayerInAnyVehicle(playerid) && GetPlayerVehicleSeat(playerid) == 0 && !IsBike(GetPlayerVehicleID(playerid)) && GetPVarInt(playerid, "InOilShop") == 0)
		{
			new vehicleid = GetPlayerVehicleID(playerid);
			if(Fuel[vehicleid] >= 1.0)
			{
				ToggleEngine(GetPlayerVehicleID(playerid));
				if(GetVehicleComponentInSlot(vehicleid, 5) != 0) AddVehicleComponent(vehicleid, GetVehicleComponentInSlot(vehicleid, 5));
			} else SendClientMessage(playerid, COLOR_SYSTEM, "У транспорта закончился бензин");
		}
	}
	if(newkeys == 2)
	{
		if(IsPlayerInRangeOfPoint(playerid, 10.0, -2062.2668,-94.2870,35.1641))
		{
			if(GetPlayerVehicleID(playerid) < LicCars[0] || GetPlayerVehicleID(playerid) > LicCars[sizeof(LicCars)-1]) return false;
			MoveDynamicObject(Gate_Lic[0], -2061.8994, -90.70019, 34.81+0.01,0.01, 0, 0.00000000, 270.0);
			SetTimer("CloseLicGates", 5000, false);
		}
		else {
			for(new i;i<sizeof(OilShop);i++)
			{
				if(!IsPlayerInRangeOfPoint(playerid, 15.0, OilShop[i][0], OilShop[i][1], OilShop[i][2])) continue;
				else if(!IsPlayerInAnyVehicle(playerid)) return false;
				else if(IsBike(GetPlayerVehicleID(playerid))) return SendClientMessage(playerid, COLOR_SYSTEM, "Этот транспорт нельзя заправить");
				else if(GetPVarInt(playerid, "InOilShop") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты уже заправляешься");
				else ShowPlayerDialog(playerid, D_OIL, DIALOG_STYLE_INPUT, "{FFFFFF}Заправка", "{FFFF00}Сколько заправить?\nСтоимость 1 литра бензина - 3$","Заправить","Выход");
			}
		}
	}
	if(newkeys == 4)
	{
		if(GetPVarInt(playerid, "InSpec") == 1)
		{
			specNext(playerid);
		}
		else if(GetPVarInt(playerid, "Eating") != 0)
		{
			switch(GetPVarInt(playerid, "Eating"))
			{
				case 1: format(glstr, sizeof(glstr), "%s ест еду для бездомных", Name(playerid));
				case 2: format(glstr, sizeof(glstr), "%s ест еду", Name(playerid));
				case 3: format(glstr, sizeof(glstr), "%s ест еду для военных", Name(playerid));
			}
			SetPlayerSpecialAction(playerid, SPECIAL_ACTION_NONE);
			if(IsPlayerAttachedObjectSlotUsed(playerid,5)) RemovePlayerAttachedObject(playerid,5);
			ApplyAnimationEx(playerid, "FOOD", "EAT_Pizza", 4.1,0,1,1,1,1);
			SetTimerEx("ClearAnims", 4500, false, "d", playerid);
			SetPVarInt(playerid, "Eating", 0);
			Do(playerid, glstr);
			PI[playerid][Eat] += 20;
			if(PI[playerid][Health] + 20 < 100)
			{
				PI[playerid][Health] += 20;
			} else {
				PI[playerid][Health] += 100-PI[playerid][Health];
			}
		}
	}
	if(newkeys == 128)
	{
		if(GetPVarInt(playerid, "InSpec") == 1)
		{
			specPrev(playerid);
		}
	}
	if(newkeys == 16384)
	{
		if(IsPlayerInAnyVehicle(playerid) && GetPlayerVehicleSeat(playerid) == 0 && PIcar[playerid][CarGUID] != GetPlayerVehicleID(playerid))
		{
			ToggleCarLock(playerid);
		} else {
			if(PI[playerid][LastCar] != INVALID_VEHICLE_ID && CarLocked[PI[playerid][LastCar]])
			{
				GetVehicleParamsEx(PI[playerid][LastCar], engine, lights, alarm, doors, bonnet, boot, objective);
				CarLocked[PI[playerid][LastCar]] = false;
				SetVehicleParamsEx(PI[playerid][LastCar], engine, lights, alarm, CarLocked[PI[playerid][LastCar]], bonnet, boot, objective);
				GameTextForPlayer(playerid, "Авто ~n~~g~открыто", 2000, 5);
				PI[playerid][LastCar] = 0;
			} else SendClientMessage(playerid, COLOR_SYSTEM, "Чтобы закрыть транспорт, ты должен сидеть за рулём");
		}
	}
	if(newkeys == 8)
	{
		if(GetPVarType(playerid, "FlyMode")) MoveCamera(playerid);
	}
	if(newkeys == 8192)
	{

	}
	if(newkeys == 1152)
    {
		if(GetPlayerTargetPlayer(playerid) != INVALID_PLAYER_ID)
		{
			SetPVarInt(playerid, "ClickedPlayer", GetPlayerTargetPlayer(playerid));
			ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"),playerid);
		}
    }
	if(newkeys == 1024)
	{
		if(GetPVarInt(playerid, "InSpec") == 1)
		{
			SetPVarInt(playerid, "ClickedPlayer", GetPVarInt(playerid, "SpecID"));
			ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"),playerid);
		}
	}
	if(newkeys == 512)
	{
		if(PI[playerid][Job] == 1)
		{
			if(GetPVarInt(playerid, "IsOnJob") == 0)
			{
				new vid = GetPlayerVehicleID(playerid);
				for(new i;i<sizeof(TaxiCars);i++)
				{
					if(vid != TaxiCars[i]) continue;
					ShowPlayerDialog(playerid, D_WORK_S, DIALOG_STYLE_MSGBOX, "{FFFFFF}Рабочий день", "{FFFF00}Начать рабочий день?", "Да", "Нет");
				}
			} else ShowPlayerDialog(playerid, D_WORK_S, DIALOG_STYLE_MSGBOX, "{FFFFFF}Рабочий день", "{FFFFFF}Закончить рабочий день?", "Да", "Нет");
		}
		else if(PI[playerid][Job] == 2)
		{
			if(GetPVarInt(playerid, "IsOnJob") == 0)
			{
				new vid = GetPlayerVehicleID(playerid);
				for(new i;i<sizeof(Bus);i++)
				{
					if(vid != Bus[i]) continue;
					new body[128];
					strcat(body, "Автовокзал ЛС - Автошкола");
					strcat(body, "\nАвтовокзал ЛС - Шахта");
					strcat(body, "\nАвтовокзал СФ - Автовокзал ЛВ");
					strcat(body, "\nАвтовокзал СФ - Шахта ЛВ");
					ShowPlayerDialog(playerid, D_WORK_BUS, DIALOG_STYLE_LIST, "{FFFFFF}Выбор маршрута", body, "Выбрать", "Выход");
				}
			} else ShowPlayerDialog(playerid, D_WORK_S, DIALOG_STYLE_MSGBOX, "{FFFFFF}Рабочий день", "{FFFFFF}Закончить рабочий день?", "Да", "Нет");
		}
	}
	if(oldkeys == 16)
	{
		if(GetPVarInt(playerid, "InSpec") == 1)
		{
			specOff(playerid);
		}
		if(GetPVarType(playerid, "FlyMode")) CancelFlyMode(playerid);
		if(GetPVarInt(playerid, "InHospital") == 1)
		{
			ClearAnimations(playerid);
			SetPVarInt(playerid, "InHospital", 0);
			Bed[GetPVarInt(playerid, "Bed")] = false;
		}
		else if(GetPVarInt(playerid, "InHospital") == 0)
		{
			for(new i;i<sizeof(HospitalBed);i++)
			{
				if(!IsPlayerInRangeOfPoint(playerid, 1.5, HospitalBed[i][0], HospitalBed[i][1], HospitalBed[i][2])) continue;
				else if(Bed[i]) return SendClientMessage(playerid, COLOR_SYSTEM, "Кровать занята");
				else if(PI[playerid][Health] >= 50) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе не нужен отдых");
				SetPVarInt(playerid, "InHospital", 1);
				SetPVarInt(playerid, "Bed", i);
				SetPlayerPos(playerid, HospitalBed[i][0], HospitalBed[i][1], HospitalBed[i][2]);
				SetPlayerFacingAngle(playerid, HospitalBed[i][3]);
				Bed[GetPVarInt(playerid, "Bed")] = true;
				ApplyAnimationEx(playerid, "BEACH", "Lay_Bac_Loop", 3, 0,0,0,1,0);
			}
		}
		if(GetPVarInt(playerid, "InSkinShop") == 1)
		{
			ExitPlayerSkinShop(playerid);
		}
	    if(OnHouseEnter(playerid) > 0)
	    {
	        new hid = OnHouseEnter(playerid);
	        if(PI[playerid][House] != hid && HI[hid][Locked] == true && PI[playerid][OpenHouses] == 0) return GameTextForPlayer(playerid, RTP("~r~ЗакрЫто"), 1000, 3);
	        SetPlayerPos(playerid, HouseCoord[HI[hid][Interior]][0], HouseCoord[HI[hid][Interior]][1], HouseCoord[HI[hid][Interior]][2]);
	        SetPlayerFacingAngle(playerid, HouseCoord[HI[hid][Interior]][3]);
	        SetPlayerInterior(playerid, HouseInt[HI[hid][Interior]]);
	        SetPVarInt(playerid, "InHouse", hid);
    		SetPlayerVirtualWorld(playerid, hid);
	    } else if(OnHouseEnter(playerid) == 0 && GetPVarInt(playerid, "InHouse") != 0) {
	        new hid = GetPVarInt(playerid, "InHouse");
			if(!IsPlayerInRangeOfPoint(playerid, 1.6, HouseCoord[HI[hid][Interior]][0], HouseCoord[HI[hid][Interior]][1], HouseCoord[HI[hid][Interior]][2])) return false;
	        SetPlayerPos(playerid, HI[hid][StreetX], HI[hid][StreetY], HI[hid][StreetZ]);
	        SetPlayerFacingAngle(playerid, HI[hid][StreetA]);
	        SetPlayerInterior(playerid, HI[hid][WorldInterior]);
	        SetPVarInt(playerid, "InHouse", 0);
    		SetPlayerVirtualWorld(playerid, HI[hid][World]);
	    }
		else if(GetPVarInt(playerid, "Calling") != 0)
		{
			PI[GetPVarInt(playerid,"InCall")][PhoneBalance] -=20;

			SetPVarInt(GetPVarInt(playerid,"InCall"), "Calling", 0);
			SetPVarInt(GetPVarInt(playerid,"InCall"), "Caller", 0);
			SetPlayerSpecialAction(GetPVarInt(playerid,"InCall"), SPECIAL_ACTION_STOPUSECELLPHONE);
			RemovePlayerAttachedObject(GetPVarInt(playerid,"InCall"), 1);
			SendClientMessage(GetPVarInt(playerid,"InCall"), -1, "Разговор окончен");
			SetPVarInt(GetPVarInt(playerid,"InCall"), "InCall", PLAYERS+1);

			SetPVarInt(playerid, "InCall", PLAYERS+1);
			SetPVarInt(playerid, "Calling", 0);
			SetPVarInt(playerid, "Caller", 0);
			SetPlayerSpecialAction(playerid, SPECIAL_ACTION_STOPUSECELLPHONE);
			RemovePlayerAttachedObject(playerid, 1);
			SendClientMessage(playerid, -1, "Разговор окончен");
		} else {
			for(new i;i<sizeof(ATM);i++)
			{
				if(!IsPlayerInRangeOfPoint(playerid, 1.0, ATM[i][0], ATM[i][1], ATM[i][2])) continue;
				ShowMenu(playerid, D_ATM);
				break;
			}
		}
		if(GetPVarInt(playerid, "InCarShop") == 1) ExitPlayerCarShop(playerid);
	}
	if(newkeys == 131074 && IsPlayerInAnyVehicle(playerid) && !IsBike(GetPlayerVehicleID(playerid)) && GetPlayerVehicleSeat(playerid) == 0)
	{
		AddDListItem(playerid, "Вкл/Откл двигатель", D_CAR_engine);
		AddDListItem(playerid, "Закрыть/Открыть двери", D_CAR_doors);
		AddDListItem(playerid, "Закрыть/Открыть капот", D_CAR_bonnet);
		AddDListItem(playerid, "Закрыть/Открыть багажник", D_CAR_boot);
		AddDListItem(playerid, "Вкл/Откл фары", D_CAR_lights);
		AddDListItem(playerid, "Вкл/Откл сигнализацию", D_CAR_alarm);
		ShowPlayerDList(playerid, D_CAR, "{FFFFFF}Меню транспорта", "Выбрать", "Выход");
	}
	else if(newkeys == 131072)
	{
	    if(OnHouseEnter(playerid) > 0)
	    {
	        new hid = OnHouseEnter(playerid);
	        SetPVarInt(playerid, "MenuHouse", hid);
	        OnPlayerCommandText(playerid, "/менюдома");
		}
		else if(GetPVarInt(playerid, "iViewing") == 1)
		{
			ShowPlayerDialog(playerid, P_MENU_FACTION_IVIEW, DIALOG_STYLE_MSGBOX, "{FFFFFF}Интервью", "{FFFF00}У тебя хотят взять интервью", "Согласиться", "Отказать");
		}
		else if(GetPVarInt(playerid, "Calling") == 1)
		{
			format(glstr,sizeof(glstr),"{FFFF00}Тебе звонит {FF0000}%s{FFFF00}. Номер телефона: {FF0000}%d{FFFF00}.", Name(GetPVarInt(playerid, "Caller")), PI[GetPVarInt(playerid, "Caller")][PhoneNumber]);
			ShowPlayerDialog(playerid, D_PHONE, DIALOG_STYLE_MSGBOX, "{FFFFFF}Входящий звонок", glstr, "Ответить", "Сбросить");
		}
		else if(GetPVarInt(playerid, "Healing") == 1)
		{
			ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL2, DIALOG_STYLE_MSGBOX, "{FFFFFF}Лечение", "{FFFFFF}Принять помощь от врача?", "Да", "Нет");
		}
		else if(GetPVarInt(playerid, "Invited") == 1)
		{
			ShowPlayerDialog(playerid, P_MENU_FACTION_INVITE, DIALOG_STYLE_MSGBOX, "{FFFFFF}Приглашение во фракцию", "{FFFFFF}Принять приглашение?", "Да", "Нет");
		}
		else if(IsTAXIcar(playerid) && GetPVarInt(playerid, "IsOnJob") == 1)
		{
			if(GetPVarInt(playerid, "TaxiDriver")) return SendClientMessage(playerid, COLOR_SYSTEM, "Сначала выполни вызов");
			new body[256], n;
			for(new i;i<PLAYERS;i++)
			{
				if(!InGame(i) || GetPVarInt(i, "CalledTaxi") == 0 || playerid == i) continue;
				nTaxi[n] = i;
				n++;
				format(glstr, sizeof(glstr), "%s\n", Name(i));
				strcat(body, glstr);
			}
			if(n == 0)
			{
				SendClientMessage(playerid, COLOR_SYSTEM, "Никто не вызывал такси");
			} else {
				ShowPlayerDialog(playerid, D_TAXI, DIALOG_STYLE_LIST, "{FFFFFF}Вызовы такси", body, "Принять", "Выход");
			}
		} else {
			new vid = PIcar[playerid][CarGUID];
			if(vid == INVALID_VEHICLE_ID) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет машины");
			else if(VehicleInPlayer(PIcar[playerid][CarGUID], playerid, 50.0))
			{
				GetVehicleParamsEx(vid, engine, lights, alarm, doors, bonnet, boot, objective);
				if(CarLocked[vid] == false)
				{
					CarLocked[vid] = true;
					GameTextForPlayer(playerid, "Личное Авто ~n~~r~закрыто", 2000, 5);
				} else {
					CarLocked[vid] = false;
					GameTextForPlayer(playerid, "Личное Авто ~n~~g~открыто", 2000, 5);
				}
				SetVehicleParamsEx(vid, engine, lights, alarm, CarLocked[vid], bonnet, boot, objective);
			} else SendClientMessage(playerid, COLOR_SYSTEM, "Твоя машина далеко от тебя");
		}
	}
	if(newkeys == 65536)
	{
		OnPlayerCommandText(playerid, "/mn");
	}
	switch(newkeys)
	{
		case 32,40,552,544,44,36,41,553,1064,1576:
		{
			if(IsPlayerInAnyVehicle(playerid)) return false;
			if(PI[playerid][BH] || Bunny) return false;
			switch(GetPlayerAnimationIndex(playerid))
			{
				case 1195,1196,1197,1198,1224,1257,1279,1280,1286,1226,1261,1276,1283,1278,1282,1228,1263,1264,1247,1141,1249: 
				{
					ApplyAnimationEx(playerid, "PED", "KO_SKID_BACK",4.1,0,0,0,0,0);
				}
			}
		}
	}
	if(newkeys == 262144)
	{
		if(IsPlayerInRangeOfPoint(playerid, 3.0, 2308.8147,-13.2479,26.7422)) return ShowPlayerDialog(playerid, D_BANK, DIALOG_STYLE_LIST, "{FFFFFF}Банк", "Положить деньги на счет\nСнять деньги со счета","Выбрать","Выход");
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, CarShopEnter[0][0], CarShopEnter[0][1], CarShopEnter[0][2]))
		{
		    if(PI[playerid][House] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Чтобы купить машину тебе нужен дом");
			SelectTextDraw(playerid, 0x00FF00FF);
			SetPVarInt(playerid, "InCarShop", 1);
			TogglePlayerControllable(playerid, false);
			SetPlayerPos(playerid,-1643.6370,1203.5712,21.1487);
			SetPlayerCameraPos(playerid,-1649.9407,1207.8894,23.1487);
			SetPlayerCameraLookAt(playerid, -1658.8242,1208.8860,21.1563);
			SetPlayerVirtualWorld(playerid, playerid+1);
			TextDrawShowForPlayer(playerid, CarShopBox);
			ShopCarAngle[playerid] = 250.0;
			ShopCar[playerid] = CreateVehicle(CarsForShop[0][0],-1658.8242,1208.8860,21.1563,ShopCarAngle[playerid],1,1,0);
			SetVehicleVirtualWorld(ShopCar[playerid], playerid+1);

			PlayerTextDrawShow(playerid, NameCar[playerid]);
			PlayerTextDrawSetString(playerid, NameCar[playerid], vName[CarsForShop[NowCarShop[playerid]][0]-400]);
			PlayerTextDrawShow(playerid, NextCar[playerid]);
			PlayerTextDrawShow(playerid, PrevCar[playerid]);
			PlayerTextDrawShow(playerid, LevelCar[playerid]);
			PlayerTextDrawShow(playerid, CostCar[playerid]);
			PlayerTextDrawShow(playerid, BuyCar[playerid]);
			PlayerTextDrawShow(playerid, SellCar[playerid]);
			PlayerTextDrawShow(playerid, AngleCarLeft[playerid]);
			PlayerTextDrawShow(playerid, AngleCarRight[playerid]);
			ShowPlayerDialog(playerid, D_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Управление", "{FFFF00}Выйти из магазина можно клавишей {FF0000}ESC", "ОК", "");
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 1250.9335,-766.6091,92.1039) || IsPlayerInRangeOfPoint(playerid, 1.0, 1240.0018,-773.1416,91.4342))
		{
			if(PI[playerid][House] == 582 || IsPlayerAdmin(playerid))
			{
				if(gate_nicky)
				{
					gate_nicky = false;
					MoveDynamicObject(Gate_Nicky[0], 1245.5, -767.2998, 91.18, 2.0, 0.0, 0.0, 0.0);
				} else {
					gate_nicky = true;
					MoveDynamicObject(Gate_Nicky[0], 1245.5, -767.2998, 87.18, 2.5, 0.0, 0.0, 0.0);
				}
			} else SendClientMessage(playerid, 0xFF0000FF, "Тебе нельзя ими управлять");
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1898.1713,-1636.714,25.0391) || IsPlayerInRangeOfPoint(playerid, 1.0, -1901.2742,-1640.2510,-59.6))
		{
			if(GetPVarInt(playerid, "OutJob") != 3) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не работаешь на шахте");
			else if(Lifting[0]) return SendClientMessage(playerid, COLOR_SYSTEM, "Лифт в движении");
			else if(!Lifted[0]) return SendClientMessage(playerid, COLOR_SYSTEM, "Лифт уже наверху");
			MoveDynamicObject(Lift[0], -1900.870361,-1638.847900,23.963088, 4.3, -0.099999,88.200050,-0.099999);
			Lifting[0] = true;
			Lifted[0] = false;
			SetTimerEx("StopLift", 17000, false, "db", 0, true);
			MoveDynamicObject(LiftDoor[1], -1899.204223,-1639.844360,-59.744762, 1.0, 0.0,0.000000,-90.0);
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1901.4141,-1640.2535,25.18) || IsPlayerInRangeOfPoint(playerid, 1.0, -1897.6802,-1640.1237,-59.9744))
		{
			if(GetPVarInt(playerid, "OutJob") != 3) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не работаешь на шахте");
			else if(Lifting[0]) return SendClientMessage(playerid, COLOR_SYSTEM, "Лифт в движении");
			else if(Lifted[0]) return SendClientMessage(playerid, COLOR_SYSTEM, "Лифт уже внизу");
			MoveDynamicObject(Lift[0], -1900.870361,-1638.847900,-60.8, 10.0, -0.099999,88.200050,-0.099999);
			Lifting[0] = true;
			Lifted[0] = true;
			SetTimerEx("StopLift", 9000, false, "db", 0, false);
			MoveDynamicObject(LiftDoor[0], -1899.026977,-1637.973388,25.247129, 1.0, 0.000000,0.000000,90.0);
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 429.7604, 2562.9399, 16.72990) || IsPlayerInRangeOfPoint(playerid, 1.0, 432.84009, 2560.64355, 16.84570))
		{
			if(PI[playerid][Faction] == 12)
			{
				if(gate_FRAC12[0])
				{
					gate_FRAC12[0] = false;
					MoveDynamicObject(Gate_FRAC12[0], 430.952,2566.8,15.8800, 3.0, 0.000000,0.000000,271.0);
				} else {
					gate_FRAC12[0] = true;
					MoveDynamicObject(Gate_FRAC12[0], 430.952,2574.78,15.8800, 3.0, 0.000000,0.000000,271.0);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -83.6042,2566.6018,17.8534) || IsPlayerInRangeOfPoint(playerid, 1.0, -80.4262,2558.1638,17.7555))
		{
			if(PI[playerid][Faction] == 12)
			{
				if(gate_FRAC12[1])
				{
					gate_FRAC12[1] = false;
					MoveDynamicObject(Gate_FRAC12[1], -81.761,2562.041,16.517, 3.0, 0.000000,0.000000,270.0);
				} else {
					gate_FRAC12[1] = true;
					MoveDynamicObject(Gate_FRAC12[1], -81.7610, 2567.4610, 16.5170, 3.0, 0.000000,0.000000,270.0);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1424.6655,515.3718,11.1847) || IsPlayerInRangeOfPoint(playerid, 1.0, -1424.6365,515.4163,18.1827))
		{
			if(PI[playerid][Faction] == 11)
			{
				if(gate_FRAC11[0])
				{
					gate_FRAC11[0] = false;
					MoveDynamicObject(Gate_FRAC11[0], -1414.445, 516.45, 9.63, 2.0, 0.0, 0.0, 0.0);
				} else {
					gate_FRAC11[0] = true;
					MoveDynamicObject(Gate_FRAC11[0], -1414.445, 516.45, 16.6814, 1.0, 0.0, 0.0, 0.0);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1462.7341,510.2036,11.2373) || IsPlayerInRangeOfPoint(playerid, 1.0, -1462.7843,492.2722,11.2468) || IsPlayerInRangeOfPoint(playerid, 1.0, -1462.7631,492.3718,18.2866) || IsPlayerInRangeOfPoint(playerid, 1.0, -1462.7114,510.2751,18.2773))
		{
			if(PI[playerid][Faction] == 11)
			{
				if(gate_FRAC11[1])
				{
					gate_FRAC11[1] = false;
					MoveDynamicObject(Gate_FRAC11[1], -1456.7, 501.3, 9.91, 2.0, 0.0, 0.0, 0.0);
				} else {
					gate_FRAC11[1] = true;
					MoveDynamicObject(Gate_FRAC11[1], -1456.7, 501.3, 16.95, 1.0, 0.0, 0.0, 0.0);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1461.2346, 488.4816, 3.0414))
		{
			if(PI[playerid][Faction] == 11)
			{
				if(gate_FRAC11[2])
				{
					gate_FRAC11[2] = false;
					MoveDynamicObject(Gate_FRAC11[2], -1465.8, 501.3, 1.04, 2.0, 0.0, 0.0, 0.0);
				} else {
					gate_FRAC11[2] = true;
					MoveDynamicObject(Gate_FRAC11[2], -1468.767, 501.3, 11.95, 1.0, 0.0, 0.0, 0.0);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 288.4329,1827.5042,17.6481))
		{
			if(PI[playerid][Faction] == 10)
			{
				if(gate_FRAC10[0])
				{
					gate_FRAC10[0] = false;
					MoveDynamicObject(Gate_FRAC10[0], 285.93, 1821.51, 19.93, 3.0, 0.00, 0.00, 269.99);
				} else {
					gate_FRAC10[0] = true;
					MoveDynamicObject(Gate_FRAC10[0], 285.93, 1834.00, 19.93, 3.0, 0.00, 0.00, 269.99);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 126.9324,1943.6614,19.3348))
		{
			if(PI[playerid][Faction] == 10)
			{
				if(gate_FRAC10[1])
				{
					gate_FRAC10[1] = false;
					MoveDynamicObject(Gate_FRAC10[1], 134.90, 1941.47, 21.64, 3.0, 0.00, 0.00, 0.00);
				} else {
					gate_FRAC10[1] = true;
					MoveDynamicObject(Gate_FRAC10[1], 120.60, 1941.47, 21.64, 3.0, 0.00, 0.00, 0.009);
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 340.7826,1796.2115,18.1998))
		{
			if(PI[playerid][Faction] == 10)
			{
				if(gate_FRAC10[2])
				{
					MoveDynamicObject(Gate_FRAC10[2], 343, 1796.7, 18.14, 0.02, 0.00, 90.00, 32.25);
					gate_FRAC10[2] = false;
				} else {
					MoveDynamicObject(Gate_FRAC10[2], 343, 1796.71, 18.1402, 0.02, 0.00, 0.00, 32.25);
					gate_FRAC10[2] = true;
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 1544.2363,-1631.9282,13.3828)) // lspd
		{
			if(PI[playerid][Faction] == 4)
			{
				if(gate_LSPD[0])
				{
					MoveDynamicObject(Gate_LSPD[0], 1544.7, -1630.9, 13.2, 0.002, 0, 269, 270.25);
					gate_LSPD[0] = false;
				} else {
					MoveDynamicObject(Gate_LSPD[0], 1544.7, -1630.9, 13.202, 0.002, 0, 0, 270.25);
					gate_LSPD[0] = true;
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1572.7231,657.6440,7.1875)) //sfpd 1
		{
			if(PI[playerid][Faction] == 5)
			{
				if(!gate_SFPD[0])
				{
					MoveDynamicObject(Gate_SFPD[0], -1572.2002, 658.7998, 6.9, 0.2, 0, 0, 90);
					gate_SFPD[0] = true;
				} else {
					MoveDynamicObject(Gate_SFPD[0], -1572.2, 658.79999, 7, 0.2, 0, 91, 90);
					gate_SFPD[0] = false;
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, -1700.8533,688.6221,24.8906)) //sfpd2
		{
			if(PI[playerid][Faction] == 5)
			{
				if(gate_SFPD[1])
				{
					MoveDynamicObject(Gate_SFPD[1], -1701.5, 687.70001, 24.7, 0.2, 0, 269.5, 90.747);
					gate_SFPD[1] = false;
				} else {
					MoveDynamicObject(Gate_SFPD[1], -1701.5, 687.59998, 24.701, 0.2, 0, 0.5, 90.75);
					gate_SFPD[1] = true;
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 2238.7620,2449.3696,11.0372)) //lvpd 1
		{
			if(PI[playerid][Faction] == 6)
			{
				if(gate_LVPD[0])
				{
					MoveDynamicObject(Gate_LVPD[0], 2238.2002, 2450.4, 10.6, 0.002 , 0, 90.0, 90.245);
					gate_LVPD[0] = false;
				} else {
					MoveDynamicObject(Gate_LVPD[0], 2238.2002, 2450.4, 10.6002, 0.002, 0, 0, 90.245);
					gate_LVPD[0] = true;
				}
			}
		}
		else if(IsPlayerInRangeOfPoint(playerid, 1.0, 2351.3230,2424.3774,10.6378)) //lvpd 2
		{
			if(PI[playerid][Faction] == 6)
			{
				if(gate_LVPD[1])
				{
					MoveDynamicObject(Gate_LVPD[1], 2349.6006, 2424.2002, 10.4, 0.002, 0, 269.25, 0);
					gate_LVPD[1] = false;
				} else {
					MoveDynamicObject(Gate_LVPD[1], 2349.6006, 2424.2002, 10.402, 0.002, 0, 0, 0);
					gate_LVPD[1] = true;
				}
			}
		}
		else {
		
		}
	}
	return true;
}

public OnRconLoginAttempt(ip[], password[], success)
{
	new n;
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || strcmp(ip, PI[i][IP], true)) continue;
		if(success)
		{
			format(glstr, sizeof(glstr), "[RCON] {FFFF00}%s [%d] {00FF00}вошел", Name(i), i);
			SendAdminMessage(2000, glstr, i);
		} else {
			format(glstr, sizeof(glstr), "[RCON] {FFFF00}%s [%d] пытается войти, пароль: %s", Name(i), i, password);
			SendAdminMessage(2000, glstr, i);
		}
		n++;
		break;
	}
	if(n == 0)
	{
		if(success)
		{
			format(glstr, sizeof(glstr), "[RCON] {FFFF00}%s {00FF00}получил удаленный доступ", ip);
			SendAdminMessage(2000, glstr);
		} else {
			format(glstr, sizeof(glstr), "[RCON] {FFFF00}%s [%d] пытается получить удаленный доступ, пароль: %s", ip, password);
			SendAdminMessage(2000, glstr);
		}
	}
	return true;
}

public OnPlayerUpdate(playerid)
{
	if(PIpen[playerid][Cheater] == 1) return false;
	new wpid, ammoc;
	for(new w;w<=12;w++)
	{
		if(w == 0 || w == 10 || w == 12 || w == 11) continue;
		GetPlayerWeaponData(playerid, w, wpid, ammoc);
		if(wpid != PIwp[playerid][w] && wpid != 0 && ammoc != 0 && ammoc > 0) GivePlayerWeapon(playerid, wpid, -ammoc);
	}
	if(PI[playerid][AFK] > 0) PI[playerid][AFK] = 0;
	switch(GetPlayerAnimationIndex(playerid))
	{
	    //case 1247: if(PI[playerid][Want] > 7) ClearAnimations(playerid);
	}
	if(GetPVarInt(playerid, "Packed") == 1)
	{
		switch(GetPlayerAnimationIndex(playerid))
		{
			case 1132, 1136, 1137, 1138, 1141:
			{
				FoulPack(playerid);
			}
		}
	}
	return true;
}

public OnPlayerWeaponShot(playerid, weaponid, hittype, hitid, Float:fX, Float:fY, Float:fZ)
{
	switch(weaponid)
	{
		case 22: setPlayerSkill(playerid, 0, PI[playerid][SkillPistol1]+1);
		case 23: setPlayerSkill(playerid, 1, PI[playerid][SkillPistol2]+1);
		case 24: setPlayerSkill(playerid, 2, PI[playerid][SkillPistol3]+1);
		case 25: setPlayerSkill(playerid, 3, PI[playerid][SkillShotgun1]+1);
		case 26: setPlayerSkill(playerid, 4, PI[playerid][SkillShotgun2]+1);
		case 27: setPlayerSkill(playerid, 5, PI[playerid][SkillShotgun3]+1);
		case 28,32: setPlayerSkill(playerid, 6, PI[playerid][SkillUZI]+1);
		case 29: setPlayerSkill(playerid, 7, PI[playerid][SkillMP5]+1);
		case 30: setPlayerSkill(playerid, 8, PI[playerid][SkillAK47]+1);
		case 31: setPlayerSkill(playerid, 9, PI[playerid][SkillM4]+1);
		case 33,34: setPlayerSkill(playerid, 10, PI[playerid][SkillSniper]+1);
	}
	return true;
}

public OnPlayerStreamIn(playerid, forplayerid)
{
	return true;
}

public OnPlayerStreamOut(playerid, forplayerid)
{
	if(InGame(playerid))
	{
		if(GetPVarInt(forplayerid, "SpecID") == playerid) specPlayer(forplayerid, playerid);
	}
	return true;
}

public OnVehicleStreamIn(vehicleid, forplayerid)
{
	return true;
}

public OnVehicleStreamOut(vehicleid, forplayerid)
{
	return true;
}

public OnDialogResponse(playerid, dialogid, response, listitem, inputtext[])
{
	for(new i, s = strlen(inputtext); i < s; i ++)
    {
        if(inputtext[i] == '{') inputtext[i] = '(';
        if(inputtext[i] == '}') inputtext[i] = ')';
    }
	SetPVarInt(playerid, "NowDialog", dialogid);
	switch(dialogid)
	{
	    case D_REG:
	    {
			if(response)
			{
				if(emptyMessage(inputtext)) return firstJoin(playerid);
				if(strlen(inputtext) > 33)
				{
				    SendClientMessage(playerid, -1, "Слишком сложный пароль");
				    return firstJoin(playerid);
				}
				new password[33], year, month, day, hours, mins, sec;
				getdate(year, month, day);
				gettime(hours, mins, sec);
				format(PI[playerid][RegDate], 10, "%d.%d.%d", day, month, year);
				format(PI[playerid][RegTime], 10, "%d:%d:%d", hours, mins, sec);
				format(PI[playerid][LoginDate], 10, "%d.%d.%d", day, month, year);
				format(PI[playerid][LoginTime], 10, "%d:%d:%d", hours, mins, sec);
				md5(password, inputtext);
				mysql_format(mysql1, query1,sizeof(query1),"INSERT INTO `users` (`Nick`, `Password`, `RegIP`, `LastIP`, `RegDate`, `RegTime`, `LoginDate`, `LoginTime`) VALUES ('%s', '%s', '%s', '%s', '%s', '%s', '%s', '%s')", Name(playerid), password, PI[playerid][IP], PI[playerid][IP], PI[playerid][RegDate], PI[playerid][RegTime], PI[playerid][RegDate], PI[playerid][RegTime]);
				mysql_tquery(mysql1, query1, "CreateAccount", "d", playerid);
				SetPVarInt(playerid, "Logged", 1);
				SetPVarInt(playerid, "Register", 1);
				PI[playerid][Health] = 100.0;
				PI[playerid][Armor] = 0.0;
				ForceClassSelection(playerid);
				OnPlayerRequestClass(playerid, 1);
 				printf("[Регистрация] %s [%d] (%d) IP: %s",Name(playerid),playerid,PI[playerid][ID],PI[playerid][IP]);
				LoadPlayerTD(playerid);
			} else {
   				//firstJoin(playerid);
				AddDListItem(playerid, "Сменить ник", D_auth_nick);
				ShowPlayerDList(playerid, D_AUT_OPT, "{FFFFFF}Опции", "Выбрать", "Назад");
			}
	    }

	    case D_AUT:
	    {
			if(response)
			{
                if(emptyMessage(inputtext)) return firstJoin(playerid);
                mysql_format(mysql1, query1, sizeof(query1), "SELECT `Password` FROM  `users` WHERE `Nick` =  '%s'", Name(playerid));
			    mysql_tquery(mysql1, query1, "CheckPassword", "ds", playerid, inputtext);
			} else {
				AddDListItem(playerid, "Сменить ник", D_auth_nick);
				ShowPlayerDList(playerid, D_AUT_OPT, "{FFFFFF}Опции", "Выбрать", "Назад");
			}
	    }
	    case D_AUT_OPT:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case D_auth_nick: ShowPlayerDialog(playerid, D_AUT_NICK, DIALOG_STYLE_INPUT, "{FFFFFF}Смена ника", "{FFFFFF}Введи новый ник:", "Изменить", "Назад");
				}
			} else {
				firstJoin(playerid);
			}
		}
		case D_AUT_NICK:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_AUT_NICK, DIALOG_STYLE_INPUT, "{FFFFFF}Смена ника", "{FFFFFF}Введи новый ник:", "Изменить", "Назад");
				if(!IsRPNick(inputtext)) return ShowPlayerDialog(playerid, D_AUT_NICK, DIALOG_STYLE_INPUT, "{FFFFFF}Смена ника", "{FF0000}Некорректный ник\n\n{FFFFFF}Введи новый ник:", "Изменить", "Назад");
				SetPlayerName(playerid, inputtext);
				format(PI[playerid][Nick], 24, inputtext);
	         	return firstJoin(playerid);
			} else {
				AddDListItem(playerid, "Сменить ник", D_auth_nick);
				ShowPlayerDList(playerid, D_AUT_OPT, "{FFFFFF}Опции", "Выбрать", "Назад");
			}
		}

	    case D_SEX:
	    {
	        if(response)
	        {
				SetPlayerSkin(playerid, 78);
				PI[playerid][Sex] = 1;
			} else {
			    SetPlayerSkin(playerid, 54);
				PI[playerid][Sex] = 0;
			}
    		mysql_format(mysql1, query1,sizeof(query1),"UPDATE `users` SET `Sex` = '%d' WHERE `Nick` = '%s'", PI[playerid][Sex], Name(playerid));
			mysql_query(mysql1, query1, false);
			SetPlayerVirtualWorld(playerid, playerid+1);
			SetPlayerInterior(playerid, 0);
			SetPlayerPos(playerid, CamsRegSkinsLook[0][0], CamsRegSkinsLook[0][1], CamsRegSkinsLook[0][2]);
			SetPlayerFacingAngle(playerid, CamsRegSkinsLook[0][3]);
			SetPlayerCameraPos(playerid, CamsRegSkins[0][0], CamsRegSkins[0][1], CamsRegSkins[0][2]);
			SetPlayerCameraLookAt(playerid, CamsRegSkinsLook[0][0], CamsRegSkinsLook[0][1], CamsRegSkinsLook[0][2]);
			SelectTextDraw(playerid, 0xFFFFFF80);

			SkinRegPrev[playerid] = CreatePlayerTextDraw(playerid, 249.000000, 312.000000, " ");
			PlayerTextDrawBackgroundColor(playerid, SkinRegPrev[playerid], 80);
			PlayerTextDrawFont(playerid, SkinRegPrev[playerid], 5);
			PlayerTextDrawLetterSize(playerid, SkinRegPrev[playerid], 0.500000, 1.000000);
			PlayerTextDrawColor(playerid, SkinRegPrev[playerid], 16711935);
			PlayerTextDrawSetOutline(playerid, SkinRegPrev[playerid], 1);
			PlayerTextDrawSetProportional(playerid, SkinRegPrev[playerid], 1);
			PlayerTextDrawUseBox(playerid, SkinRegPrev[playerid], 1);
			PlayerTextDrawBoxColor(playerid, SkinRegPrev[playerid], -256);
			PlayerTextDrawTextSize(playerid, SkinRegPrev[playerid], 70.000000, 75.000000);
			PlayerTextDrawSetPreviewModel(playerid, SkinRegPrev[playerid], 19133);
			PlayerTextDrawSetPreviewRot(playerid, SkinRegPrev[playerid], 0.000000, 270.000000, 90.000000, 1.000000);
			PlayerTextDrawSetSelectable(playerid, SkinRegPrev[playerid], 1);

			SkinRegNext[playerid] = CreatePlayerTextDraw(playerid,320.000000, 312.000000, " ");
			PlayerTextDrawBackgroundColor(playerid, SkinRegNext[playerid], 80);
			PlayerTextDrawFont(playerid, SkinRegNext[playerid], 5);
			PlayerTextDrawLetterSize(playerid, SkinRegNext[playerid], 0.500000, 1.000000);
			PlayerTextDrawColor(playerid, SkinRegNext[playerid], 16711935);
			PlayerTextDrawSetOutline(playerid, SkinRegNext[playerid], 1);
			PlayerTextDrawSetProportional(playerid, SkinRegNext[playerid], 1);
			PlayerTextDrawUseBox(playerid, SkinRegNext[playerid], 1);
			PlayerTextDrawBoxColor(playerid, SkinRegNext[playerid], -256);
			PlayerTextDrawTextSize(playerid, SkinRegNext[playerid], 70.000000, 75.000000);
			PlayerTextDrawSetPreviewModel(playerid, SkinRegNext[playerid], 19133);
			PlayerTextDrawSetPreviewRot(playerid, SkinRegNext[playerid], 0.000000, 90.000000, 90.000000, 1.000000);
			PlayerTextDrawSetSelectable(playerid, SkinRegNext[playerid], 1);

			SkinRegEnter[playerid] = CreatePlayerTextDraw(playerid,292.000000, 388.000000, RTP("Далее"));
			PlayerTextDrawBackgroundColor(playerid, SkinRegEnter[playerid], 255);
			PlayerTextDrawFont(playerid, SkinRegEnter[playerid], 2);
			PlayerTextDrawLetterSize(playerid, SkinRegEnter[playerid], 0.439999, 2.500000);
			PlayerTextDrawColor(playerid, SkinRegEnter[playerid], -65281);
			PlayerTextDrawSetOutline(playerid, SkinRegEnter[playerid], 0);
			PlayerTextDrawSetProportional(playerid, SkinRegEnter[playerid], 1);
			PlayerTextDrawSetShadow(playerid, SkinRegEnter[playerid], 1);
			PlayerTextDrawSetSelectable(playerid, SkinRegEnter[playerid], 1);
			PlayerTextDrawShow(playerid, SkinRegNext[playerid]);
			PlayerTextDrawShow(playerid, SkinRegPrev[playerid]);
			PlayerTextDrawShow(playerid, SkinRegEnter[playerid]);
		}

		case D_NEWS:
		{
			if(PI[playerid][ReadNews] > 0) return ShowNews(playerid);
			if(!response) ShowMenu(playerid, D_INF);
		}

		case D_HISTORY:
		{
			SetCameraBehindPlayer(playerid);
			SetPlayerVirtualWorld(playerid, 0);
			format(glstr,sizeof(glstr),"Рекорд игроков на сервере: {FFFF00}%d", R[Players]);
			SendClientMessage(playerid, 0x00FF30FF, glstr);
			ResetPlayerMoney(playerid);
			GivePlayerMoney(playerid, PI[playerid][Money]);
			SetPVarInt(playerid, "History", 0);
		}

		case D_HOUSE:
		{
		    if(response)
		    {
				new hid = GetPVarInt(playerid, "MenuHouse");
		        switch(DLItemID)
		        {
		            case H_buy:
					{
						if(PI[playerid][Money] < HI[hid][Cost]) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает средств");
						//else if(PI[playerid][Level] < HI[hid][Level]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе пока нельзя купить дом этого класса");
						else if(HI[hid][Owner] != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Дом уже куплен");
						BuyHouse(playerid, hid);
						return SendClientMessage(playerid, 0x00FF00FF, "Ты купил себе дом");
					}
					case H_sell:
					{
					    SellHouse(playerid);
						return SendClientMessage(playerid, 0x00FF00FF, "Ты продал свой дом");
					}
					case H_rent:
					{
						if(HI[hid][CostRent] > 0)
						{
							if(PI[playerid][Level] == 1 && PI[playerid][Exp] == 0) return SendClientMessage(playerid, 0x00FF00FF, "Ты пока не можешь арендовать дом");
							RentHouse(playerid, hid);
							return SendClientMessage(playerid, 0x00FF00FF, "Ты арендовал дом");
						} else return SendClientMessage(playerid, COLOR_SYSTEM, "Владелец запретил аренду своего дома");
					}
					case H_unrent:
					{
						RentHouse(playerid, 0);
						return SendClientMessage(playerid, 0x00FF00FF, "Ты выселился");
					}
					case H_rentcost: ShowPlayerDialog(playerid, D_HOUSE_RENT, DIALOG_STYLE_INPUT, "{FFFFFF}Стоимость аренды", "{FFFFFF}Напиши стоимость аренды твоего дома\nНичего не вводи, если хочешь запретить аренду", "Изменить", "Назад");
					case H_obuy:
					{
						if(PI[playerid][Money] < HI[hid][CostSell]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе не хватает денег");
						SellToBuyHouse(hid, playerid);
					}
					case H_safe: ShowMenu(playerid, D_HOUSE_BANK);
					case H_unlock:
					{
						HI[hid][Locked] = false;
						HI[hid][LockID] = CreateDynamicPickup(1318, 23, HI[hid][StreetX], HI[hid][StreetY], HI[hid][StreetZ]+1.0, 0, 0, -1, 100.0);
					}
					case H_lock:
					{
						HI[hid][Locked] = true;
						DestroyDynamicPickup(HI[hid][LockID]);
					}
					case H_label: ShowPlayerDialog(playerid, D_HOUSE_LABEL, DIALOG_STYLE_INPUT, "{FFFFFF}Имя для дома", "{FFFFFF}Напиши новое имя для твоего дома\nМожно использовать цвет, например: (FF0000)имя - {FF0000}имя", "Установить", "Назад");
					case H_tosell:
					{
						format(glstr,sizeof(glstr),"{FFFFFF}Укажи цену для своего дома\nМинимальная цена твоего дома: {00FF00}$%d", HI[hid][Cost]);
						ShowPlayerDialog(playerid, D_HOUSE_SELL, DIALOG_STYLE_INPUT, "{FFFFFF}Выставление дома на продажу", glstr, "Выставить", "Назад");
					}
					case H_unsell:
					{
						SetHouseToSell(PI[playerid][House], 0);
						SendClientMessage(playerid, -1, "Ты снял свой дом с продажи");
					}
		        }
		    }
		}
		case D_HOUSE_RENT:
		{
		    if(response)
		    {
		        if(strval(inputtext) < 0 || strval(inputtext) > 1000000) return ShowPlayerDialog(playerid, D_HOUSE_RENT, DIALOG_STYLE_INPUT, "{FFFFFF}Стоимость аренды", "{FF0000}Неверная стоимость, не менее 1 и не более 1000000\n\n{FFFFFF}Напиши стоимость аренды твоего дома", "Изменить", "Назад");
		        HI[PI[playerid][House]][CostRent] = strval(inputtext);
		        UpdateHouseInfo(PI[playerid][House]);
		        OnPlayerCommandText(playerid, "/менюдома");
				if(emptyMessage(inputtext))
				{
					SendClientMessage(playerid, 0x00FF00FF, "Теперь твой дом нельзя арендовать");
				} else {
					SendClientMessage(playerid, 0x00FF00FF, "Ты изменил стоимость аренды");
				}
				mysql_format(mysql1, query1, sizeof(query1), "UPDATE `houses` SET `CostRent` = '%d' WHERE `ID` = '%d'", strval(inputtext), HI[PI[playerid][House]][ID]);
				mysql_query(mysql1, query1, false);
		    } else OnPlayerCommandText(playerid, "/менюдома");
		}
		case D_HOUSE_BANK:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case HOUSE_BANK_ADD:
					{
						format(glstr, sizeof(glstr), "{FFFFFF}В сейфе твоего дома: {00FF00}$%d\n{FFFFFF}У тебя на руках: {00FF00}$%d", HI[PI[playerid][House]][Bank], PI[playerid][Money]);
						ShowPlayerDialog(playerid, D_HOUSE_BANK_G, DIALOG_STYLE_INPUT, "{FFFFFF}Положить деньги в сейф", glstr, "Положить", "Назад");
					}
					case HOUSE_BANK_REM:
					{
						format(glstr, sizeof(glstr), "{FFFFFF}В сейфе твоего дома: {00FF00}$%d", HI[PI[playerid][House]][Bank]);
						ShowPlayerDialog(playerid, D_HOUSE_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Взять деньги из сейфа", glstr, "Взять", "Назад");
					}
				}
			} else OnPlayerCommandText(playerid, "/менюдома");
		}
		case D_HOUSE_BANK_G:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return format(glstr, sizeof(glstr), "{FFFFFF}В сейфе твоего дома: {00FF00}$%d\n{FFFFFF}У тебя на руках: {00FF00}$%d", HI[PI[playerid][House]][Bank], PI[playerid][Money]), ShowPlayerDialog(playerid, D_HOUSE_BANK_G, DIALOG_STYLE_INPUT, "{FFFFFF}Положить деньги в сейф", glstr, "Положить", "Назад");
				else if(strval(inputtext) > PI[playerid][Money] || strval(inputtext) < 1) return format(glstr, sizeof(glstr), "{FF0000}Неверная сумма\n\n{FFFFFF}В сейфе твоего дома: {00FF00}$%d\n{FFFFFF}У тебя на руках: {00FF00}$%d", HI[PI[playerid][House]][Bank], PI[playerid][Money]), ShowPlayerDialog(playerid, D_HOUSE_BANK_G, DIALOG_STYLE_INPUT, "{FFFFFF}Положить деньги в сейф", glstr, "Положить", "Назад");
				SetHouseMoney(PI[playerid][House], HI[PI[playerid][House]][Bank]+strval(inputtext));
				removePlayerMoney(playerid, strval(inputtext));
				OnPlayerCommandText(playerid, "/менюдома");
			} else ShowMenu(playerid, D_HOUSE_BANK);
		}
		case D_HOUSE_BANK_R:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return format(glstr, sizeof(glstr), "{FFFFFF}В сейфе твоего дома: {00FF00}$%d", HI[PI[playerid][House]][Bank]), ShowPlayerDialog(playerid, D_HOUSE_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Взять деньги из сейфа", glstr, "Взять", "Назад");
				else if(strval(inputtext) > HI[PI[playerid][House]][Bank] || strval(inputtext) < 1) return format(glstr, sizeof(glstr), "{FF0000}Неверная сумма\n\n{FFFFFF}В сейфе твоего дома: {00FF00}$%d", HI[PI[playerid][House]][Bank]), ShowPlayerDialog(playerid, D_HOUSE_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Взять деньги из сейфа", glstr, "Взять", "Назад");
				SetHouseMoney(PI[playerid][House], HI[PI[playerid][House]][Bank]-strval(inputtext));
				givePlayerMoney(playerid, strval(inputtext));
				OnPlayerCommandText(playerid, "/менюдома");
			} else ShowMenu(playerid, D_HOUSE_BANK);
		}
		case D_HOUSE_LABEL:
		{
			if(response)
			{
				if(strlen(inputtext) > 64) return ShowPlayerDialog(playerid, D_HOUSE_LABEL, DIALOG_STYLE_INPUT, "{FFFFFF}Имя для дома", "{FF0000}Слишком большая длина\n\n{FFFFFF}Напиши новое имя для твоего дома\nМожно использовать цвет, например: (FF0000)имя - {FF0000}имя", "Установить", "Назад");
				if(emptyMessage(inputtext))
				{
					SetHouseName(PI[playerid][House], "NULL");
				} else {
					replaceString(inputtext, " ", " ");
					SetHouseName(PI[playerid][House], inputtext);
				}
			} else OnPlayerCommandText(playerid, "/менюдома");
		}
		case D_HOUSE_SELL:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return format(glstr,sizeof(glstr),"{FFFFFF}Укажи цену для своего дома\nМинимальная цена твоего дома: {00FF00}$%d", HI[PI[playerid][House]][Cost]), ShowPlayerDialog(playerid, D_HOUSE_SELL, DIALOG_STYLE_INPUT, "{FFFFFF}Выставление дома на продажу", glstr, "Выставить", "Назад");
				if(strval(inputtext) < HI[PI[playerid][House]][Cost]) return format(glstr,sizeof(glstr),"{FF0000}Слишком низкая цена\n\n{FFFFFF}Укажи цену для своего дома\nМинимальная цена твоего дома: {00FF00}$%d", HI[PI[playerid][House]][Cost]), ShowPlayerDialog(playerid, D_HOUSE_SELL, DIALOG_STYLE_INPUT, "{FFFFFF}Выставление дома на продажу", glstr, "Выставить", "Назад");
				SetHouseToSell(PI[playerid][House], strval(inputtext));
				SendClientMessage(playerid, 0x00FF00FF, "Ты выставил свой дом на продажу");
			} else OnPlayerCommandText(playerid, "/менюдома");
		}

		case ADMIN:
		{
			if(response)
		    {
				switch(DLItemID)
				{
					case ADM_veh: ShowMenu(playerid, ADMIN_VEH);
					case ADM_chat: ShowMenu(playerid, ADMIN_CHAT);
					case ADM_other: ShowMenu(playerid, ADMIN_OTHER);
					case ADM_soe: ShowPlayerDialog(playerid, DIALOG_SOE, DIALOG_STYLE_LIST, "Редактор объектов", "Инструкция\nСоздать объект\nИзменить карту","Выбрать","Выход");
					case ADM_info: 
					{
						new body[3406];
						if(PI[playerid][Admin] >= 10)
						{
							strcat(body, "\
							{00FF00}/от [ID игрока] [текст] {FFFFFF}- ответ на вопрос в репорт игроку\n\
							{00FF00}/зр [ID] [время] {FFFFFF}- запретить игроку писать в репорт (0 - разрешить)\n\
							{00FF00}/а [текст] {FFFFFF}- написать в админ чат\
							");
						}
						if(PI[playerid][Admin] >= 100)
						{
							strcat(body,"\n\
							{00FF00}/чм [ID] {FFFFFF}- кинуть игрока в ЧМ или вытащить\n\
							{00FF00}/т [ID] [время] {FFFFFF}- посадить игрока в тюрьму (0 - выпустить)\n\
							{00FF00}/зк [ID] [время] {FFFFFF}- закрытие команд игроку (0 - открыть)\n\
							{00FF00}/з [ID] [время] {FFFFFF}- заглушка чата игроку (0 - разглушить) - только автозаглушка\n\
							{00FF00}/и [ID] {FFFFFF}- меню игрока\
							");
						}
						if(PI[playerid][Admin] >= 500)
						{
							strcat(body,"\n\
							{00FF00}/прыг [дистанция] [высота] {FFFFFF}- воздушный прыжок\
							");
						}
						if(PI[playerid][Admin] >= 700)
						{
							strcat(body,"\n\
							{00FF00}/ник [ID игрока] [новый ник] {FFFFFF}- сменить никнейм игроку\n\
							{00FF00}/тпи [ID игрока] {FFFFFF}- телепортировать к себе игрока\n\
							{00FF00}/тп [ID игрока] {FFFFFF}- телепортироваться к игроку\n\
							{00FF00}/тдом [номер] {FFFFFF}- телепорт к дому\n\
							{00FF00}/пол [ID игрока] {FFFFFF}- установить мужской/женский пол игроку\n\
							{00FF00}/ачат [текст] {FFFFFF}- написать в общий чат от имени админа\n\
							{00FF00}/м [ID транспорта] {FFFFFF}- заказать транспорт\
							");
						}
						if(PI[playerid][Admin] >= 800)
						{
							strcat(body,"\n\
							{00FF00}/ранг [ID игрока] [ID ранг] {FFFFFF}- установить ранг во фракции игроку\n\
							{00FF00}/скилл [ID игрока] [ID скилла] [уровень] {FFFFFF}- Установить скилл игроку\n\
							{00FF00}/тпк [X] [Y] [Z] {FFFFFF}- телепорт по координатам\n\
							{00FF00}/ттп {FFFFFF}- телепорт в сохраненную точку (/ттп 1 - сохранить текущую позицию)\n\
							{00FF00}/лдр [ID игрока] [ID фракции] {FFFFFF}- назначить лидером фракции игрока\
							");
						}
						if(PI[playerid][Admin] >= 1000)
						{
							strcat(body,"\n\
							{00FF00}/кик [ID игрока] {FFFFFF}- исключить игрока с сервера\n\
							{00FF00}/бан [ID игрока] {FFFFFF}- забанить игрока\n\
							{00FF00}/пбан [ID игрока] {FFFFFF}- забанить подсеть игрока\n\
							{00FF00}/уровень [ID игрока] [количество] [действие] {FFFFFF}- выдать или изменить уровень игроку\n\
							{00FF00}/деньги [ID игрока] [количество] [действие] {FFFFFF}- выдать или изменить количество денег игроку\n\
							{00FF00}/скин [ID игрока] [ID скина] {FFFFFF}- изменить скин игроку\n\
							");
							strcat(body,"\
							{00FF00}/оружие [ID игрока] [ID оружия] [кол-во патронов] {FFFFFF}- выдать оружие игроку\n\
							{00FF00}/инт [ID игрока] [ID интерьера] {FFFFFF}- изменить интерьер игроку\n\
							{00FF00}/погода [ID погоды] {FFFFFF}- изменить погоду\n\
							{00FF00}/вмир [ID игрока] [ID мира] {FFFFFF}- изменить мир игроку\n\
							{00FF00}/ценадом [ID дома] [цена] {FFFFFF}- изменить цену дома\n\
							{00FF00}/урдом [ID дома] [уровень] {FFFFFF}- изменить уровень дома\n\
							");
							strcat(body,"\
							{00FF00}/прдом [ID дома] {FFFFFF}- продать дом\n\
							{00FF00}/мдомтест [ID дома] {FFFFFF}- тест транспорта рядом с домом\n\
							{00FF00}/хп [ID игрока] [количество] [тип] {FFFFFF}- изменить здоровье игроку (0 - хп | 1 - броня)\n\
							{00FF00}/упр [ID игрока] {FFFFFF}- отключить/включить управление игроку\n\
							");
							strcat(body,"\
							{00FF00}/паспорт [ID игрока] {FFFFFF}- выдать/забрать паспорт игроку\n\
							{00FF00}/водправа [ID игрока] {FFFFFF}- выдать/забрать водительское удостоверение у игрока\n\
							{00FF00}/урадм [ID игрока] [уровень] {FFFFFF}- изменить уровень админки игроку\
							");
						}
						if(PI[playerid][Admin] >= 1500)
						{
							strcat(body,"\n\
							{00FF00}/обнз [ID игрока] {FFFFFF}- обнулить количество заглушек игрока\n\
							{00FF00}/обнч [ID игрока] {FFFFFF}- обнулить количество попаданий в читмир игроку\n\
							");
							strcat(body,"\
							{00FF00}/инттест [ID интерьера] {FFFFFF}- тест интерьера\n\
							{00FF00}/ддом [ID интерьера] [класс] {FFFFFF}- добавить дом\n\
							{00FF00}/интдом [ID дома] [номер интерьера] {FFFFFF}- изменить интерьер дома\n\
							{00FF00}/пдом [ID дома] {FFFFFF}- переместить дом\n\
							{00FF00}/мдом [ID дома] {FFFFFF}- установить позицию транспорта у дома\n\
							");
						}
						if(PI[playerid][Admin] >= 2000)
						{
							strcat(body,"\
							{00FF00}/сохракк {FFFFFF}- сохранить аккаунты на сервере\n\
							{00FF00}/удак [ник] {FFFFFF}- удалить аккаунт игрока\
							");
						}
						ShowPlayerDialog(playerid, ADMIN_OTHER, DIALOG_STYLE_MSGBOX, "{FFFFFF}Доступные тебе команды", body, "Выход", "Назад");
					}
				}
			} else OnPlayerCommandText(playerid, "/mn");
		}
		case ADMIN_VEH:
		{
		    if(response)
		    {
		        switch(DLItemID)
		        {
	      			case ADM_veh_info: {}
	         		case ADM_veh_unlock:
					{
						for(new i;i<MAX_VEHICLES;i++)
						{
							if(!VehicleInPlayer(i, playerid, 10.0) || !IsVehicleInGame(i)) continue;
							CarLocked[i] = false;
						}
						SendClientMessage(playerid, -1, "Ближайший транспорт открыт");
						format(glstr,sizeof(glstr),"Админ %s [%d] открыл ближайший транспорт", Name(playerid), PI[playerid][ID]);
						alog(glstr, 0);
					}
			        case ADM_veh_unuseresp:
					{
						for(new i;i<MAX_VEHICLES;i++)
						{
							if(VehOfPlayer[i] || VehUsed[i] || !IsVehicleInGame(i)) continue;
							Engine[i] = false;
							SetVehicleToRespawn(i);
						}
						SendClientMessage(playerid, -1, "Неиспользуемый транспорт отправлен на респаун");
						format(glstr,sizeof(glstr),"Админ %s [%d] отправил неиспользуемый транспорт на респаун", Name(playerid), PI[playerid][ID]);
						alog(glstr, 0);
					}
			        case ADM_veh_repair:
					{
						if(!IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не в машине");
						RepairVehicle(GetPlayerVehicleID(playerid));
					}
					case ADM_veh_fuel:
					{
						if(!IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не в машине");
						SetVehicleFuel(GetPlayerVehicleID(playerid), 100);
					}
					case ADM_veh_resp:
					{
						new plid;
						for(new i;i<MAX_VEHICLES;i++)
						{
							if(!VehicleInPlayer(i, playerid, 50.0) || !IsVehicleInGame(i)) continue;
							if(VehOfPlayer[i])
							{
								for(new j;j<PLAYERS;j++)
								{
									if(!InGame(j) || PIcar[j][CarGUID] != i) continue;
									plid = j;
									break;
								}
								DestroyPlayerCar(plid);
								SpawnPlayerCar(plid);
							} else {
								SetVehicleToRespawn(i);
							}
						}
						SendClientMessage(playerid, -1, "Ближайший транспорт отправлен на респаун");
						format(glstr,sizeof(glstr),"Админ %s [%d] отправил ближайший транспорт на респаун", Name(playerid), PI[playerid][ID]);
						alog(glstr, 0);
					}
					case ADM_veh_adel:
					{
						if(AdminCarCount[playerid] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не создавал транспорт");
						for(new i;i<10;i++)
						{
							DestroyAdminVehicle(AdminCarID[playerid][i]);
						}
						AdminCarCount[playerid] = 0;
						SendClientMessage(playerid, -1, "Весь созданный транспорт удален");
						format(glstr,sizeof(glstr),"Админ %s [%d] удалил созданный транспорт", Name(playerid), PI[playerid][ID]);
						alog(glstr, 0);
					}
			        case ADM_veh_alladminresp:
					{
						if(AdminsCarsCount == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Никто не создавал транспорт");
						for(new i;i<MAX_VEHICLES;i++)
						{
							if(!VehOfAdmin[i] || !IsVehicleInGame(i)) continue;
							DestroyAdminVehicle(i);
						}
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i) || PI[i][Admin] < 700) continue;
							AdminCarCount[i] = 0;
						}
						AdminsCarsCount = 0;
						SendClientMessage(playerid, -1, "Весь транспорт админов удален");
						format(glstr,sizeof(glstr),"Админ %s [%d] удалил весь транспорт админов", Name(playerid), PI[playerid][ID]);
						alog(glstr, 0);
					}
				}
		    } else ShowMenu(playerid, ADMIN);
		}
		case ADMIN_CHAT:
		{
		    if(response)
		    {
		        switch(DLItemID)
		        {
	      			case ADM_chat_say: ShowPlayerDialog(playerid, ADMIN_CHAT_IN, DIALOG_STYLE_INPUT, "{FFFFFF}Чат для админов", "Напиши сообщение ниже", "Отправить", "Назад");
	         		case ADM_chat_IC: {
	      			    if(GetPVarInt(playerid, "ShowIC") == 1)
	      			    {
	      			        SetPVarInt(playerid, "ShowIC", 0);
	      			    } else {
	      			        SetPVarInt(playerid, "ShowIC", 1);
	      			    }
			        	ShowMenu(playerid, ADMIN_CHAT);
	      			}
			        case ADM_chat_OOC: {
	      			    if(GetPVarInt(playerid, "ShowOOC") == 1)
	      			    {
	      			        SetPVarInt(playerid, "ShowOOC", 0);
	      			    } else {
	      			        SetPVarInt(playerid, "ShowOOC", 1);
	      			    }
			        	ShowMenu(playerid, ADMIN_CHAT);
	      			}
					case ADM_chat_adv: ShowPlayerDialog(playerid, ADMIN_CHAT_ALL, DIALOG_STYLE_INPUT, "{FFFFFF}Сообщение админа", "Напиши сообщение для всех игроков на сервере", "Отправить", "Назад");
					case ADM_chat_gl: {
					    if(globalchat)
	      			    {
	      			        globalchat = false;
	      			        SendClientMessage(playerid, COLOR_ADMIN_A, "Глобальный чат отключён");
	      			    } else {
	      			        globalchat = true;
	      			        SendClientMessage(playerid, COLOR_ADMIN_A, "Глобальный чат включён");
	      			    }
			        	ShowMenu(playerid, ADMIN_CHAT);
					}
				}
		    } else ShowMenu(playerid, ADMIN);
		}
		case ADMIN_CHAT_IN:
		{
		    if(response)
		    {
		        if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, ADMIN_CHAT_IN, DIALOG_STYLE_INPUT, "{FFFFFF}Чат для админов", "Напиши сообщение ниже", "Отправить", "Назад");
		        new cm[144];
		        format(cm,sizeof(cm),"/а %s", inputtext);
		        OnPlayerCommandText(playerid, cm);
		        ShowPlayerDialog(playerid, ADMIN_CHAT_IN, DIALOG_STYLE_INPUT, "{FFFFFF}Чат для админов", "Напиши сообщение ниже", "Отправить", "Назад");
		    } else ShowMenu(playerid, ADMIN_CHAT);
		}
		case ADMIN_CHAT_ALL:
		{
		    if(response)
		    {
		        if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, ADMIN_CHAT_ALL, DIALOG_STYLE_INPUT, "{FFFFFF}Сообщение админа", "Напиши сообщение для всех игроков на сервере", "Отправить", "Назад");
		        new cm[144];
		        format(cm,sizeof(cm),"/ачат %s", inputtext);
		        OnPlayerCommandText(playerid, cm);
		        ShowPlayerDialog(playerid, ADMIN_CHAT_ALL, DIALOG_STYLE_INPUT, "{FFFFFF}Сообщение админа", "Напиши сообщение для всех игроков на сервере", "Отправить", "Назад");
		    } else ShowMenu(playerid, ADMIN_CHAT);
		}
        case ADMIN_OTHER:
		{
		    if(response)
		    {
		        switch(DLItemID)
		        {
					case ADM_other_gm: {
						if(PI[playerid][GodMode] == 0)
						{
							PI[playerid][GodMode] = 1;
						} else {
							PI[playerid][GodMode] = 0;
							setPlayerHealth(playerid, 100.0);
						}
						ShowMenu(playerid, ADMIN_OTHER);
					}
					case ADM_other_kills: {
						if(PI[playerid][ShowKills] == 0)
						{
							PI[playerid][ShowKills] = 1;
						} else {
							PI[playerid][ShowKills] = 0;
						}
						ShowMenu(playerid, ADMIN_OTHER);
					}
					case ADM_other_bh: {
						if(PI[playerid][BH] == 0)
						{
							PI[playerid][BH] = 1;
						} else {
							PI[playerid][BH] = 0;
						}
						ShowMenu(playerid, ADMIN_OTHER);
					}
					case ADM_other_abh: {
						if(Bunny)
						{
							Bunny = false;
						} else {
							Bunny = true;
						}
						ShowMenu(playerid, ADMIN_OTHER);
					}
					case ADM_other_inhs: {
						if(PI[playerid][OpenHouses] == 1)
	      			    {
							PI[playerid][OpenHouses] = 0;
	      			    } else {
							PI[playerid][OpenHouses] = 1;
	      			    }
						ShowMenu(playerid, ADMIN_OTHER);
					}
	      			case ADM_other_tpmap: {
	      			    if(PI[playerid][TPMap] == 1)
	      			    {
							PI[playerid][TPMap] = 0;
	      			    } else {
							PI[playerid][TPMap] = 1;
	      			    }
						ShowMenu(playerid, ADMIN_OTHER);
	      			}
					case ADM_other_saveall: OnPlayerCommandText(playerid, "/сохракк");
	         		case ADM_other_restart: {
						ShowPlayerDialog(playerid, D_RESTART, DIALOG_STYLE_MSGBOX, "{FFFFFF}Рестарт", "{FFFF00}Запустить таймер новостей?", "Да","Нет");
					}
			        case ADM_other_showkeys: {
	      			    if(PI[playerid][ShowKeys] == 1)
	      			    {
							PI[playerid][ShowKeys] = 0;
	      			    } else {
							PI[playerid][ShowKeys] = 1;
	      			    }
						ShowMenu(playerid, ADMIN_OTHER);
					}
					case ADM_other_fly:
					{
						if(GetPVarType(playerid, "FlyMode")) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в режиме наблюдения");
						else if(GetPVarType(playerid, "InSpec")) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в режиме наблюдения");
						else if(IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в транспорте");
						else if(GetPlayerInterior(playerid) != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в здании");
						else if(GetPlayerVirtualWorld(playerid) != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты в неподходящем месте");
						FlyMode(playerid);
					}
				}
		    } else ShowMenu(playerid, ADMIN);
		}
		case D_HELP:
		{
			if(response)
			{
				new body[512] = "{FFFF00}";
				switch(listitem)
				{
					case 0:
					{
						strcat(body,
						"\
						Вы можете общаться с другими игроками через чат в левом верхнем углу\n\
						Для отправки сообщения нажмите клавишу F6, напечатайте текст и нажмите Enter\n\
						Так же с помощью чата производится отправка команд\
						");
					}
					case 1:
					{
						strcat(body,
						"\
						Список игроков можно посмотреть нажав клавишу Tab\n\
						\n\
						Там отобразится:\n\
						-Номер игрока (ID)\n\
						-Ник игрока\n\
						-Уровень игрока\n\
						-Связь игрока с сервером (пинг)\n\
						\n\
						Двойной клик по нику откроет меню игрока\
						");
					}
					case 2:
					{
						strcat(body,
						"\
						Играя на сервере ваш уровень повышается автоматически\n\
						Каждый уровень требует определённого количества опыта\n\
						Каждый отыгранный час приносит +1 к опыту\n\
						Каждый новый уровень открывает новые возможности\n\
						Так же вы можете зарабатывать деньги, покупать дома, транспорт\n\
						Вступить в банду, стать членом мафии или другой фракции\n\
						А также многое многое другое\
						");
					}
					case 3:
					{
						strcat(body,
						"\
						Role Play - вид игры, в котором у каждого своя роль\n\
						Это может быть таксист, водитель автобуса, шахтёр или полицейский\n\
						Каждый определяет кем он хочет быть\n\
						\n\
						Состоя в полиции вы следите за порядком\n\
						Репортёром вы ведёте свой канал новостей\n\
						Работая врачём вы помогаете другим людям\n\
						Служа в армии вы получаете новые навыки\n\
						Состоя в банде вы охраняете свою территорию\n\
						\n\
						Role Play подразумевает в себе некоторые правила\n\
						Нарушение которых ведёт к наказаниям\
						");
					}
					case 4:
					{
						strcat(body,
						"\
						Для начала вам надо подзаработать\n\
						Вы можете устроиться грузчиком или шахтёром\n\
						Добраться можно на бесплатном городском транспорте или же такси\n\
						\n\
						Чтобы найти нужное тебе место подойди карте с навигатором\n\
						Данные навигатора ты сможеш загрузить на телефон\n\
						Далее сдача прав\n\
						Автошкола находится в Сан-Фиерро\n\
						\n\
						После получения прав можно устроиться на официальную работу в мэрии\
						");
					}
					case 5:
					{
						strcat(body,
						"\
						Для управления машиной вам нужны водительские права\n\
						Получить водительские права можно в автошколе Сан-Фиерро\n\
						\n\
						Без них вы можете управлять только мотороллерами и велосипедами\n\
						\n\
						Для передвижения по городу можно использовать автобусы и такси\n\
						Для посадки на пассажирское место используй клавишу G\n\
						\n\
						Подзаправить транспорт можно на любой бензоколонке\n\
						\n\
						При нарушении ПДД (правила дорожного движения) вас могут оштрафовать и забрать права\
						");
					}
					case 6:
					{
						strcat(body,
						"\
						Некоторые профессии доступны всем гражданам\n\
						На другие устроиться можно только в мэрии\n\
						А попасть в организацию только пройдя отбор\
						");
					}
					case 7:
					{
						strcat(body,
						"\
						Для ношения оружия необходима лицензия\n\
						С ним вы можете нарушить закон и вас объявят в розыск\n\
						\n\
						Ваш навык стрельбы со временем улучшается, и вы можете стать проффесиональным стрелком\
						");
					}
					case 8:
					{
						strcat(body,
						"\
						Вы можете купить себе дом или квартиру\n\
						Рядом с квартирой есть место для парковки на которое можно купить транспорт\n\
						Дома поделены на классы от 1 до 7\n\
						Они соответствуют необходимым уровням персонажа для их покупки\
						");
					}
					case 9:
					{
						strcat(body,
						"\
						Транспорт вы можете приобрести в автосалоне Сан-Фиерро\n\
						\n\
						Если у вас аренда, то транспорт купить нельзя\
						");
					}
				}
				ShowPlayerDialog(playerid, D_HELP_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Помощь", body, "Выход", "Назад");
			}
		}
		case D_HELP_INFO: if(!response) ShowMenu(playerid, D_HELP);
		case D_STATS:
		{
			if(response)
			{
				ShowStats(GetPVarInt(playerid, "ClickedPlayer"),playerid,listitem);
			} else {
				ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"), playerid);
			}
		}
		case D_STATS_INFO: 
		if(!response) 
		{
			{
				format(glstr,sizeof(glstr),"/и %d", GetPVarInt(playerid, "ClickedPlayer"));
				OnPlayerCommandText(playerid,glstr);
				//ShowMenu(playerid, D_STATS);
			}
		}
		case D_WORK_BUS_COST:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_WORK_BUS_COST, DIALOG_STYLE_INPUT, "{FFFFFF}Цена проезда", "{FFFFFF}Введи стоимость проезда в твоём автобусе", "Далее", "Выход");
				else if(strval(inputtext) < 1 || strval(inputtext) > 100) return ShowPlayerDialog(playerid, D_WORK_BUS_COST, DIALOG_STYLE_INPUT, "{FFFFFF}Цена проезда", "{FF0000}Не меньше 1$ и не больше 100$\n\n{FFFFFF}Введи стоимость проезда в твоём автобусе", "Далее", "Выход");
				SetPVarInt(playerid, "BusCost", strval(inputtext));
				SetPVarInt(playerid, "IsOnJob", 1);
				switch(GetPVarInt(playerid, "BusWay"))
				{
					case 1:
					{
						TogglePlayerDynamicRaceCP(playerid, BusWay1CP[0], true);
						format(glstr, sizeof(glstr), "{FFFF00}Автовокзал ЛС - Автошкола\n{FFFFFF}Стоимость проезда: {00FF30}$%d", strval(inputtext));
						BusLabel[playerid] = CreateDynamic3DTextLabel(glstr, 0xFFFFFFDD, 0.0,0.0,0.0, 40.0, INVALID_PLAYER_ID, GetPlayerVehicleID(playerid), 1, 0, 0, -1, 50.0);
					}
					case 2:
					{
						TogglePlayerDynamicRaceCP(playerid, BusWay2CP[0], true);
						format(glstr, sizeof(glstr), "{FFFF00}Автовокзал ЛС - Шахта\n{FFFFFF}Стоимость проезда: {00FF30}$%d", strval(inputtext));
						BusLabel[playerid] = CreateDynamic3DTextLabel(glstr, 0xFFFFFFDD, 0.0,0.0,0.0, 40.0, INVALID_PLAYER_ID, GetPlayerVehicleID(playerid), 1, 0, 0, -1, 50.0);
					}
					case 3:
					{
						TogglePlayerDynamicRaceCP(playerid, BusWay3CP[0], true);
						format(glstr, sizeof(glstr), "{FFFF00}Автовокзал СФ - Автовокзал ЛВ\n{FFFFFF}Стоимость проезда: {00FF30}$%d", strval(inputtext));
						BusLabel[playerid] = CreateDynamic3DTextLabel(glstr, 0xFFFFFFDD, 0.0,0.0,0.0, 40.0, INVALID_PLAYER_ID, GetPlayerVehicleID(playerid), 1, 0, 0, -1, 50.0);
					}
					case 4:
					{
						TogglePlayerDynamicRaceCP(playerid, BusWay4CP[0], true);
						format(glstr, sizeof(glstr), "{FFFF00}Автовокзал СФ - Шахта ЛВ\n{FFFFFF}Стоимость проезда: {00FF30}$%d", strval(inputtext));
						BusLabel[playerid] = CreateDynamic3DTextLabel(glstr, 0xFFFFFFDD, 0.0,0.0,0.0, 40.0, INVALID_PLAYER_ID, GetPlayerVehicleID(playerid), 1, 0, 0, -1, 50.0);
					}
				}
			}
		}
		case D_WORK_BUS:
		{
			if(response)
			{
				SetPVarInt(playerid, "BusWay", listitem+1);
				ShowPlayerDialog(playerid, D_WORK_BUS_COST, DIALOG_STYLE_INPUT, "{FFFFFF}Цена проезда", "{FFFFFF}Введи стоимость проезда в твоём автобусе", "Далее", "Выход");
			}
		}
		case D_WORK_S:
		{
			if(response)
			{
				if(GetPVarInt(playerid, "IsOnJob") == 1)
				{
					EndJob(playerid);
				} else {
					SetPVarInt(playerid, "IsOnJob", 1);
					SendClientMessage(playerid, 0x00FF00FF, "Ты начал рабочий день");
				}
			}
		}
		case D_WORK:
		{
			if(response)
			{
				if(PI[playerid][Job] == 0)
				{
					switch(listitem)
					{
						case 0:
						{
							if(PI[playerid][Level] < 2) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нужен 2 уровень");
							else if(PI[playerid][Faction] != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты состоишь во фракции");
							PI[playerid][Job] = 1;
							SendClientMessage(playerid, 0x00FF00FF, "Ты устроился водителем такси");
						}
						case 1:
						{
							if(PI[playerid][Level] < 3) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нужен 3 уровень");
							else if(PI[playerid][Faction] != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты состоишь во фракции");
							PI[playerid][Job] = 2;
							SendClientMessage(playerid, 0x00FF00FF, "Ты устроился водителем автобуса");
						}
					}
				} else {
					PI[playerid][Job] = 0;
					SendClientMessage(playerid, 0x00FF00FF, "Ты уволился с работы");
				}
			}
		}
		case D_ATM:
		{
			if(response)
			{
				switch(listitem)
				{
					case 0:
					{
						ShowPlayerDialog(playerid, D_ATM_PHONE_G, DIALOG_STYLE_INPUT, "{FFFFFF}Баланс сим-карты","{FFFFFF}Введи сумму, которую нужно внести на счёт твоего телефона", "Внести", "Назад");
					}
					case 1:
					{
						ShowPlayerDialog(playerid, D_ATM_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Банковский счёт","{FFFFFF}Введи сумму, которую нужно снять со счёта", "Снять", "Назад");
					}
					case 2:
					{
						ShowPlayerDialog(playerid, D_ATM_PHONE_R, DIALOG_STYLE_INPUT, "{FFFFFF}Баланс сим-карты","{FFFFFF}Введи сумму, которую нужно снять со счёта твоего телефона", "Снять", "Назад");
					}
				}
			}
		}
		case D_ATM_BANK_R:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_ATM_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Банковский счёт","{FFFFFF}Введи сумму, которую нужно снять со счёта", "Снять", "Назад");
				new money = strval(inputtext)+(strval(inputtext)/10);
				if(money > PI[playerid][Bank] || money < 1) return ShowPlayerDialog(playerid, D_ATM_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Банковский счёт","{FF0000}Неверная сумма\n\n{FFFFFF}Введи сумму, которую нужно снять со счёта", "Снять", "Назад");
				PI[playerid][Bank] -= money;
				givePlayerMoney(playerid, strval(inputtext));
				ShowMenu(playerid, D_ATM);
				SendClientMessage(playerid, -1, "Ты снял деньги с банковского счёта");
			} else ShowMenu(playerid, D_ATM);
		}
		case D_ATM_PHONE_G:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_ATM_PHONE_G, DIALOG_STYLE_INPUT, "{FFFFFF}Пололнение баланса сим-карты","{FFFFFF}Введи сумму, которую нужно внести на счёт твоего телефона", "Внести", "Назад");
				if(strval(inputtext) > PI[playerid][Money] || strval(inputtext) < 1) return ShowPlayerDialog(playerid, D_ATM_PHONE_G, DIALOG_STYLE_INPUT, "{FF0000}Неверная сумма\n\n{FFFFFF}Пололнение баланса сим-карты","{FFFFFF}Введи сумму, которую нужно внести на счёт твоего телефона", "Внести", "Назад");
				removePlayerMoney(playerid, strval(inputtext));
				PI[playerid][PhoneBalance] += strval(inputtext);
				ShowMenu(playerid, D_ATM);
				SendClientMessage(playerid, -1, "Ты положил деньги на счёт телефона");
			} else ShowMenu(playerid, D_ATM);
		}
		case D_ATM_PHONE_R:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_ATM_PHONE_R, DIALOG_STYLE_INPUT, "{FFFFFF}Баланс сим-карты","{FFFFFF}Введи сумму, которую нужно снять со счёта твоего телефона", "Снять", "Назад");
				if(strval(inputtext) > PI[playerid][PhoneBalance] || strval(inputtext) < 1) return ShowPlayerDialog(playerid, D_ATM_PHONE_R, DIALOG_STYLE_INPUT, "{FFFFFF}Баланс сим-карты","{FF0000}Неверная сумма\n\n{FFFFFF}Введи сумму, которую нужно снять со счёта твоего телефона", "Снять", "Назад");
				givePlayerMoney(playerid, strval(inputtext));
				PI[playerid][PhoneBalance] -= strval(inputtext);
				ShowMenu(playerid, D_ATM);
				SendClientMessage(playerid, -1, "Ты снял деньги со счёта телефона");
			} else ShowMenu(playerid, D_ATM);
		}
		case D_247:
		{
			TogglePlayerDynamicCP(playerid, CP247[0], true);
			if(response)
			{
				switch(listitem)
				{
					case 0:
					{
						if(PI[playerid][PhoneNumber] != 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя уже есть телефон");
						else if(PI[playerid][Money] < 400) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает денег");
						new m = random(899999)+100000;
						while(IsNumberFree(m))
						{
							m = random(899999)+100000;
						}
						format(glstr, sizeof(glstr), "Ты купил телефон, в нём уже есть сим-карта с номером %d, но ты можешь купить другую сим-карту", m);
						SendClientMessage(playerid, -1, glstr);
						PI[playerid][PhoneNumber] = m;
						PI[playerid][PhoneBalance] = 100;
						removePlayerMoney(playerid, 400);
						format(glstr, sizeof(glstr), "Телефон/%s [%d].ini", Name(playerid), PI[playerid][ID]);
						new iniFile = ini_createFile(glstr);
						if(iniFile < 0)
						iniFile = ini_openFile(glstr);
						for(new i;i<20;i++)
						{
							PhoneC[playerid][i] = 0;
							format(PhoneN[playerid][i], 32, "пусто");
							format(glstr,sizeof(glstr),"C%d", i+1);
							ini_setInteger(iniFile, glstr, PhoneC[playerid][0]);
							format(glstr,sizeof(glstr),"CN%d", i+1);
							ini_setString(iniFile, glstr, PhoneN[playerid][0]);
						}
						ini_closeFile(iniFile);
					}
					case 1:
					{
						if(PI[playerid][PhoneNumber] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет телефона");
						else if(PI[playerid][Money] < 50) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает денег");
						new m = random(899999)+100000;
						while(IsNumberFree(m))
						{
							m = random(899999)+100000;
						}
						format(glstr, sizeof(glstr), "Ты купил новую сим-карту, номер - %d", m);
						SendClientMessage(playerid, -1, glstr);
						PI[playerid][PhoneNumber] = m;
						removePlayerMoney(playerid, 50);
					}
					case 2:
					{
						if(PI[playerid][PhoneNumber] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет телефона");
						else if(PI[playerid][Money] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает денег");
						SetPVarInt(playerid, "MenuBoxMode", 2);
						for(new i=1;i<=10;i++)
						{
							MenuButtonModel[playerid][i] = 18864+i;
						}
						ShowBoxMenu(playerid, 10);
					}
				}
			}
		}
		case D_HEAL:
		{
			if(response)
			{
				switch(listitem)
				{
					case 0:
					{
						if(PI[playerid][HealPacks] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя уже есть аптечка");
						else if(PI[playerid][Money] < 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Не хватает денег");
						PI[playerid][HealPacks]++;
						removePlayerMoney(playerid, 100);
						SendClientMessage(playerid, -1, "Ты купил аптечку");
					}
				}
			}
		}
		case D_FACTION:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case F_members:
					{
						new body[1024], n;
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i)) continue;
							if(PI[i][Faction] == PI[playerid][Faction])
							{
								n++;
								format(glstr, sizeof(glstr), "{FFFFFF}%s %s", GetRank(i), Name(i));
								strcat(body, glstr);
								if(PI[i][PhoneNumber] != 0)
								{
									format(glstr, sizeof(glstr), " (тел. %d)", PI[i][PhoneNumber]);
									strcat(body, glstr);
								}
								strcat(body, "\n");
							}
						}
						if(n > 0)
						{
							ShowPlayerDialog(playerid, D_FACTION_LIST, DIALOG_STYLE_MSGBOX, "{FFFFFF}Cотрудники онлайн", body, "Выход", "Назад");
						} else {
							ShowPlayerDialog(playerid, D_FACTION_LIST, DIALOG_STYLE_MSGBOX, "{FFFFFF}Cотрудники онлайн", "Сотрудников онлайн нет", "Выход", "Назад");
						}
					}
					case F_info:
					{
						if(response)
						{
							new body[1000];
							strcat(body, "{FFFFFF}");
							switch(PI[playerid][Faction])
							{
								case 1,2,3:{
									strcat(body, "Ты - врач\n\
									Каждый следующий ранг включает в себя возможности предыдущего\n\
									\nРанги в Больнице:\n\
									Главный врач - повышает ранг до заведующего отделением | Зарплата - 4.500$\n\
									Заведующий отделением - повышает ранг до старшего специалиста | Зарплата - 3.750$\n\
									Старший специалист - приглашает во фракцию, умеет выгонять, повышение, понижение до ранга | Зарплата - 3.250$\n\
									Младший специалист - смена внешнего вида сотрудников | Зарплата - 2.900$\n");
									strcat(body, "Хирург - управление вертолётом | Зарплата - 2.750$\n\
									Врач терапевт - лечение в больнице | Зарплата - 2.400$\n\
									Врач участковый - вкалывает витамины, обезболивающее | Зарплата - 2.000$\n\
									Старший мед. работник - управление транспортом | Зарплата - 1.700$\n\
									Младший мед. работник - лечение в машине | Зарплата - 1.400$\n\
									Интерн - самый низкий ранг, цель его - обучаться | Зарплата - 1.000$");
								}
								case 4,5,6:{
									strcat(body, "Ты - полицейский\n\
									Каждый следующий ранг включает в себя возможности предыдущего\n\
									\nРанги в Полиции:\n\
									Генерал - повышает ранг до полковника | Зарплата - 4.300$\n\
									Полковник - повышает ранг до подполковника | Зарплата - 3.900$\n\
									Подполковник - приглашает во фракцию, умеет выгонять, повышение, понижение до ранга | Зарплата - 3.600$\n\
									Майор - смена внешнего вида сотрудников | Зарплата - 3.200$\n\
									Капитан - управление вертолётом | Зарплата - 2.700$");
									strcat(body, "\nСт. Лейтенант - посадить/выкинуть из транспорта, посадить в тюрьму, управление транспортом FBI Truck | Зарплата - 2.500$\n\
									Лейтенант - одеть/снять наручники, установка дорожного блока, управление транспортом HPV1000 | Зарплата - 2.200$\n\
									Ст. Сержант - объявление/снятие розыска, управление транспортом Enforcer, оружие MP5 | Зарплата - 1.800$\n\
									Сержант - умеет проводить задержание, управление полицейской машиной, оружие Пустынный орёл | Зарплата - 1.300$\n");
									strcat(body, "Рядовой - самый низкий ранг, цель его - обучаться, оружие Дубинка | Зарплата - 900$");
								}
								case 7,8,9:{
									strcat(body, "Ты - репортер\n\
									Каждый следующий ранг включает в себя возможности предыдущего\n\
									\nРанги в СМИ:\n\
									Директор - повышает ранг до заместителя директора | Зарплата - 4.400$\n\
									Зам. Директора - повышает ранг до редактора | Зарплата - 3.850$\n\
									Редактор - приглашает во фракцию, умеет выгонять, повышение, понижение до ранга | Зарплата - 3.450$\n\
									Помощник редактора - смена внешнего вида сотрудников | Зарплата - 2.800$");
									strcat(body, "\nКорректор - управление вертолётом | Зарплата - 2.650$\n\
									Старший журналист - интервью | Зарплата - 2.500$\n\
									Журналист - репортаж | Зарплата - 2.200$\n\
									Радиотехник - управление транспортом | Зарплата - 1.700$\n\
									Верстальщик новостей - проверка объявлений | Зарплата - 1.300$\n\
									Помощник редакции - самый низкий ранг, цель его - обучаться | Зарплата - 1.000$");
								}
								case 10:{
									strcat(body,"Ты - военный\n\
									Каждый следующий ранг включает в себя возможности предыдущего\n\
									\nРанги в Сухопутных войсках:\n\
									Генерал - повышает ранг до ранга Полковник | Зарплата - 4.300$\n\
									Полковник - повышает ранг до ранга Подполковник | Зарплата - 3.800$\n\
									Подполковник - приглашает во фракцию, умеет выгонять, повышать, понижать до ранга | Зарплата - 3.300$\n\
									Майор - смена внешнего вида сотрудников | Зарплата - 2.800$\n\
									Капитан - управление вертолетом | Зарплата - 2.500$\n");
									strcat(body, "\
									Лейтенант - управление танком | Зарплата - 2.200$\n\
									Старшина - держать в руках оружие M4 | Зарплата - 1.600$\n\
									Ст. Сержант - управление транспортом Patriot и держать в руках оружие АК-47 | Зарплата - 1.400$\n\
									Сержант - держать в руках оружие Пустынный орёл | Зарплата - 1.200$\n\
									Рядовой - самый низкий ранг, умеет открывать/закрывать ворота | Зарплата - 900$");
								}
								case 11:{
									strcat(body,"Ты - военный\n\
									Каждый следующий ранг включает в себя возможности предыдущего\n\
									\nРанги в ВМФ:\n\
									Адмирал - повышает ранг до ранга - Капитан 1 ранга, управление транспортом | Зарплата - 4.300$\n\
									Капитан 1 ранга - повышает ранг до ранга - Капитан 2 ранга | Зарплата - 3.800$\n\
                                    Капитан 2 ранга - приглашение во фракцию, умеет выгонять, повышение, понижение ранга | Зарплата - 3.300$\n");
									strcat(body, "\
                                    Капитан 3 ранга - смена внешнего вида сотрудников | Зарплата - 2.800$\n\
                                    Лейтенант - управление вертолётом | Зарплата - 2.500$\n\
                                    Мичман - управление транспортом Admiral | Зарплата - 2.200$\n\
                                    Старшина 2ст - управление транспортом Mesa и держать в руках оружие M4 | Зарплата - 1.600$\n\
                                    Старшина 1ст - управление транспортом Patriot и держать в руках оружие AK-47 | Зарплата - 1.400$\n");
									strcat(body, "\
                                    Ст.Матрос - держать в руках оружие Пустынный орёл | Зарплата - 1.200$\n\
                                    Матрос - самый низкий ранг, умеет открывать/закрывать ворота | Зарплата - 900$");
								}
								case 12:{
									strcat(body,"Ты - военный\n\
									Каждый следующий ранг включает в себя возможности предыдущего\n\
									\nРанги в ВВС:\n\
									Генерал - повышает ранг до ранга Полковник | Зарплата - 4.300$\n\
									Полковник - повышает ранг до ранга Подполковник,управление транспортом Нunter | Зарплата - 3.800$\n\
									Подполковник - Приглашает во фракцию| Зарплата - 3.300$\n\
									Майор - смена внешнего вида сотрудников | Зарплата - 2.800$\n\
									Капитан - Управление транспортом Maverick | Зарплата - 2.500$\n");
									strcat(body, "\
									Лейтенант - Управление транспортом Sparrow | Зарплата - 2.200$\n\
									Старшина - Управление транспортом Shamal | Зарплата - 1.600$\n\
									Ст. Сержант - Управление транспортом Mesa | Зарплата - 1.400$\n\
									Сержант - Управление транспортом Patriot | Зарплата - 1.200$\n\
									Рядовой - Самый низкий ранг, умеет открывать/закрывать ворота | Зарплата - 900$");
								}
							}
							ShowPlayerDialog(playerid, D_FACTION_LIST, DIALOG_STYLE_MSGBOX, "{FFFFFF}Описание фракции", body, "Выход", "Назад");
						} else OnPlayerCommandText(playerid, "/mn");
					}
					case F_leave:
					{
						if(PI[playerid][Rank] == 10 && PI[playerid][Admin] < 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты лидер и не можешь покинуть свою фракцию");
						PI[playerid][Faction] = 0;
						PI[playerid][Rank] = 0;
						SetPlayerFactionColor(playerid);
						SetPlayerFactionSkin(playerid);
					}
					case F_adv:
					{
						switch(PI[playerid][Faction])
						{
							case 7,8,9:
							{
								new body[512], n;
								for(new i;i<PLAYERS;i++)
								{
									if(!InGame(i) || !strlen(PI[i][Adv])) continue;
									nAdv[n] = i;
									n++;
									format(glstr,sizeof(glstr), "%d. %s | %s\n", i, Name(i), PI[i][Adv]);
									strcat(body, glstr);
								}
								if(n == 0) ShowPlayerDialog(playerid, D_FACTION_1, DIALOG_STYLE_MSGBOX, "{FFFFFF}Объявления на проверку", "{FFFFFF}Объявлений на проверку нет", "Выход", "Назад");
								else ShowPlayerDialog(playerid, D_FACTION_1, DIALOG_STYLE_LIST, "{FFFFFF}Объявления на проверку", body, "Выбрать", "Назад");
							}
						}
					}
					case F_reportage: 
					{
						if(!IsCNNcar(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен быть в транспорте СМИ");
						SetPVarInt(playerid, "InReportage", 1);
						SetPVarInt(playerid, "NowRadio", PI[playerid][Faction]-6);
						SendClientMessage(playerid, 0x00FF00FF, "Ты начал репортаж");
					}
					case F_gnews: ShowPlayerDialog(playerid, D_GNEWS, DIALOG_STYLE_INPUT, "{FFFFFF}Гос. новости", "Введи текст новости, чтобы отправить", "Отправить", "Назад");
					case F_crim:
					{
						new body[512];
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i) || PI[i][Wanted] == 0) continue;
							format(glstr,sizeof(glstr), "%s, уровень розыска: %d\n", Name(i), PI[i][Wanted]);
							strcat(body, glstr);
						}
						ShowPlayerDialog(playerid, D_FACTION_LIST, DIALOG_STYLE_MSGBOX, "{FFFFFF}Игроки в розыске", glstr, "Выход", "Назад");
					}
				}
			} else OnPlayerCommandText(playerid, "/mn");
		}
		case D_GNEWS:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_GNEWS, DIALOG_STYLE_INPUT, "{FFFFFF}Гос. новости", "Введи текст новости, чтобы отправить", "Отправить", "Назад");
				format(glstr,sizeof(glstr), "/гос %s", inputtext);
				OnPlayerCommandText(playerid, glstr);
				ShowMenu(playerid, D_FACTION);
			} else ShowMenu(playerid, D_FACTION);
		}
		case D_FACTION_1:
		{
			if(response)
			{
				format(glstr,sizeof(glstr),"{FFFFFF}Объявление от {FFFF00}%s{FFFFFF}: {00FF30}%s", Name(nAdv[listitem]), PI[nAdv[listitem]][Adv]);
				ShowPlayerDialog(playerid, D_FACTION_11, DIALOG_STYLE_INPUT, "{FFFFFF}Объявления на проверку", glstr, "Отправить", "Отклонить");
				SetPVarInt(playerid, "AdvPlayer", nAdv[listitem]);
			} else ShowMenu(playerid, D_FACTION);
		}
		case D_FACTION_11:
		{
			if(response)
			{
				format(glstr,sizeof(glstr),"/обпр %d 1 %s", GetPVarInt(playerid, "AdvPlayer"), inputtext);
			} else {
				format(glstr,sizeof(glstr),"/обпр %d 0 %s", GetPVarInt(playerid, "AdvPlayer"), inputtext);
			}
			OnPlayerCommandText(playerid, glstr);
			ShowMenu(playerid, D_FACTION);
		}
		case D_FACTION_LIST:
		{
			if(!response) ShowMenu(playerid, D_FACTION);
		}
		case D_RESTART:
		{
			if(response)
			{
				OnPlayerCommandText(playerid, "/рестарт 1");
			} else {
				OnPlayerCommandText(playerid, "/рестарт");
			}
		}
		case D_PHONE:
		{
			if(response)
			{
				SetPVarInt(playerid, "InCall", GetPVarInt(playerid, "Caller"));
				SetPVarInt(playerid, "Calling", 2);
				SetPVarInt(GetPVarInt(playerid, "Caller"), "Calling", 2);
				SendClientMessage(GetPVarInt(playerid, "Caller"), -1, "На твой вызов ответили");
				SetPlayerSpecialAction(playerid, SPECIAL_ACTION_USECELLPHONE);
				SetPlayerAttachedObject(playerid, 1, PI[playerid][PhoneObject], 6, 0.086043, 0.027719, 0.003817, 95.232246, 178.651031, 1.691840, 1.002077, 1.000000, 1.000000);
			} else {
				SetPVarInt(GetPVarInt(playerid, "Caller"), "InCall", PLAYERS+1);
				SetPVarInt(GetPVarInt(playerid, "Caller"), "Calling", 0);
				SetPVarInt(playerid, "Calling", 0);
				SendClientMessage(GetPVarInt(playerid, "Caller"), -1, "Твой вызов сбросили");
				SetPlayerSpecialAction(GetPVarInt(playerid, "Caller"), SPECIAL_ACTION_STOPUSECELLPHONE);
				RemovePlayerAttachedObject(GetPVarInt(playerid, "Caller"), 1);
				SetPVarInt(playerid, "Caller", 0);
			}
		}

		case P_MENU:
		{
		    if(response)
		    {
				new plid = GetPVarInt(playerid, "ClickedPlayer");
				switch(DLItemID)
				{
			        case PMN_passport:
					{
					    if(!PlayerInRadius(playerid, plid, 2.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
					    ShowPassport(playerid, plid);
					}
			        case PMN_money:
			        {
						format(glstr, sizeof(glstr), "{FFFFFF}Передача денег игроку %s [%d]", Name(plid), plid);
		            	ShowPlayerDialog(playerid, P_MENU_MONEY, DIALOG_STYLE_INPUT, glstr, "{FFFFFF}Введи сумму, которую хочешь передать этому игроку", "Передать", "Назад");
			        }
			        case PMN_statsex:
			        {
						format(glstr,sizeof(glstr), "/допстат %d", plid);
						OnPlayerCommandText(playerid, glstr);
					}
					case PMN_report:
					{
						format(glstr,sizeof(glstr), "{FFFFFF}Жалоба на %s [%d]", Name(plid), plid);
						ShowPlayerDialog(playerid, P_MENU_REPORT, DIALOG_STYLE_INPUT, glstr, "{FFFFFF}Опиши ситуацию в поле ниже, пиши грамотно и понятно, иначе жалобу не рассмотрят", "Отправить", "Назад");
					}
					case PMN_spec: specPlayer(playerid, plid);
					case PMN_stats: ShowStats(plid, playerid, 5);
					case PMN_eject: RemovePlayerFromVehicle(plid);
					case PMN_frac:
					{
						ShowMenu(playerid, P_MENU_FACTION);
					}
					case DON_pay:
					{
						if(!IsValidKey(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет секретного слова");
						SetPVarInt(playerid, "D_OPT_ID", 3);
						ShowPlayerDialog(playerid, D_CKEY, DIALOG_STYLE_INPUT, "{FFFFFF}Проверка", "{FFFFFF}Введи своё секретное слово, чтобы продолжить:", "ОК", "Назад");
					}
					case PMN_admin: ShowMenu(playerid, P_MENU_ADMIN);
				}
		    }
		}
		case D_DONATE_PAY:
		{
			if(emptyMessage(inputtext))
			{
				format(glstr,sizeof(glstr), "{FFFFFF}Передача доната игроку %s\nВведи сумму, которую хочешь передать:", Name(GetPVarInt(playerid, "ClickedPlayer")));
				return ShowPlayerDialog(playerid, D_DONATE_PAY, DIALOG_STYLE_INPUT, "{FFFFFF}Передача доната", glstr, "Передать", "Назад");
			}
			DonatePay[playerid] = floatstr(inputtext);
			if(DonatePay[playerid] < 0 || DonatePay[playerid] > PI[playerid][Donate])
			{
				format(glstr,sizeof(glstr), "{FF0000}Неверная сумма\n\n{FFFFFF}Передача доната игроку %s\nВведи сумму, которую хочешь передать:", Name(GetPVarInt(playerid, "ClickedPlayer")));
				return ShowPlayerDialog(playerid, D_DONATE_PAY, DIALOG_STYLE_INPUT, "{FFFFFF}Передача доната", glstr, "Передать", "Назад");
			}
			format(glstr,sizeof(glstr), "{FFFFFF}Передача %.2f р. игроку %s\n{FF0000}Нажимая ОК, ты соглашаешься с условием, что после передачи деньги тебе никто не вернёт", DonatePay[playerid], Name(GetPVarInt(playerid, "ClickedPlayer")));
			return ShowPlayerDialog(playerid, D_DONATE_PAY_YESNO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Подтверждение передачи доната", glstr, "ОК", "Назад");
		}
		case D_DONATE_PAY_YESNO:
		{
			if(response)
			{
				givePlayerDonate(playerid, -DonatePay[playerid]);
				givePlayerDonate(GetPVarInt(playerid, "ClickedPlayer"), DonatePay[playerid]);
				format(glstr,sizeof(glstr), "Ты передал игроку %s %.2f р. доната", Name(GetPVarInt(playerid, "ClickedPlayer")), DonatePay[playerid]);
				SendClientMessage(playerid, 0x00FF00FF, glstr);
				format(glstr,sizeof(glstr), "%s передал тебе %.2f р. доната", Name(playerid), DonatePay[playerid]);
				SendClientMessage(GetPVarInt(playerid, "ClickedPlayer"), 0x00FF00FF, glstr);
				DonatePay[playerid] = 0.0;
			} else {
				format(glstr,sizeof(glstr), "{FFFFFF}Передача доната игроку %s\nВведи сумму, которую хочешь передать:", Name(GetPVarInt(playerid, "ClickedPlayer")));
				return ShowPlayerDialog(playerid, D_DONATE_PAY, DIALOG_STYLE_INPUT, "{FFFFFF}Передача доната", glstr, "Передать", "Назад");
			}
		}
		case P_MENU_ADMIN:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case P_MENU_ADM_pen: 
					{
						if(PI[playerid][Admin] >= 10)
						{
							if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][MuteReport] > 0)
							{
								AddDListItem(playerid, "Открыть доступ к репорту", P_MENU_ADM_pen_report);
							} else {
								AddDListItem(playerid, "Закрыть доступ к репорту", P_MENU_ADM_pen_report);
							}
						}
						if(PI[playerid][Admin] >= 100)
						{
							if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][MuteTime] > 0)
							{
								AddDListItem(playerid, "Открыть доступ к чату", P_MENU_ADM_pen_mute);
							} else {
								AddDListItem(playerid, "Закрыть доступ к чату", P_MENU_ADM_pen_mute);
							}
							if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][MuteCMD] > 0)
							{
								AddDListItem(playerid, "Открыть доступ к командам", P_MENU_ADM_pen_mutecmd);
							} else {
								AddDListItem(playerid, "Закрыть доступ к командам", P_MENU_ADM_pen_mutecmd);
							}
							if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][JailTime] > 0)
							{
								AddDListItem(playerid, "Выпустить из тюрьмы", P_MENU_ADM_pen_jail);
							} else {
								AddDListItem(playerid, "Посадить в тюрьму", P_MENU_ADM_pen_jail);
							}
							if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][Cheater] > 0)
							{
								AddDListItem(playerid, "Выпустить из читерского мира", P_MENU_ADM_pen_cheaters);
							} else {
								AddDListItem(playerid, "Посадить в читерский мир", P_MENU_ADM_pen_cheaters);
							}
						}
						if(PI[playerid][Admin] >= 1000)
						{
							AddDListItem(playerid, "Кикнуть", P_MENU_ADM_pen_kick);
							AddDListItem(playerid, "Забанить", P_MENU_ADM_pen_ban);
							AddDListItem(playerid, "Забанить подсеть", P_MENU_ADM_pen_pban);
						}
						ShowPlayerDList(playerid, P_MENU_ADMIN_PEN, "{FFFFFF}Админка - Наказания", "Выбрать", "Назад");
					}
					case P_MENU_ADM_acc:
					{
						if(PI[playerid][Admin] >= 700)
						{
							AddDListItem(playerid, "Изменить ник", P_MENU_ADM_acc_nick);
						}
						if(PI[playerid][Admin] >= 1000)
						{
							AddDListItem(playerid, "Выдать админку", P_MENU_ADM_acc_alvl);
							AddDListItem(playerid, "Повысить уровень", P_MENU_ADM_acc_lvladd);
							AddDListItem(playerid, "Изменить уровень", P_MENU_ADM_acc_lvlset);
						}
						if(PI[playerid][Admin] >= 1500)
						{
							AddDListItem(playerid, "Обнулить количество заглушек", P_MENU_ADM_acc_mutecount);
							AddDListItem(playerid, "Обнулить количество попаданий в читерский мир", P_MENU_ADM_acc_cheatercount);
						}
						ShowPlayerDList(playerid, P_MENU_ADMIN_ACC, "{FFFFFF}Админка - Аккаунт", "Выбрать", "Назад");
					}
					case P_MENU_ADM_pl:
					{
						if(PI[playerid][Admin] >= 700)
						{
							AddDListItem(playerid, "Изменить пол", P_MENU_ADM_pl_sex);
							AddDListItem(playerid, "Телепорт игрока", P_MENU_ADM_tp);
							AddDListItem(playerid, "Телепорт к игроку", P_MENU_ADM_tpto);
						}
						if(PI[playerid][Admin] >= 800)
						{
							AddDListItem(playerid, "Изменить ранг во фракции", P_MENU_ADM_pl_rank);
							AddDListItem(playerid, "Изменить скилл оружия", P_MENU_ADM_skill);
							AddDListItem(playerid, "Лидерство фракции", P_MENU_ADM_faction);
						}
						if(PI[playerid][Admin] >= 1000)
						{
							AddDListItem(playerid, "Изменить количество денег у игрока", P_MENU_ADM_pl_moneyset);
							AddDListItem(playerid, "Дать игроку деньги", P_MENU_ADM_pl_moneyadd);
							AddDListItem(playerid, "Выставить игроку виртуальный мир", P_MENU_ADM_pl_vw);
							AddDListItem(playerid, "Выставить игроку интерьер", P_MENU_ADM_pl_interior);
							AddDListItem(playerid, "Выставить игроку здоровье", P_MENU_ADM_pl_hp);
							AddDListItem(playerid, "Выставить игроку броню", P_MENU_ADM_pl_ar);
							if(GetPVarInt(GetPVarInt(playerid, "ClickedPlayer"), "OffKeys") == 0)
							{
								AddDListItem(playerid, "Отключить игроку управление", P_MENU_ADM_pl_offkeys);
							} else {
								AddDListItem(playerid, "Включить игроку управление", P_MENU_ADM_pl_offkeys);
							}
							if(PI[GetPVarInt(playerid, "ClickedPlayer")][Passport] == 1)
							{
								AddDListItem(playerid, "Забрать паспорт у игрока", P_MENU_ADM_pl_passport);
							} else {
								AddDListItem(playerid, "Выдать паспорт игроку", P_MENU_ADM_pl_passport);
							}
							if(PI[GetPVarInt(playerid, "ClickedPlayer")][DriveLicence] == 1)
							{
								AddDListItem(playerid, "Забрать у игрока водительское удостоверение", P_MENU_ADM_pl_drvlic);
							} else {
								AddDListItem(playerid, "Выдать игроку водительское удостоверение", P_MENU_ADM_pl_drvlic);
							}
						}
						ShowPlayerDList(playerid, P_MENU_ADMIN_PL, "{FFFFFF}Админка - Игрок", "Выбрать", "Назад");
					}
				}
			} else ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"), playerid);
		}
		case P_MENU_ADMIN_PEN:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case P_MENU_ADM_pen_report:
					{
						if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][MuteReport] == 0)
						{
							ShowPlayerDialog(playerid, P_MENU_ADM_pen_report_input, DIALOG_STYLE_INPUT, "Репорт", "{FFFFFF}Введи время и причину наказания:\nПример: 300 мат", "ОК", "Назад");
						} else {
							format(glstr, sizeof(glstr), "/зр %d 0", GetPVarInt(playerid, "ClickedPlayer"));
							OnPlayerCommandText(playerid, glstr);
						}
					}
					case P_MENU_ADM_pen_mute:
					{
						if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][MuteTime] == 0)
						{
							if(PI[playerid][Admin] >= 500)
							{
								format(glstr, sizeof(glstr), "{FFFFFF}Введи время и причину наказания:\nПример: 300 мат");
							} else {
								format(glstr, sizeof(glstr), "{FFFFFF}Введи причину наказания:");
							}
							ShowPlayerDialog(playerid, P_MENU_ADM_pen_mute_input, DIALOG_STYLE_INPUT, "Чат", glstr, "ОК", "Назад");
						} else {
							format(glstr, sizeof(glstr), "/з %d 0", GetPVarInt(playerid, "ClickedPlayer"));
							OnPlayerCommandText(playerid, glstr);
						}
					}
					case P_MENU_ADM_pen_mutecmd:
					{
						if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][MuteCMD] == 0)
						{
							ShowPlayerDialog(playerid, P_MENU_ADM_pen_mutecmd_input, DIALOG_STYLE_INPUT, "Команды", "{FFFFFF}Введи время и причину наказания:\nПример: 300 мат", "ОК", "Назад");
						} else {
							format(glstr, sizeof(glstr), "/зк %d 0", GetPVarInt(playerid, "ClickedPlayer"));
							OnPlayerCommandText(playerid, glstr);
						}
					}
					case P_MENU_ADM_pen_jail:
					{
						if(PIpen[GetPVarInt(playerid, "ClickedPlayer")][JailTime] == 0)
						{
							ShowPlayerDialog(playerid, P_MENU_ADM_pen_jail_input, DIALOG_STYLE_INPUT, "Тюрьма", "{FFFFFF}Введи время и причину наказания:\nПример: 300 мат", "ОК", "Назад");
						} else {
							format(glstr, sizeof(glstr), "/т %d 0", GetPVarInt(playerid, "ClickedPlayer"));
							OnPlayerCommandText(playerid, glstr);
						}
					}
					case P_MENU_ADM_pen_cheaters:
					{
						format(glstr, sizeof(glstr), "/чм %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}
					case P_MENU_ADM_pen_kick:
					{
						format(glstr, sizeof(glstr), "/кик %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}
					case P_MENU_ADM_pen_ban:
					{
						format(glstr, sizeof(glstr), "/бан %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}
					case P_MENU_ADM_pen_pban:
					{
						format(glstr, sizeof(glstr), "/пбан %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}
				}
			} else ShowMenu(playerid, P_MENU_ADMIN);
		}
		case P_MENU_ADM_pen_report_input:
		{
			if(response)
			{
				new time, reason, tmp;
				sscanf(inputtext, "dds[32]", tmp, time, reason);
				format(glstr, sizeof(glstr), "/зр %d %d %s", GetPVarInt(playerid, "ClickedPlayer"), time, reason);
				OnPlayerCommandText(playerid, glstr);
			}
		}
		case P_MENU_ADM_pen_jail_input:
		{
			if(response)
			{
				new time, reason, tmp;
				sscanf(inputtext, "dds[32]", tmp, time, reason);
				format(glstr, sizeof(glstr), "/т %d %d %s", GetPVarInt(playerid, "ClickedPlayer"), time, reason);
				OnPlayerCommandText(playerid, glstr);
			}
		}
		case P_MENU_ADM_pen_mutecmd_input:
		{
			if(response)
			{
				new time, reason, tmp;
				sscanf(inputtext, "dds[32]", tmp, time, reason);
				format(glstr, sizeof(glstr), "/зк %d %d %s", GetPVarInt(playerid, "ClickedPlayer"), time, reason);
				OnPlayerCommandText(playerid, glstr);
			}
		}
		case P_MENU_ADM_pen_mute_input:
		{
			if(response)
			{
				new time, reason, tmp;
				sscanf(inputtext, "dds[32]", tmp, time, reason);
				if(PI[playerid][Admin] < 500) 
				{
					format(glstr, sizeof(glstr), "/з %d %s", GetPVarInt(playerid, "ClickedPlayer"), inputtext);
				} else {
					format(glstr, sizeof(glstr), "/з %d %d %s", GetPVarInt(playerid, "ClickedPlayer"), time, reason);
				}
				OnPlayerCommandText(playerid, glstr);
			}
		}
		case P_MENU_ADMIN_ACC:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case P_MENU_ADM_acc_nick:
					{
						ShowPlayerDialog(playerid, P_MENU_ADM_acc_nick_input, DIALOG_STYLE_INPUT, "Ник", "{FFFFFF}Введи новый ник игрока", "ОК", "Назад");
					}	
					case P_MENU_ADM_acc_alvl:
					{
						ShowPlayerDialog(playerid, P_MENU_ADM_acc_alvl_input, DIALOG_STYLE_INPUT, "Уровень админки", "{FFFFFF}Введи новый уровень админки игрока", "ОК", "Назад");
					}	
					case P_MENU_ADM_acc_lvladd:
					{
						ShowPlayerDialog(playerid, P_MENU_ADM_acc_lvladd_input, DIALOG_STYLE_INPUT, "Добавить уровень", "{FFFFFF}Введи количество добавляемых уровней", "ОК", "Назад");
					}	
					case P_MENU_ADM_acc_lvlset:
					{
						ShowPlayerDialog(playerid, P_MENU_ADM_acc_lvlset_input, DIALOG_STYLE_INPUT, "Изменить уровень", "{FFFFFF}Введи новый уровень игрока", "ОК", "Назад");
					}
					case P_MENU_ADM_acc_mutecount:
					{
						format(glstr, sizeof(glstr), "/обнз %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}
					case P_MENU_ADM_acc_cheatercount:
					{
						format(glstr, sizeof(glstr), "/обнч %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}					
				}
			} else ShowMenu(playerid, P_MENU_ADMIN);
		}
		case P_MENU_ADM_acc_nick_input:
		{
			if(response)
			{
				format(glstr, sizeof(glstr), "/ник %d %s", GetPVarInt(playerid, "ClickedPlayer"), inputtext);
				OnPlayerCommandText(playerid, glstr);
			} else ShowMenu(playerid, P_MENU_ADMIN_ACC);
		}
		case P_MENU_ADM_acc_lvladd_input:
		{
			if(response)
			{
				new tmp, lvl, sd;
				sscanf(inputtext, "dddd", tmp, lvl, sd);
				format(glstr, sizeof(glstr), "/уровень %d %d %d", GetPVarInt(playerid, "ClickedPlayer"), lvl, sd);
				OnPlayerCommandText(playerid, glstr);
			} else ShowMenu(playerid, P_MENU_ADMIN_ACC);
		}
		case P_MENU_ADM_acc_lvlset_input:
		{
			if(response)
			{
				new tmp, lvl, sd;
				sscanf(inputtext, "dddd", tmp, lvl, sd);
				format(glstr, sizeof(glstr), "/уровень %d %d %d", GetPVarInt(playerid, "ClickedPlayer"), lvl, sd);
				OnPlayerCommandText(playerid, glstr);
			} else ShowMenu(playerid, P_MENU_ADMIN_ACC);
		}
		case P_MENU_ADM_acc_alvl_input:
		{
			if(response)
			{
				new tmp, lvl;
				sscanf(inputtext, "dd", tmp, lvl);
				format(glstr, sizeof(glstr), "/урадм %d %d", GetPVarInt(playerid, "ClickedPlayer"), lvl);
				OnPlayerCommandText(playerid, glstr);
			} else ShowMenu(playerid, P_MENU_ADMIN_ACC);
		}
		case P_MENU_ADMIN_PL:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case P_MENU_ADM_pl_sex:
					{
						format(glstr, sizeof(glstr), "/пол %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}	
					case P_MENU_ADM_tp:
					{
						format(glstr, sizeof(glstr), "/тпи %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}	
					case P_MENU_ADM_tpto:
					{
						format(glstr, sizeof(glstr), "/тп %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}	
					case P_MENU_ADM_pl_rank:
					{
						
					}	
					case P_MENU_ADM_skill:
					{
						
					}	
					case P_MENU_ADM_faction:
					{
						new body[300];
						for(new i;i<sizeof(fName);i++)
						{
							format(glstr, sizeof(glstr), "%s\n", fName[i]);
							strcat(body, glstr);
						}
						ShowPlayerDialog(playerid, P_MENU_ADM_faction_select, DIALOG_STYLE_LIST, "{FFFFFF}Лидер фракции", body, "Выбрать", "Назад");
					}	
					case P_MENU_ADM_pl_moneyset:
					{
						
					}	
					case P_MENU_ADM_pl_moneyadd:
					{
						
					}	
					case P_MENU_ADM_pl_vw:
					{
						
					}	
					case P_MENU_ADM_pl_interior:
					{
						
					}	
					case P_MENU_ADM_pl_hp:
					{
						
					}	
					case P_MENU_ADM_pl_ar:
					{
						
					}	
					case P_MENU_ADM_pl_offkeys:
					{
						format(glstr, sizeof(glstr), "/упр %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}	
					case P_MENU_ADM_pl_passport:
					{
						format(glstr, sizeof(glstr), "/паспорт %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}	
					case P_MENU_ADM_pl_drvlic:
					{
						format(glstr, sizeof(glstr), "/водправа %d", GetPVarInt(playerid, "ClickedPlayer"));
						OnPlayerCommandText(playerid, glstr);
					}	
				}
			} else ShowMenu(playerid, P_MENU_ADMIN);
		}
		case P_MENU_ADM_faction_select:
		{
			format(glstr, sizeof(glstr), "/лдр %d %d", GetPVarInt(playerid, "ClickedPlayer"), listitem);
			OnPlayerCommandText(playerid, glstr);
		}
		case P_MENU_FACTION:
		{
			if(response)
			{
				new plid = GetPVarInt(playerid, "ClickedPlayer");
				switch(DLItemID)
				{
					case FPMN_heal1:
					{
						if(GetPVarInt(plid, "Healing") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок ещё не оплатил предыдущее лечение");
						if(!PlayerInRadius(playerid, plid, 6.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						if(!IsHPcar(playerid) && PI[playerid][Rank] < 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен находиться в машине скорой помощи");
						if(!IsHPcar(plid) && PI[playerid][Rank] < 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Твой пациент должен находиться в машине скорой помощи");
						if(!IsInHospital(playerid) && !IsHPcar(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен находиться в больнице или в машине скорой помощи");
						if(!IsInHospital(plid) && !IsHPcar(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Твой пациент должен находиться в больнице или в машине скорой помощи");
						SetPVarInt(playerid, "HealType", 1);
						ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
					}
					case FPMN_heal2:
					{
						if(GetPVarInt(plid, "Healing") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок ещё не оплатил предыдущее лечение");
						SetPVarInt(playerid, "HealType", 2);
						ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
					}
					case FPMN_heal3:
					{
						if(GetPVarInt(plid, "Healing") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок ещё не оплатил предыдущее лечение");
						SetPVarInt(playerid, "HealType", 3);
						ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
					}
					case FPMN_Sex:
					{
						if(GetPVarInt(plid, "Healing") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок ещё не оплатил предыдущее лечение");
						else if(!IsInHospital(playerid) || !IsInHospital(GetPVarInt(playerid, "ClickedPlayer"))) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты и твой пациент должны находиться в больнице");
						SetPVarInt(playerid, "HealType", 4);
						ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$15000 {FFFFFF}, а максимальная {00FF00}$30000", "Далее", "Назад");
					}
					case FPMN_Form:
					{
						if(!PlayerInRadius(playerid, plid, 4.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						else if(PI[plid][Rank] >= PI[playerid][Rank] || PI[playerid][Faction] != PI[plid][Faction]) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не можешь сменить форму этому игроку");
						SetPVarInt(playerid, "MenuBoxMode", 1);
						switch(PI[playerid][Faction])
						{
							case 1,2,3:
							{
								if(PI[plid][Sex] == 1)
								{
									MenuButtonModel[playerid][1] = 71;
									MenuButtonModel[playerid][2] = 274;
									MenuButtonModel[playerid][3] = 275;
									MenuButtonModel[playerid][4] = 276;
									MenuButtonModel[playerid][5] = 70;
									ShowBoxMenu(playerid, 5);
								} else {
									MenuButtonModel[playerid][1] = 40;
									MenuButtonModel[playerid][2] = 219;
									ShowBoxMenu(playerid, 2);
								}
							}
							case 4,5,6:
							{
								if(PI[plid][Sex] == 1)
								{
									MenuButtonModel[playerid][1] = 280;
									MenuButtonModel[playerid][2] = 281;
									MenuButtonModel[playerid][3] = 285;
									MenuButtonModel[playerid][4] = 282;
									ShowBoxMenu(playerid, 4);
								} else {
									MenuButtonModel[playerid][1] = 76;
									MenuButtonModel[playerid][2] = 69;
									ShowBoxMenu(playerid, 2);
								}
							}
							case 7,8,9:
							{
								if(PI[plid][Sex] == 1)
								{
									MenuButtonModel[playerid][1] = 170;
									MenuButtonModel[playerid][2] = 250;
									MenuButtonModel[playerid][3] = 188;
									MenuButtonModel[playerid][4] = 223;
									MenuButtonModel[playerid][5] = 217;
									ShowBoxMenu(playerid, 5);
								} else {
									MenuButtonModel[playerid][1] = 211;
									MenuButtonModel[playerid][2] = 91;
									MenuButtonModel[playerid][3] = 56;
									ShowBoxMenu(playerid, 3);
								}
							}
							case 10,11,12:
							{
								if(PI[plid][Sex] == 1)
								{
									MenuButtonModel[playerid][1] = 61;
									MenuButtonModel[playerid][2] = 73;
									MenuButtonModel[playerid][3] = 287;
									MenuButtonModel[playerid][4] = 179;
									MenuButtonModel[playerid][5] = 255;
									ShowBoxMenu(playerid, 5);
								} else {
									MenuButtonModel[playerid][1] = 191;
									ShowBoxMenu(playerid, 1);
								}
							}
						}
					}
					case FPMN_iView:
					{
						if(!IsCNNcar(playerid) || !IsCNNcar(plid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты и респондент должны быть в транспорте СМИ");
						format(glstr, sizeof(glstr), "%s хочет взять у тебя интервью, нажми N", Name(playerid));
						SendClientMessage(plid, -1, glstr);
						SetPVarInt(plid, "iViewing", 1);
						SetPVarInt(plid, "iViewer", playerid);
					}
					case FPMN_arest:
					{
						if(!PlayerInRadius(playerid, plid, 6.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						switch(PI[plid][Faction])
						{
							case 4,5,6: return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок полицейский");
						}
						format(glstr, sizeof(glstr), "%s проводит задержание %s", Name(playerid), Name(plid));
						Do(playerid, glstr);
						SetPlayerSpecialAction(plid, SPECIAL_ACTION_HANDSUP);
					}
					case FPMN_wanted2:
					{
						if(PI[plid][Wanted] > 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрока уже разыскивает весь штат");
						if(PI[plid][Wanted] == 0)
						{
							ShowPlayerDialog(playerid, P_MENU_FACTION_WANTED, DIALOG_STYLE_INPUT, "{FFFFFF}Причина розыска", "{FFFFFF}Введи причину повышения уровня розыска", "Повысить", "Назад");
						} else {
							format(glstr, sizeof(glstr), "%s повысил твой уровень розыска", Name(playerid), inputtext);
							SendClientMessage(plid, -1, glstr);
							setPlayerWantedLevel(plid, PI[plid][Wanted]+1);
							SendClientMessage(playerid, -1, "Ты повысил уровень розыска игроку");
						}
						if(PI[plid][Law] > 0) LawPlayer(plid, 1);
						SetPVarInt(plid, "Cop", playerid);
					}
					case FPMN_wanted1:
					{
						if(PI[plid][Wanted] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не в розыске");
						setPlayerWantedLevel(plid, PI[plid][Wanted]-1);
						format(glstr, sizeof(glstr), "%s понизил твой уровень розыска", Name(playerid));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты понизил уровень розыска %s", Name(plid));
						SendClientMessage(playerid, -1, glstr);
					}
					case FPMN_disDlic:
					{
						if(!PlayerInRadius(playerid, plid, 6.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						else if(PI[plid][DriveLicence] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "У игрока нет водительского удостоверения");
						PI[plid][DriveLicence] = 0;
						format(glstr, sizeof(glstr), "%s забрал водительское удостоверение у %s", Name(playerid), Name(plid));
						Do(playerid, glstr);
					}
					case FPMN_bHand2:
					{
						if(!PlayerInRadius(playerid, plid, 4.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						switch(PI[plid][Faction])
						{
							case 4,5,6: return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок полицейский");
						}
						format(glstr, sizeof(glstr), "%s снял наручники с %s", Name(playerid), Name(plid));
						SetPVarInt(plid, "HandBlock", 0);
						RemovePlayerAttachedObject(plid,0);
						SetPlayerSpecialAction(plid, SPECIAL_ACTION_NONE);
						ClearAnimations(playerid);
						ApplyAnimationEx(playerid,"SWAT","swt_sty",4.1,0,1,1,1,1);
						SetTimerEx("ClearAnims", 1500, false, "d", playerid);
						Do(playerid, glstr);
					}
					case FPMN_bHand1:
					{
						if(!PlayerInRadius(playerid, plid, 4.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						switch(PI[plid][Faction])
						{
							case 4,5,6: return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок полицейский");
						}
						format(glstr, sizeof(glstr), "%s надел наручники на %s", Name(playerid), Name(plid));
						SetPVarInt(plid, "HandBlock", 1);
						SetPlayerAttachedObject(plid, 0, 19418, 6, -0.011000, 0.028000, -0.022000, -15.600012, -33.699977, -81.700035, 1.1, 1.5, 2.1);
						ClearAnimations(plid);
						SetPlayerSpecialAction(plid, SPECIAL_ACTION_CUFFED);
						ClearAnimations(playerid);
						ApplyAnimationEx(playerid,"SWAT","swt_sty",4.1,0,1,1,1,1);
						SetTimerEx("ClearAnims", 1500, false, "d", playerid);
						Do(playerid, glstr);
					}
					case FPMN_inCar1:
					{
						if(!VehicleInPlayer(GetPlayerVehicleID(plid), playerid, 5.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Машина, в которой находится игрок, далеко от тебя");
						switch(PI[plid][Faction])
						{
							case 4,5,6: return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок полицейский");
						}
						format(glstr, sizeof(glstr), "%s выбросил %s из машины", Name(playerid), Name(plid));
						if(GetPVarInt(plid, "InPoliceCar") != 0) TogglePlayerControllable(plid, true), SetPVarInt(plid, "InPoliceCar", 0);
						RemovePlayerFromVehicle(plid);
						Do(playerid, glstr);
					}
					case FPMN_inCar2:
					{
						if(!PlayerInRadius(playerid, plid, 4.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						switch(PI[plid][Faction])
						{
							case 4,5,6: return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок полицейский");
						}
						new vid;
						for(new i;i<MAX_VEHICLES;i++)
						{
							if(!VehicleInPlayer(i, playerid, 5.0)) continue;
							switch(PI[playerid][Faction])
							{
								case 4:
								{
									for(new c;c<sizeof(LSPDcars);c++)
									{
										if(i != LSPDcars[c]) continue;
										vid = i;
										break;
									}
								}
								case 5:
								{
									for(new c;c<sizeof(SFPDcars);c++)
									{
										if(i != SFPDcars[c]) continue;
										vid = i;
										break;
									}
								}
								case 6:
								{
									for(new c;c<sizeof(LVPDcars);c++)
									{
										if(i != LVPDcars[c]) continue;
										vid = i;
										break;
									}
								}
							}
							break;
						}
						if(vid == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Поблизости нет подходящих машин");
						format(glstr, sizeof(glstr), "%s посадил %s в полицейскую машину", Name(playerid), Name(plid));
						SetPVarInt(plid, "InPoliceCar", vid);
						if(IsSeatTaken(vid, 3))
						{
							PutPlayerInVehicle(plid, vid, 2);
						}
						else if(IsSeatTaken(vid, 2))
						{
							PutPlayerInVehicle(plid, vid, 1);
						} else {
							PutPlayerInVehicle(plid, vid, 3);
						}
						TogglePlayerControllable(plid, false);
						Do(playerid, glstr);
					}
					case FPMN_jail:
					{
						switch(PI[plid][Faction])
						{
							case 4,5,6: return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок полицейский");
						}
						switch(PI[playerid][Faction])
						{
							case 4: if(!IsPlayerInRangeOfPoint(playerid, 10.0, LSPDEnter[1][0], LSPDEnter[1][1], LSPDEnter[1][2])) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен находиться возле полицейского участка");
							case 5: if(!IsPlayerInRangeOfPoint(playerid, 10.0, SFPDEnter[1][0], SFPDEnter[1][1], SFPDEnter[1][2])) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен находиться возле полицейского участка");
							case 6: if(!IsPlayerInRangeOfPoint(playerid, 10.0, LVPDEnter[1][0], LVPDEnter[1][1], LVPDEnter[1][2])) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты должен находиться возле полицейского участка");
						}
						if(!PlayerInRadius(playerid, plid, 6.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						else if(PI[plid][Wanted] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не в розыске");
						format(glstr, sizeof(glstr), "%s посадил %s в тюрьму", Name(playerid), Name(plid));
						PIpen[plid][JailTime] = 300*PI[plid][Wanted];
						if(PI[plid][Law] > 0) LawPlayer(plid, 1);
						setPlayerWantedLevel(plid, 0);
						spawnPlayer(plid);
						Do(playerid, glstr);
					}
					case FPMN_invite:
					{
						if(!PlayerInRadius(playerid, plid, 6.0)) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок далеко");
						else if(PI[plid][Level] < 3) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок низкого уровня");
						else if(PI[plid][Rank] == 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок лидер фракции");
						else if(PI[playerid][Rank] < 8 || PI[plid][Rank] >= PI[playerid][Rank]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя этого сделать");
						else if(GetPVarInt(plid, "Invited") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрока уже пригласили в другую фракцию");
						else if(PI[plid][Law] < 20) return SendClientMessage(playerid, COLOR_SYSTEM, "У игрока низкий уровень законопослушности");
						format(glstr, sizeof(glstr), "%s пригласил тебя присоединиться к фракции {00FF00}%s{FFFFFF}, нажми N", Name(playerid), fName[PI[playerid][Faction]]);
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты пригласил %s во фракцию", Name(plid));
						SendClientMessage(playerid, -1, glstr);
						SetPVarInt(plid, "Invited", 1);
						SetPVarInt(plid, "Inviter", playerid);
					}
					case FPMN_uninvite:
					{
						if(PI[playerid][Rank] < 8 || PI[plid][Rank] >= PI[playerid][Rank]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя этого сделать");
						format(glstr, sizeof(glstr), "%s выгнал тебя из фракции", Name(playerid));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты выгнал %s из фракции", Name(plid));
						SendClientMessage(playerid, -1, glstr);
						PI[plid][Faction] = 0;
						PI[plid][Rank] = 0;
						SetPlayerFactionColor(plid);
						SetPlayerFactionSkin(plid);
					}
					case FPMN_gRank:
					{
						if(PI[plid][Rank]+1 == PI[playerid][Rank]) return SendClientMessage(playerid, COLOR_SYSTEM, "Нельзя этого сделать");
						else if(PI[playerid][Rank] < 8 || PI[plid][Rank] >= PI[playerid][Rank]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя этого сделать");
						PI[plid][Rank]++;
						format(glstr, sizeof(glstr), "%s повысил тебя до должности {00FF00}%s", Name(playerid), GetRank(plid));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты повысил %s до должности {00FF00}%s", Name(plid), GetRank(plid));
						SendClientMessage(playerid, -1, glstr);
					}
					case FPMN_Rank:
					{
						if(PI[plid][Rank]-1 == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Нельзя этого сделать");
						else if(PI[playerid][Rank] < 8 || PI[plid][Rank] >= PI[playerid][Rank]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нельзя этого сделать");
						PI[plid][Rank]--;
						format(glstr, sizeof(glstr), "%s понизил тебя до должности {00FF00}%s", Name(playerid), GetRank(plid));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты понизил %s до должности {00FF00}%s", Name(plid), GetRank(plid));
						SendClientMessage(playerid, -1, glstr);
					}
				}
			} else ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"), playerid);
		}
		case P_MENU_FACTION_HEAL1:
		{
			if(response)
			{
				if(strval(inputtext) > PI[GetPVarInt(playerid, "ClickedPlayer")][Money]) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FF0000}У игрока недостаточно денег \n\n{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
				new plid = GetPVarInt(playerid, "ClickedPlayer");
				switch(GetPVarInt(playerid, "HealType"))
				{
					case 1:
					{
						if(PI[plid][Health] == 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок здоров");
						else if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
						else if(strval(inputtext) > 250 || strval(inputtext) < 10) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FF0000}Неверная стоимость \n\n{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
						SetPVarInt(plid, "Healing", 1);
						SetPVarInt(plid, "Healer", playerid);
						SetPVarInt(plid, "HealCost", strval(inputtext));
						format(glstr, sizeof(glstr), "%s предлагает тебе лечение за {00FF00}$%d{FFFFFF}, нажми N", Name(playerid), strval(inputtext));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты предложил %s лечение за {00FF00}$%d", Name(plid), strval(inputtext));
						SendClientMessage(playerid, -1, glstr);
					}
					case 2:
					{
						if(PI[plid][Eat] > 10) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не голоден");
						else if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
						else if(strval(inputtext) > 250 || strval(inputtext) < 10) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FF0000}Неверная стоимость \n\n{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
						SetPVarInt(plid, "Healing", 1);
						SetPVarInt(plid, "Healer", playerid);
						SetPVarInt(plid, "HealCost", strval(inputtext));
						format(glstr, sizeof(glstr), "%s предлагает тебе витамины за {00FF00}$%d{FFFFFF}, нажми N", Name(playerid), strval(inputtext));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты предложил %s витамины за {00FF00}$%d", Name(plid), strval(inputtext));
						SendClientMessage(playerid, -1, glstr);
					}
					case 3:
					{
						if(PI[plid][Health] > 5) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не нуждается в обезболивающем");
						else if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
						else if(strval(inputtext) > 250 || strval(inputtext) < 10) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FF0000}Неверная стоимость \n\n{FFFFFF}Введи цену\nМинимальная цена {00FF00}$10 {FFFFFF}, а максимальная {00FF00}$250", "Далее", "Назад");
						SetPVarInt(plid, "Healing", 1);
						SetPVarInt(plid, "Healer", playerid);
						SetPVarInt(plid, "HealCost", strval(inputtext));
						format(glstr, sizeof(glstr), "%s предлагает тебе обезболивающее за {00FF00}$%d{FFFFFF}, нажми N", Name(playerid), strval(inputtext));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты предложил %s обезболивающее за {00FF00}$%d", Name(plid), strval(inputtext));
						SendClientMessage(playerid, -1, glstr);
					}
					case 4:
					{
						if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FFFFFF}Введи цену\nМинимальная цена {00FF00}$15000 {FFFFFF}, а максимальная {00FF00}$30000", "Далее", "Назад");
						else if(strval(inputtext) > 30000 || strval(inputtext) < 15000) return ShowPlayerDialog(playerid, P_MENU_FACTION_HEAL1, DIALOG_STYLE_INPUT, "{FFFFFF}Помощь для игрока", "{FF0000}Неверная стоимость \n\n{FFFFFF}Введи цену\nМинимальная цена {00FF00}$15000 {FFFFFF}, а максимальная {00FF00}$30000", "Далее", "Назад");
						SetPVarInt(plid, "Healing", 1);
						SetPVarInt(plid, "Healer", playerid);
						SetPVarInt(plid, "HealCost", strval(inputtext));
						format(glstr, sizeof(glstr), "%s предлагает тебе сменить пол за {00FF00}$%d{FFFFFF}, нажми N", Name(playerid), strval(inputtext));
						SendClientMessage(plid, -1, glstr);
						format(glstr, sizeof(glstr), "Ты предложил %s сменить пол за {00FF00}$%d", Name(plid), strval(inputtext));
						SendClientMessage(playerid, -1, glstr);
					}
				}
			} else ShowMenu(playerid, P_MENU_FACTION);
		}
		case P_MENU_FACTION_HEAL2:
		{
			if(response)
			{
				removePlayerMoney(playerid, GetPVarInt(playerid, "HealCost"));
				givePlayerMoney(GetPVarInt(playerid, "Healer"), GetPVarInt(playerid, "HealCost"));
				format(glstr, sizeof(glstr), "Ты принял помощь от %s и заплатил ему {00FF00}$%d", Name(GetPVarInt(playerid, "Healer")), GetPVarInt(playerid, "HealCost"));
				SendClientMessage(playerid, -1, glstr);
				format(glstr, sizeof(glstr), "%s принял твою помощь и заплатил тебе {00FF00}$%d", Name(playerid), GetPVarInt(playerid, "HealCost"));
				SendClientMessage(GetPVarInt(playerid, "Healer"), -1, glstr);
				switch(GetPVarInt(GetPVarInt(playerid, "Healer"), "HealType"))
				{
					case 1:
					{
						setPlayerHealth(playerid, 100.0);
						SetPVarInt(playerid, "Healing", 0);
					}
					case 2:
					{
						PI[playerid][Eat] = 20;
						SetPVarInt(playerid, "Healing", 0);
					}
					case 3:
					{
						setPlayerHealth(playerid, 10.0);
						SetPVarInt(playerid, "Healing", 0);
					}
					case 4:
					{
						if(PI[playerid][Sex] == 1)
						{
							SetPlayerSex(playerid, 0);
							PI[playerid][Skin] = 12;
						} else {
							SetPlayerSex(playerid, 1);
							PI[playerid][Skin] = 78;
						}
						SetPVarInt(playerid, "Healing", 0);
					}
				}
				if(!IsPlayerInAnyVehicle(playerid)) ClearAnimations(playerid);
			} else {
				SendClientMessage(GetPVarInt(playerid, "Healer"), -1, "Пациент отказался от вашей помощи");
				SetPVarInt(playerid, "Healing", 0);
			}
		}
		case P_MENU_FACTION_IVIEW:
		{
			if(response)
			{
				SetPVarInt(GetPVarInt(playerid, "iViewer"), "iViewing", 3);
				SetPVarInt(playerid, "iViewing", 2);
				SetPVarInt(GetPVarInt(playerid, "iViewer"), "NowRadio", PI[GetPVarInt(playerid, "iViewer")][Faction]-6);
				SetPVarInt(playerid, "NowRadio", PI[GetPVarInt(playerid, "iViewer")][Faction]-6);
			} else {
				SetPVarInt(playerid, "iViewer", PLAYERS);
				SetPVarInt(playerid, "iViewing", 0);
			}
		}
		case P_MENU_FACTION_WANTED:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_FACTION_WANTED, DIALOG_STYLE_INPUT, "{FFFFFF}Причина розыска", "{FFFFFF}Введи причину повышения уровня розыска", "Повысить", "Назад");
				format(glstr, sizeof(glstr), "%s повысил твой уровень розыска, причина: %s", Name(playerid), inputtext);
				SendClientMessage(GetPVarInt(playerid, "ClickedPlayer"), -1, glstr);
				format(glstr, sizeof(glstr), "Ты повысил уровень розыска %s, причина: %s", Name(GetPVarInt(playerid, "ClickedPlayer")), inputtext);
				SendClientMessage(playerid, -1, glstr);
				setPlayerWantedLevel(GetPVarInt(playerid, "ClickedPlayer"), PI[GetPVarInt(playerid, "ClickedPlayer")][Wanted]+1);
			} else ShowMenu(playerid, P_MENU_FACTION);
		}
		case P_MENU_FACTION_INVITE:
		{
			if(response)
			{
				PI[playerid][Faction] = PI[GetPVarInt(playerid, "Inviter")][Faction];
				PI[playerid][Rank] = 1;
				PI[playerid][Job] = 0;
				SetPlayerFactionColor(playerid);
				SetPlayerFactionSkin(playerid);
				format(glstr, sizeof(glstr), "%s принял приглашение во фракцию %s", Name(playerid), fName[PI[playerid][Faction]]);
				Do(playerid, glstr);
				SendClientMessage(playerid, -1, "! - фракционный IC чат");
				SendClientMessage(playerid, -1, "!! - общефракционный IC чат");
				SendClientMessage(playerid, -1, "!* - фракционный OOC чат");
				SendClientMessage(playerid, -1, "!!* - общефракционный OOC чат");
			} else {
				format(glstr, sizeof(glstr), "%s отказался вступать в твою фракцию", Name(playerid));
				SendClientMessage(GetPVarInt(playerid, "Inviter"), -1, glstr);
			}
			SetPVarInt(playerid, "Invited", 0);
		}
		case P_MENU_MONEY:
		{
		    if(response)
		    {
		        format(glstr, sizeof(glstr), "{FFFFFF}Передача денег игроку %s [%d]", Name(GetPVarInt(playerid, "ClickedPlayer")), GetPVarInt(playerid, "ClickedPlayer"));
			    if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_MONEY, DIALOG_STYLE_INPUT, glstr, "{FFFFFF}Введи сумму, которую хочешь передать этому игроку", "Передать", "Назад");
				else if(PI[playerid][Money] < strval(inputtext) || strval(inputtext) < 1) return ShowPlayerDialog(playerid, P_MENU_MONEY, DIALOG_STYLE_INPUT, glstr, "{FF0000}Неверная сумма\n\n{FFFFFF}Введи сумму, которую хочешь передать этому игроку", "Передать", "Назад");
                else if(!PlayerInRadius(playerid, GetPVarInt(playerid, "ClickedPlayer"), 5.0) || GetPVarInt(GetPVarInt(playerid, "ClickedPlayer"), "InSpec")) return ShowPlayerDialog(playerid, P_MENU_MONEY, DIALOG_STYLE_INPUT, glstr, "{FF0000}Игрок далеко от тебя\n\n{FFFFFF}Введи сумму, которую хочешь передать этому игроку", "Передать", "Назад");
                else if(PI[playerid][Level] == 1 && PI[playerid][Exp] == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты пока не можешь передавать деньги");
				else {
					format(glstr, sizeof(glstr), "{00FF00}%s [%d] {00FF30}передал тебе {00FF00}$%d", Name(playerid), playerid, strval(inputtext));
				    SendClientMessage(GetPVarInt(playerid, "ClickedPlayer"), -1, glstr);
				    format(glstr, sizeof(glstr), "{00FF00}$%d {00FF30}отдано игроку {00FF00}%s [%d]", strval(inputtext), Name(GetPVarInt(playerid, "ClickedPlayer")), GetPVarInt(playerid, "ClickedPlayer"));
				    SendClientMessage(playerid, -1, glstr);
					MoveMoney(playerid, GetPVarInt(playerid, "ClickedPlayer"), strval(inputtext));
					format(glstr, sizeof(glstr), "%s передал деньги %s", Name(playerid), Name(GetPVarInt(playerid, "ClickedPlayer")));
					Do(playerid, glstr);
					if(!IsPlayerInAnyVehicle(playerid))
					{
						ClearAnimations(playerid);
						ApplyAnimationEx(playerid,"DEALER","shop_pay",4.1,0,1,1,1,1);
						SetTimerEx("ClearAnims", 5000, false, "d", playerid);
					}
				}
		    } else ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"), playerid);
		}
		case P_MENU_REPORT:
		{
			if(response)
			{
			    format(glstr,sizeof(glstr), "{FFFFFF}Жалоба на %s [%d]", Name(GetPVarInt(playerid, "ClickedPlayer")), GetPVarInt(playerid, "ClickedPlayer"));
			    if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, P_MENU_REPORT, DIALOG_STYLE_INPUT, glstr, "{FFFFFF}Опиши ситуацию в поле ниже, пиши грамотно и понятно, иначе жалобу не рассмотрят", "Отправить", "Назад");
			    else if(PIpen[playerid][Cheater] == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Жалоба не может быть отправлена из читерского мира");
			    format(glstr,sizeof(glstr), "{1E90FF}От %s [%d] на %s [%d] {FF0000}жалоба{1E90FF}: %s (%d ур.)", Name(playerid), playerid, Name(GetPVarInt(playerid, "ClickedPlayer")), GetPVarInt(playerid, "ClickedPlayer"), inputtext, PI[GetPVarInt(playerid, "ClickedPlayer")][Level]);
			    SendAdminMessage(100, glstr);
				SendClientMessage(playerid, 0x00FF00FF, "Жалоба отправлена");
			} else ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"), playerid);
		}

		case D_DONATE:
		{
		    if(response)
		    {
				mysql_format(mysql1, query1, sizeof(query1), "SELECT `Donate` FROM `users` WHERE `ID` =  '%d'", PI[playerid][ID]);
				mysql_tquery(mysql1, query1, "RefreshDonate", "d", playerid);
		        switch(DLItemID)
		        {
					case DON_cash:
					{
						format(glstr, sizeof(glstr), "{FFFF00}На счету %.2f р.", PI[playerid][Donate]);
						ShowPlayerDialog(playerid, D_DONATE_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Донат - Баланс", glstr, "Выход", "Назад");
					}
					case DON_nick: ShowDonateSetNick(playerid, "{FFFFFF}Пример: Иван_Петров");
					case DON_money: ShowDonateSetCash(playerid, "");
		        }
		    } else OnPlayerCommandText(playerid, "/mm");
		}
		case D_DONATE_MONEY:
		{
			if(response)
			{
				new Float:cash = strval(inputtext);
				new Float:cost = cash / CASH_COST;
				if(!strlen(inputtext)) return ShowDonateSetCash(playerid, "");
				if(!IsNumeric(inputtext)) return ShowDonateSetCash(playerid, "{FF0000}Неверный формат");
				if(cash < 10 || cash > 2000000000) return ShowDonateSetCash(playerid, "{FF0000}Неверная сумма, минимум $10");
				if(PI[playerid][Donate] < cost) return ShowDonateSetCash(playerid, "{FF0000}Недостаточно денег");
				format(glstr, sizeof(glstr), "Ты купил $%.0f за %.2f р.", cash, cost);
				givePlayerMoney(playerid, floatround(cash));
				givePlayerDonate(playerid, -cost);
				ShowMenu(playerid, D_DONATE);
				SendClientMessage(playerid, COLOR_DONATE, glstr);
			} else ShowMenu(playerid, D_DONATE);
		}
		case D_DONATE_NICK:
		{
			if(response)
			{
				if(!strlen(inputtext)) return ShowDonateSetNick(playerid, "{FFFFFF}Пример: Иван_Петров");
				if(!IsRPNick(inputtext)) return ShowDonateSetNick(playerid, "{FF0000}Имя не соответствует правилам РП\n{FFFFFF}Пример: Иван_Петров");
				//if(IsPlayerRegister(inputtext)) return ShowDonateSetNick(playerid, "{FF0000}Имя уже занято\n{FFFFFF}Пример: Иван_Петров");
				if(PI[playerid][Donate] < NICK_COST) return ShowDonateSetNick(playerid, "{FF0000}Недостаточно денег\n{FFFFFF}Пример: Иван_Петров");
				format(glstr, sizeof(glstr), "%s изменил имя на", Name(playerid));
				setPlayerName(playerid, inputtext);
				format(glstr, sizeof(glstr), "%s %s", glstr, Name(playerid));
				givePlayerDonate(playerid, -NICK_COST);
				ShowMenu(playerid, D_DONATE);
				SendClientMessageToAll(COLOR_DONATE, glstr);
			} else ShowMenu(playerid, D_DONATE);
		}
		case D_DONATE_INFO:
		{
			if(!response) ShowMenu(playerid, D_DONATE);
		}
		case MENU:
		{
		    if(response)
		    {
		        switch(DLItemID)
		        {
					case MN_admin: ShowMenu(playerid, ADMIN);
					case MN_stats: ShowStats(playerid, playerid, 5),SetPVarInt(playerid, "ClickedPlayer", playerid);
					case MN_gps: if(GetPVarInt(playerid, "OutJob") == 0) { ShowMenu(playerid, D_GPS); } else { SendClientMessage(playerid, COLOR_SYSTEM, "Закончи рабочий день"); }
					case MN_options: ShowMenu(playerid, D_OPT);
					case MN_report: ShowPlayerDialog(playerid, D_REPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Связь с администрацией", "{FFFFFF}Пиши грамотно и понятно, иначе тебе не ответят", "Отправить", "Назад");
					case MN_inf: ShowMenu(playerid, D_INF);
					case MN_donate: ShowMenu(playerid, D_DONATE);
					case MN_heal:
					{
						if(PI[playerid][Health] >= 100.0) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты здоров");
						else if(PI[playerid][Health] >= 80.0 && PI[playerid][Health] <= 99.0) return SendClientMessage(playerid, COLOR_SYSTEM, "Для полного лечения обратись к врачу");
						else if(GetPVarInt(playerid, "OutBrain") == 1)  return SendClientMessage(playerid, COLOR_SYSTEM, "Ты без сознания");
						setPlayerHealth(playerid, 80.0);
						PI[playerid][HealPacks]--;
					}
					case MN_frac: ShowMenu(playerid, D_FACTION);
					case MN_phone:ShowMenu(playerid, DM_PHONE);
		        }
		    }
		}
		case DM_PHONE:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case MN_phone_cont:
					{
						new body[512], iniFile;
						format(glstr, sizeof(glstr), "Телефон/%s [%d].ini", Name(playerid), PI[playerid][ID]);
						if(!fexist(glstr))
						{
							iniFile = ini_createFile(glstr);
							for(new i;i<20;i++)
							{
								format(glstr,sizeof(glstr),"C%d",i+1);
								ini_setInteger(iniFile, glstr, PhoneC[playerid][i]);
								format(glstr,sizeof(glstr),"CN%d",i+1);
								ini_setString(iniFile, glstr, PhoneN[playerid][i]);
							}
							ini_closeFile(iniFile);
						}
						iniFile = ini_openFile(glstr);
						for(new i;i<20;i++)
						{
							format(glstr,sizeof(glstr),"C%d",i+1);
							ini_getInteger(iniFile, glstr, PhoneC[playerid][i]);
							format(glstr,sizeof(glstr),"CN%d",i+1);
							ini_getString(iniFile, glstr, PhoneN[playerid][i]);
							format(glstr,sizeof(glstr),"%s",PhoneN[playerid][i]);
							strcat(body, glstr);
							if(PhoneC[playerid][i] != 0)
							{
								format(glstr,sizeof(glstr)," | %d",PhoneC[playerid][i]);
								strcat(body, glstr);
							}
							strcat(body, "\n");
						}
						ini_closeFile(iniFile);
						ShowPlayerDialog(playerid, DM_PHONE_D, DIALOG_STYLE_LIST, "{FFFFFF}Контакты", body, "Выбрать", "Назад");
					}
					case MN_phone_112:
					{
						AddDListItem(playerid, "Полиция", MN_phone_112_02);
						AddDListItem(playerid, "Скорая помощь", MN_phone_112_03);
						ShowPlayerDList(playerid, DM_PHONE_112, "{FFFFFF}Экстренные службы", "Вызвать", "Назад");
					}
					case MN_phone_serv:
					{
						AddDListItem(playerid, "Такси", MN_phone_serv_taxi);
						ShowPlayerDList(playerid, DM_PHONE_SERV, "{FFFFFF}Другие услуги", "Вызвать", "Назад");
					}
					case MN_phone_radio:
					{
						AddDListItem(playerid, "Выключить радио", MN_phone_radio_OFF);
						AddDListItem(playerid, "Радио Лос Сантоса", MN_phone_radio_LS);
						AddDListItem(playerid, "Радио Сан Фиерро", MN_phone_radio_SF);
						AddDListItem(playerid, "Радио Лас Вентураса", MN_phone_radio_LV);
						ShowPlayerDList(playerid, DM_PHONE_RADIO, "{FFFFFF}Радио", "Включить", "Назад");
					}
					case MN_phone_selfie: 
					{
						GetPlayerFacingAngle(playerid, S_Angle[playerid]);
						InSelfie(playerid, S_Angle[playerid]);
						ShowPlayerDialog(playerid, D_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Управление", "{FFFF00}Отключить вращение головы можно командой {FF0000}/headmove\n{FFFF00}Выйти из режима камеры можно клавишей {FF0000}ESC", "ОК", "");
					}
				}
			} else OnPlayerCommandText(playerid, "/mm");
		}
		case D_TAXI:
		{
			if(response)
			{
				new plid = nTaxi[listitem];
				SetPVarInt(plid, "CalledTaxi", 0);
				SetPVarInt(playerid, "TaxiDriver", 1);
				SendClientMessage(plid, 0x00FF00FF, "Твой вызов приняли");
				GetPlayerPos(plid, PI[plid][X], PI[plid][Y], PI[plid][Z]);
				DestroyDynamicCP(CP_112[playerid]); 
				CP_112[playerid] = CreateDynamicCP(PI[plid][X], PI[plid][Y], PI[plid][Z], 3.0, -1, -1, playerid, 3000.0);
				TogglePlayerDynamicCP(playerid, CP_112[playerid], true);
			}
		}
		case DM_PHONE_SERV:
		{
			if(response)
			{
				GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
				switch(DLItemID)
				{
					case MN_phone_serv_taxi:
					{
						if(GetPVarInt(playerid, "CalledTaxi") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Вызов уже отправлен");
						else if(!IsTaxiOnline()) return SendClientMessage(playerid, COLOR_SYSTEM, "Таксистов нет");
						format(glstr,sizeof(glstr),"%s вызвал такси, чтобы принять нажми N", Name(playerid));
						SetPVarInt(playerid, "CalledTaxi", 1);
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i)) continue;
							if(PI[i][Job] == 1 && GetPVarInt(i, "IsOnJob") == 1) 
							{
								SendClientMessage(i, 0x0080FFFF, glstr);
							}
						}
						SendClientMessage(playerid, 0x00FF00FF, "Вызов отправлен");
					}
				}
			} else ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_RADIO:
		{
			if(response)
			{
				SetPVarInt(playerid, "NowRadio", listitem);
			} else ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_112:
		{
			if(response)
			{
				GetPlayerPos(playerid, PI[playerid][X], PI[playerid][Y], PI[playerid][Z]);
				switch(DLItemID)
				{
					case MN_phone_112_02:
					{
						if(!IsCopsOnline()) return SendClientMessage(playerid, COLOR_SYSTEM, "На посту никого нет");
						format(glstr,sizeof(glstr),"%s вызывает полицию, езжайте на место и выясните в чём дело", Name(playerid));
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i)) continue;
							if(PI[i][Faction] == PI[playerid][sZone] + 3) 
							{
								DestroyDynamicCP(CP_112[i]); 
								CP_112[i] = CreateDynamicCP(PI[playerid][X], PI[playerid][Y], PI[playerid][Z], 3.0, -1, -1, i, 3000.0);
								TogglePlayerDynamicCP(i, CP_112[i], true);
								SendClientMessage(i, 0x0080FFFF, glstr);
							}
						}
						SendClientMessage(playerid, 0x00FF00FF, "Вызов отправлен");
					}
					case MN_phone_112_03:
					{
						if(!IsHPOnline()) return SendClientMessage(playerid, COLOR_SYSTEM, "На посту никого нет");
						format(glstr,sizeof(glstr),"%s вызывает скорую помощь", Name(playerid));
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i)) continue;
							if(PI[i][Faction] == PI[playerid][sZone] && IsHPcar(i))
							{
								DestroyDynamicCP(CP_112[i]); 
								CP_112[i] = CreateDynamicCP(PI[playerid][X], PI[playerid][Y], PI[playerid][Z], 3.0, -1, -1, i, 3000.0);
								TogglePlayerDynamicCP(i, CP_112[i], true);
								SendClientMessage(i, 0x0080FFFF, glstr);
							}
						}
						SendClientMessage(playerid, 0x00FF00FF, "Вызов отправлен");
					}
				}
			}
		}
		case DM_PHONE_D:
		{
			if(response)
			{
				SetPVarInt(playerid, "Contact", listitem);
				if(PhoneC[playerid][listitem] == 0)
				{
					ShowPlayerDialog(playerid, DM_PHONE_ADD_C, DIALOG_STYLE_INPUT, "{FFFFFF}Добавление контакта", "{FFFFFF}Введи номер и через запятую имя контакта\n{FFFF00}Пример: {00FFFF}123456,Имя", "Добавить", "Назад");
				} else {

					if(IsNumberOnline(PhoneC[playerid][listitem]))
					{
						AddDListItem(playerid, "Позвонить", MN_phone_call);
						AddDListItem(playerid, "Отправить СМС", MN_phone_sms);
					}
					AddDListItem(playerid, "Изменить номер", MN_phone_C);
					AddDListItem(playerid, "Изменить имя", MN_phone_N);
					ShowPlayerDList(playerid, DM_PHONE_ADD_N, "{FFFFFF}Действия над контактом", "Выбрать", "Назад");
				}
			} else ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_ADD_N:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case MN_phone_call:
					{
						format(glstr,sizeof(glstr),"/зв %d", PhoneC[playerid][GetPVarInt(playerid, "Contact")]);
						OnPlayerCommandText(playerid, glstr);
					}
					case MN_phone_sms: ShowPlayerDialog(playerid, DM_PHONE_SMS, DIALOG_STYLE_INPUT, "{FFFFFF}СМС", "{FFFFFF}Введи текст сообщения", "Отправить", "Назад");
					case MN_phone_C: ShowPlayerDialog(playerid, DM_PHONE_C, DIALOG_STYLE_INPUT, "{FFFFFF}Номер контакта", "{FFFFFF}Введи новый номер", "Изменить", "Назад");
					case MN_phone_N: ShowPlayerDialog(playerid, DM_PHONE_N, DIALOG_STYLE_INPUT, "{FFFFFF}Имя контакта", "{FFFFFF}Введи новое имя", "Изменить", "Назад");
				}
			} else ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_C:
		{
			if(response)
			{
				new number = strval(inputtext);
				if(!strlen(inputtext)) return ShowPlayerDialog(playerid, DM_PHONE_C, DIALOG_STYLE_INPUT, "{FFFFFF}Номер контакта", "{FFFFFF}Введи новый номер", "Изменить", "Назад");
				else if(strlen(inputtext) != 6) return ShowPlayerDialog(playerid, DM_PHONE_C, DIALOG_STYLE_INPUT, "{FFFFFF}Номер контакта", "{FF0000}Слишком длинный номер\n\n{FFFFFF}Введи новый номер", "Изменить", "Назад");
				else if(!IsNumeric(inputtext)) return ShowPlayerDialog(playerid, DM_PHONE_C, DIALOG_STYLE_INPUT, "{FFFFFF}Номер контакта", "{FF0000}Неверный формат\n\n{FFFFFF}Введи новый номер", "Изменить", "Назад");
				PhoneC[playerid][GetPVarInt(playerid, "Contact")] = number;
				UpdatePhoneContacts(playerid);
				ShowMenu(playerid, DM_PHONE);
			} else ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_N:
		{
			if(response)
			{
				if(!strlen(inputtext)) return ShowPlayerDialog(playerid, DM_PHONE_N, DIALOG_STYLE_INPUT, "{FFFFFF}Имя контакта", "{FFFFFF}Введи новое имя", "Изменить", "Назад");
				else if(strlen(inputtext) > 24) return ShowPlayerDialog(playerid, DM_PHONE_N, DIALOG_STYLE_INPUT, "{FFFFFF}Имя контакта", "{FF0000}Слишком длинное имя\n\n{FFFFFF}Введи новое имя", "Изменить", "Назад");
				format(PhoneN[playerid][GetPVarInt(playerid, "Contact")], 32, "%s", inputtext);
				UpdatePhoneContacts(playerid);
				ShowMenu(playerid, DM_PHONE);
			} else ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_SMS:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, DM_PHONE_SMS, DIALOG_STYLE_INPUT, "{FFFFFF}СМС", "{FFFFFF}Введи текст сообщения", "Отправить", "Назад");
				format(glstr,sizeof(glstr),"/смс %d %s", PhoneC[playerid][GetPVarInt(playerid, "Contact")], inputtext);
				OnPlayerCommandText(playerid, glstr);
			}
			ShowMenu(playerid, DM_PHONE);
		}
		case DM_PHONE_ADD_C:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, DM_PHONE_ADD_C, DIALOG_STYLE_INPUT, "{FFFFFF}Добавление контакта", "{FFFFFF}Введи номер и через запятую имя контакта\n{FFFF00}Пример: {00FFFF}123456,Имя", "Добавить", "Назад");
				else if(strfind(inputtext, ",") == -1) return ShowPlayerDialog(playerid, DM_PHONE_ADD_C, DIALOG_STYLE_INPUT, "{FFFFFF}Добавление контакта", "{FFFFFF}Введи номер и через запятую имя контакта\n{FFFF00}Пример: {00FFFF}123456,Имя", "Добавить", "Назад");
				new number, name[32];
				sscanf(inputtext, "p<,>ds[32]", number, name);
				PhoneC[playerid][GetPVarInt(playerid, "Contact")] = number;
				format(PhoneN[playerid][GetPVarInt(playerid, "Contact")], 32, "%s", name);
				UpdatePhoneContacts(playerid);
			}
			ShowMenu(playerid, DM_PHONE);
		}
		case D_GPS:
		{
			if(response)
			{
				switch(listitem)
				{
					case 0: ShowMenu(playerid, D_GPS_JOBS);
					case 1: ShowMenu(playerid, D_GPS_GBUILDS);
					case 2: ShowMenu(playerid, D_GPS_MAGZ);
					case 3: ShowMenu(playerid, D_GPS_CARS);
					case 4: ShowMenu(playerid, D_GPS_HOUSE);
					case 5:
					{
						SetPVarInt(playerid,"InGPS", 1);
						new Float:dist1, Float:dist2, n;
						dist1 = GetPlayerDistanceFromPoint(playerid, ATM[0][0], ATM[0][1], ATM[0][2]);
						for(new i=1;i<sizeof(ATM);++i)
						{
							if(dist1 <= (dist2 = GetPlayerDistanceFromPoint(playerid, ATM[i][0], ATM[i][1], ATM[i][2]))) continue;
							dist1 = dist2;
							n = i;
						}
						SendClientMessage(playerid, 0x00FF00FF, "На карте показан ближайший банкомат");
						return SetPlayerCheckpoint(playerid, ATM[n][0], ATM[n][1], ATM[n][2], 4.0);
					}
				}
			} else OnPlayerCommandText(playerid, "/mm");
		}
		case D_GPS_JOBS:
		{
			if(response)
			{
				SetPVarInt(playerid,"InGPS", 1);
				switch(listitem)
				{
					case 0: SetPlayerCheckpoint(playerid, 2189.8433,-2265.9539,13.5160, 4.0);
					case 1: SetPlayerCheckpoint(playerid, -1647.7408,-2238.4050,30.1708, 4.0);
					case 2: SetPlayerCheckpoint(playerid, -473.2987,1413.5334,21.2620, 4.0);
				}
			} else ShowMenu(playerid, D_GPS);
		}
		case D_GPS_GBUILDS:
		{
			if(response)
			{
				SetPVarInt(playerid,"InGPS", 1);
				switch(listitem)
				{
					case 0: SetPlayerCheckpoint(playerid, 1481.0590,-1737.8079,13.5469, 4.0);
					case 1: SetPlayerCheckpoint(playerid, -2758.7961,375.7213,4.3344, 4.0);
					case 2: SetPlayerCheckpoint(playerid, 2372.2991,2461.5679,10.6719, 4.0);
					case 3: SetPlayerCheckpoint(playerid, 1189.8545,-1328.2993,13.5679, 4.0);
					case 4: SetPlayerCheckpoint(playerid, -2654.8381,626.5082,14.4531, 4.0);
					case 5: SetPlayerCheckpoint(playerid, 1614.4960,1824.9143,10.8203, 4.0);
					case 6: SetPlayerCheckpoint(playerid, 1659.6268,-1708.5380,20.4844, 4.0);
					case 7: SetPlayerCheckpoint(playerid, -1821.9089,545.4432,35.1641, 4.0);
					case 8: SetPlayerCheckpoint(playerid, 2122.7749,2357.7666,10.6719, 4.0);
					case 9: SetPlayerCheckpoint(playerid, 1536.3311,-1675.3818,13.3828, 4.0);
					case 10: SetPlayerCheckpoint(playerid, -1602.3271,723.7422,11.3953, 4.0);
					case 11: SetPlayerCheckpoint(playerid, 2286.0840,2419.0950,10.8203, 4.0);
					case 12: SetPlayerCheckpoint(playerid, -2027.1401,-96.2110,35.1641, 4.0);
					case 13: SetPlayerCheckpoint(playerid, 1170.9088,1368.4738,10.8125, 4.0);
				}
			} else ShowMenu(playerid, D_GPS);
		}
		case D_GPS_MAGZ:
		{
			if(response)
			{
				SetPVarInt(playerid,"InGPS", 1);
				switch(listitem)
				{
					case 0: SetPlayerCheckpoint(playerid, -1970.1978,293.6261,35.1719, 4.0);
					case 1: SetPlayerCheckpoint(playerid, 458.4100,-1501.3242,31.0386, 4.0);
					case 2:
					{
						new Float:dist1, Float:dist2, n;
						dist1 = GetPlayerDistanceFromPoint(playerid, Enter_247[0][0], Enter_247[0][1], Enter_247[0][2]);
						for(new i=1;i<sizeof(Enter247);++i)
						{
							if(dist1 <= (dist2 = GetPlayerDistanceFromPoint(playerid, Enter_247[i][0], Enter_247[i][1], Enter_247[i][2]))) continue;
							dist1 = dist2;
							n = i;
						}
						SendClientMessage(playerid, 0x00FF00FF, "На карте показан ближайший магазин");
						return SetPlayerCheckpoint(playerid, Enter_247[n][0], Enter_247[n][1], Enter_247[n][2], 4.0);
					}
				}
			} else ShowMenu(playerid, D_GPS);
		}
		case D_GPS_CARS:
		{
			if(response)
			{
				SetPVarInt(playerid,"InGPS", 1);
				switch(listitem)
				{
					case 0: SetPlayerCheckpoint(playerid, 1159.8396,-1746.5863,13.5703, 4.0);
					case 1: SetPlayerCheckpoint(playerid, -1991.5089,87.3889,27.6799, 4.0);
					case 2: SetPlayerCheckpoint(playerid, 2789.9890,1276.9260,10.7500, 4.0);
					case 3: SetPlayerCheckpoint(playerid, 1268.0710,-1336.2360,13.3347, 4.0);
					case 4: SetPlayerCheckpoint(playerid, -1945.6633,575.5538,35.1719, 4.0);
					case 5: SetPlayerCheckpoint(playerid, 2815.8650,1332.8453,10.7500, 4.0);
				}
			} else ShowMenu(playerid, D_GPS);
		}
		case D_GPS_HOUSE:
		{
			if(response)
			{
				switch(listitem)
				{
					case 0:
					{
						new hid = PI[playerid][House];
						if(!hid) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет дома");
						DestroyDynamicCP(CP_HOUSE[playerid]);
						CP_HOUSE[playerid] = CreateDynamicCP(HI[hid][StreetX],HI[hid][StreetY],HI[hid][StreetZ], 1.0, -1, -1, playerid, 3000.0);
					}
					case 1:
					{
						format(glstr, sizeof(glstr), "{FFFF00}Введи номер дома от 1 до %d", housecount);
						ShowPlayerDialog(playerid, D_GPS_HOUSE_SEARCH, DIALOG_STYLE_INPUT, "{FFFFFF}Поиск дома по номеру", glstr, "Отметить", "Назад");
					}
				}
			} else ShowMenu(playerid, D_GPS);
		}
		case D_GPS_HOUSE_SEARCH:
		{
			if(response)
			{
				new hid = strval(inputtext);
				if(hid <= 0 || hid > housecount) return SendClientMessage(playerid, COLOR_SYSTEM, "Неверный номер дома");
				DestroyDynamicCP(CP_HOUSE[playerid]);
				CP_HOUSE[playerid] = CreateDynamicCP(HI[hid][StreetX],HI[hid][StreetY],HI[hid][StreetZ], 1.0, -1, -1, playerid, 3000.0);
			} else ShowMenu(playerid, D_GPS_HOUSE);
		}
		case D_INF:
		{
			if(response)
			{
				switch(DLItemID)
				{
					case ADMLIST:
					{
						new body[1024], n;
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i)) continue;
							if(PI[i][Admin] > 0)
							{
								nAdm[n] = i;
								n++;
								if(PI[playerid][Admin] >= 100)
								{
									format(glstr, sizeof(glstr), "%s [%d] Уровень: %d\n", Name(i), i, PI[i][Admin]);
								} else {
									if(PI[i][Admin] >= 100)
									{
										format(glstr, sizeof(glstr), "%s\n", Name(i));
									} else {
										format(glstr, sizeof(glstr), "%s - Хелпер\n", Name(i));
									}
								}
								strcat(body, glstr);
							}
						}
						if(n > 0)
						{
							ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_LIST, "{FFFFFF}Список админов онлайн", body, "Выбрать", "Назад");
						} else {
							ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Список админов онлайн", "Админов онлайн нет", "Выход", "Назад");
						}
					}
					case CMDS:
					{
						new body[256];
						strcat(body,"\
						{00FF00}/я {FFFFFF}- сообщение от 3-го лица\n\
						{00FF00}/пр {FFFFFF}- попытка действия от 3-го лица\n\
						{00FF00}/де {FFFFFF}- действие от 3-го лица\n\
						{00FF00}/к {FFFFFF}- крикнуть\n\
						{00FF00}/ш {FFFFFF}- шепнуть\n\
						{00FF00}/и [ID] {FFFFFF}- меню игрока\
						");
						ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Список команд сервера", body, "Выход", "Назад");
					}
					case KEYS:
					{
						new body[1096];
						strcat(body,"\
						{00FF00}Y {FFFFFF}- Меню\n\
						{00FF00}F7 {FFFFFF}- Вкл или Выкл окно чата\n\
						{00FF00}F6 {FFFFFF}- Чат\n\
						{00FF00}Правая кнопка мышки на игроке + Alt {FFFFFF}- Меню игрока\n\
						{00FF00}G {FFFFFF}- Сесть пассажиром в транспорт\n\
						{00FF00}W и S {FFFFFF}- Перемотка оружия на пассажирском месте\n\
						{00FF00}N или Num4 {FFFFFF}- Закрывает или Открывает домашнюю машину\n\
						{00FF00}Num6 {FFFFFF}- Открыть или Закрыть последнюю машину\n");
						strcat(body,"\
						{00FF00}Н {FFFFFF}- Стрелять пассажиром из транспорта или Убрать стрельбу из транспорта\n\
						{00FF00}F (Enter) {FFFFFF}- Входить или Выходить в дома (Чтобы выйти из дома, нужно находиться у двери)\n\
						{00FF00}Page Up и Page Down {FFFFFF}- Перемотка чата\n\
						{00FF00}2 и Num+ {FFFFFF}- Начать или Закончить работу\n\
						{00FF00}Ctrl {FFFFFF}- Вкл или Выкл двигатель\n\
						{00FF00}N+Н {FFFFFF}- открыть настройки транспорта\n\
						\n");
						strcat(body,"\
						{FFFF00}В здании тюнинга\n\
						{00FF00}Enter {FFFFFF}- Назад\n\
						{00FF00}Пробел {FFFFFF}- Выбрать\
						");

						if(PI[playerid][Admin] >= 10)
						{
							strcat(body,"\
							\n\n\
							{FFFF00}Управление за наблюдением игрока\n\
							{00FF00}ЛКМ {FFFFFF}- переключить на следующего игрока\n\
							{00FF00}ПКМ {FFFFFF}- переключить на предыдущего игрока\n\
							{00FF00}Enter или F {FFFFFF}- отключить наблюдение за игроком\n\
							{00FF00}Alt {FFFFFF}- выводит меню игрока\
							");
						}
						ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Список клавиш сервера", body, "Выход", "Назад");
					}
					case LEADERS:
					{
						new body[512], n;
						for(new i;i<PLAYERS;i++)
						{
							if(!InGame(i)) continue;
							if(PI[i][Rank] >= 9)
							{
								n++;
								format(glstr, sizeof(glstr), "{FFFF00}%s, %s %s", fName[PI[i][Faction]], GetRank(i), Name(i));
								strcat(body, glstr);
								if(PI[i][PhoneNumber] != 0)
								{
									format(glstr, sizeof(glstr), " (тел. %d)", PI[i][PhoneNumber]);
									strcat(body, glstr);
								}
								strcat(body, "\n");
							}
						}
						if(n > 0)
						{
							ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Список лидеров онлайн", body, "Выход", "Назад");
						} else {
							ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Список лидеров онлайн", "Лидеров онлайн нет", "Выход", "Назад");
						}
					}
					case HELP: ShowMenu(playerid, D_HELP);
					case NEWS: ShowNews(playerid);
					case ANIMS:
					{
						new body[1161];
						strcat(body,"{FFFF00}");
						strcat(body,"/handsup, /dance[1-4], /rap, /rap2, /rap3, /wankoff, /wank, /strip[1-7], /sexy[1-8], /bj[1-4], /cellin, /cellout, /lean, /piss, /follow\n");
						strcat(body,"/greet, /injured, /injured2, /hitch, /bitchslap, /cpr, /gsign1, /gsign2, /gsign3, /gsign4, /gsign5, /gift, /getup\n");
						strcat(body,"/chairsit, /stand, /slapped, /slapass, /drunk, /gwalk, /gwalk2, /mwalk, /fwalk, /celebrate, /celebrate2, /win, /win2\n");
						strcat(body,"/yes, /deal, /deal2, /thankyou, /invite1, /invite2, /sit, /scratch, /bomb, /getarrested, /laugh, /lookout, /robman\n");
						strcat(body,"/crossarms, /crossarms2, /crossarms3, /lay, /cover, /vomit, /eat, /wave, /crack, /crack2, /smokem, /smokef, /msit, /fsit\n");
						strcat(body,"/chat, /fucku, /taichi, /chairsit, /relax, /bat1, /bat2, /bat3, /bat4, /bat5, /nod, /cry1, /cry2, /chant, /carsmoke, /aim\n");
						strcat(body,"/gang1, /gang2, /gang3, /gang4, /gang5, /gang6, /gang7, /bed1, /bed2, /bed3, /bed4, /carsit, /carsit2, /stretch, /angry\n");
						strcat(body,"/kiss1, /kiss2, /kiss3, /kiss4, /kiss5, /kiss6, /kiss7, /kiss8, /exhausted, /ghand1, /ghand2, /ghand3, /ghand4, /ghand5\n");
						strcat(body,"/basket1, /basket2, /basket3, /basket4, /basket5, /basket6, /akick, /box, /cockgun\n");
						strcat(body,"/bar1, /bar2, /bar3, /bar4, /lay2, /liftup, /putdown, /die, /joint, /die2, /aim2\n");
						strcat(body,"/benddown, /checkout");
						ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Список анимаций сервера", body, "Выход", "Назад");
					}
					case RECORD:
					{
						new body[111];
						format(body,sizeof(body),"{80FFFF}Рекорд игроков: {FFFF00}%d\n{80FFFF}Дата и время рекорда: {FFFF00}%s {80FFFF}в {FFFF00}%s", R[Players], R[Date], R[Time]);
						ShowPlayerDialog(playerid, D_ADMINS, DIALOG_STYLE_MSGBOX, "{FFFFFF}Рекорд игроков на сервере", body, "Выход", "Назад");
					}
				}
			} else OnPlayerCommandText(playerid, "/mn");
		}
		case D_ADMINS:
		{
			if(response)
			{
				format(glstr,sizeof(glstr),"/и %d", nAdm[listitem]);
				OnPlayerCommandText(playerid,glstr);
			} else ShowMenu(playerid, D_INF);
		}
		case D_REPORT:
		{
		    if(response)
		    {
		        if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_REPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Связь с администрацией", "{FFFFFF}Задавай вопрос грамотно и понятно, иначе тебе не ответят", "Отправить", "Назад");
		        if(strlen(inputtext) > 70) return ShowPlayerDialog(playerid, D_REPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Связь с администрацией", "{FF0000}Укороти сообщение\n\n{FFFFFF}Задавай вопрос грамотно и понятно, иначе тебе не ответят", "Отправить", "Назад");
				if(GetPVarInt(playerid, "Report") == 1) return SendClientMessage(playerid, COLOR_SYSTEM, "Подожди немного");
				if(PIpen[playerid][MuteReport] > 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе временно запретили писать в репорт");
		        new msg[70];
		        sscanf(inputtext, "s[70]", msg);
		        format(glstr, sizeof(glstr), "{1E90FF}От %s [%d] {FF0000}вопрос{1E90FF}: %s (%d ур.)", Name(playerid), playerid, msg, PI[playerid][Level]);
				SendAdminMessage(10, glstr);
				SendClientMessage(playerid, 0x00FF00FF, "Отправлено сообщение для администрации");
				SetPVarInt(playerid, "Report", 1);
				SetTimerEx("ClearReport", 30000, false, "d", playerid);
				chatlog(playerid, msg, 6);
		    } else OnPlayerCommandText(playerid, "/mn");
		}
		case D_PASSPORT:
		{
		    if(response)
		    {
				if(PI[playerid][Passport] == 0)
				{
					if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_PASSPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Паспорт", "{FFFF00}Введи дату рождения своего персонажа\n{FFFFFF}Формат: ДД.ММ.ГГГГ", "Далее", "Выход");
					new t2[3],t3[3],t4[5];
					strmid(t2, inputtext, 0, sizeof(t2)+1);
					strmid(t3, inputtext, sizeof(t2), sizeof(t2)+sizeof(t3));
					strmid(t4, inputtext, (sizeof(t2))+sizeof(t3), 11);
					if(!IsNumeric(t2) || !IsNumeric(t3) || !IsNumeric(t4) || strlen(t2) < 2 || strlen(t3) < 2 || strlen(t4) < 4) return ShowPlayerDialog(playerid, D_PASSPORT, DIALOG_STYLE_INPUT, "{FFFFFF}Паспорт", "{FF0000}Неверный формат\n\n{FFFF00}Введи дату рождения своего персонажа\n{FFFFFF}Формат: ДД.ММ.ГГГГ", "Далее", "Выход");
					new bday[11];
					mysql_escape_string(inputtext, bday);
					PI[playerid][Passport] = 1;
					strmid(t2, bday, 0, sizeof(t2)+1);
					strmid(t3, bday, sizeof(t2), sizeof(t2)+sizeof(t3));
					strmid(t4, bday, (sizeof(t2))+sizeof(t3), 11);
					format(PI[playerid][bDay],11,"%s.%s.%s",t2,t3,t4);
					SendClientMessage(playerid, 0x00FF00FF, "Ты получил паспорт");
				} else {
					PI[playerid][Passport] = 0;
					removePlayerMoney(playerid, 30000);
					SendClientMessage(playerid, 0x00FF00FF, "Теперь ты можешь получить новый паспорт");
				}
		    }
		}
		case D_CAR:
		{
			if(response)
			{
				if(!IsPlayerInAnyVehicle(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не в транспорте");
				switch(DLItemID)
				{
					case D_CAR_alarm: ToggleAlarm(GetPlayerVehicleID(playerid));
					case D_CAR_engine: ToggleEngine(GetPlayerVehicleID(playerid));
					case D_CAR_doors: ToggleCarLock(GetPlayerVehicleID(playerid));
					case D_CAR_lights: ToggleLights(GetPlayerVehicleID(playerid));
					case D_CAR_bonnet: ToggleBonnet(GetPlayerVehicleID(playerid));
					case D_CAR_boot: ToggleBoot(GetPlayerVehicleID(playerid));
				}
			}
		}
		case D_OPT:
		{
		    if(response)
		    {
		        switch(listitem)
		        {
		            case 3: {
		                new subject[32], message[256], tmp[64];
			            format(subject, sizeof(subject), "Данные аккаунта %s", Name(playerid));
			            format(tmp, sizeof(tmp), "Номер аккаунта: %d\n", PI[playerid][ID]);
			            strcat(message, tmp);
	 		            format(tmp, sizeof(tmp), "Секретное слово: %s\n", PI[playerid][Key]);
			            strcat(message, tmp);
						/*switch(SendMail(PI[playerid][Email], subject, message))
						{
							case 1: format(tmp, sizeof(tmp), "{00FF00}На Email %s отправлено письмо с данными", PI[playerid][Email]);
							default: format(tmp, sizeof(tmp), "{FF0000}Не удалось отправить письмо на Email %s", PI[playerid][Email]);
						}*/
						SendClientMessage(playerid, COLOR_SYSTEM, tmp);
		            }
		            default: {
		                if(!IsValidKey(playerid)) return SendClientMessage(playerid, COLOR_SYSTEM, "У тебя нет секретного слова, необходимо ввести"), ShowPlayerDialog(playerid, D_KEY, DIALOG_STYLE_INPUT, "{FFFFFF}Секретное слово", "{FF0000}Никому не сообщай своё секретное слово!\nЕго можно использовать для восстановления доступа к аккаунту.\nРегистр букв учитывается! \n\n{FFFFFF}Введи новое секретное слово:", "Изменить", "Назад");
		                SetPVarInt(playerid, "D_OPT_ID", listitem);
		                ShowPlayerDialog(playerid, D_CKEY, DIALOG_STYLE_INPUT, "{FFFFFF}Проверка", "{FFFFFF}Введи своё секретное слово, чтобы продолжить:", "ОК", "Назад");
		            }
		        }
		    } else OnPlayerCommandText(playerid, "/mn");
		}
		case D_CKEY:
		{
		    if(response)
		    {
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_CKEY, DIALOG_STYLE_INPUT, "{FFFFFF}Проверка", "{FFFFFF}Введи своё секретное слово, чтобы продолжить:", "ОК", "Назад");
				else if(strcmp(inputtext, PI[playerid][Key], false)) return ShowPlayerDialog(playerid, D_CKEY, DIALOG_STYLE_INPUT, "{FFFFFF}Проверка", "{FF0000}Ты ввёл неверное секретное слово! \n{FFFFFF}Введи своё секретное слово, чтобы продолжить:", "ОК", "Назад");
				else {
					switch(GetPVarInt(playerid, "D_OPT_ID"))
					{
					    case 0: ShowPlayerDialog(playerid, D_PASS, DIALOG_STYLE_INPUT, "{FFFFFF}Пароль", "{FFFFFF}Введи новый пароль:", "Изменить", "Назад");
					    case 1: ShowPlayerDialog(playerid, D_EMAIL, DIALOG_STYLE_INPUT, "{FFFFFF}Email", "{FFFFFF}Введи новый Email:", "Изменить", "Назад");
						case 2: ShowPlayerDialog(playerid, D_KEY, DIALOG_STYLE_INPUT, "{FFFFFF}Секретное слово", "{FF0000}Никому не сообщай своё секретное слово!\nЕго можно использовать для восстановления доступа к аккаунту.\nРегистр букв учитывается! \n\n{FFFFFF}Введи новое секретное слово:", "Изменить", "Назад");
						case 3:
						{
							format(glstr,sizeof(glstr), "{FFFFFF}Передача доната игроку %s\nВведи сумму, которую хочешь передать:", Name(GetPVarInt(playerid, "ClickedPlayer")));
							ShowPlayerDialog(playerid, D_DONATE_PAY, DIALOG_STYLE_INPUT, "{FFFFFF}Передача доната", glstr, "Передать", "Назад");
						}
					}
				}
			} else {
				switch(GetPVarInt(playerid, "D_OPT_ID"))
				{
					case 3: ShowPlayerMenu(GetPVarInt(playerid, "ClickedPlayer"), playerid);
					default: ShowMenu(playerid, D_OPT);
				}
			}
		}
		case D_PASS:
		{
		    if(response)
		    {
		        if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_PASS, DIALOG_STYLE_INPUT, "{FFFFFF}Пароль", "{FFFFFF}Введи новый пароль:", "Изменить", "Назад");
		        if(strlen(inputtext) > 34) return ShowPlayerDialog(playerid, D_PASS, DIALOG_STYLE_INPUT, "{FFFFFF}Пароль", "{FF0000}Слишком сложный пароль \n{FFFFFF}Введи новый пароль:", "Изменить", "Назад");
		        ChangePassword(PI[playerid][ID], inputtext);
				new s[64];
				if(IsOkEmail(playerid))
				{
                    format(s,sizeof(s),"Твой новый пароль - %s", inputtext);
					//SendMail(PI[playerid][Email], "Новый пароль", s);
					format(s,sizeof(s),"Твой новый пароль отправлен на Email %s", PI[playerid][Email]);
				} else {
				    format(s,sizeof(s),"Твой новый пароль - %s", inputtext);
				}
				SendClientMessage(playerid, 0x00FF00FF, s);
				ShowMenu(playerid, D_OPT);
		    } else ShowMenu(playerid, D_OPT);
		}
		case D_EMAIL:
		{
		    if(response)
		    {
		        if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_EMAIL, DIALOG_STYLE_INPUT, "{FFFFFF}Email", "{FFFFFF}Введи новый Email:", "Изменить", "Назад");
                if(strlen(inputtext) > 32) return ShowPlayerDialog(playerid, D_EMAIL, DIALOG_STYLE_INPUT, "{FFFFFF}Email", "{FF0000}Слишком длинный Email\n\n{FFFFFF}Введи новый Email:", "Изменить", "Назад");
				new s[64];
				format(s,sizeof(s),"Твой новый Email - %s", inputtext);
				SendClientMessage(playerid, 0x00FF00FF, s);
				ChangeEmail(playerid, inputtext);
				ShowMenu(playerid, D_OPT);
		    } else ShowMenu(playerid, D_OPT);
		}
		case D_KEY:
		{
		    if(response)
		    {
		        if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_KEY, DIALOG_STYLE_INPUT, "{FFFFFF}Секретное слово", "{FF0000}Никому не сообщай своё секретное слово!\nЕго можно использовать для восстановления доступа к аккаунту.\nРегистр букв учитывается! \n\n{FFFFFF}Введи новое секретное слово:", "Изменить", "Назад");
                if(strlen(inputtext) > 64) return ShowPlayerDialog(playerid, D_KEY, DIALOG_STYLE_INPUT, "{FFFFFF}Секретное слово", "{FFFFFF}Слишком сложное секретное слово\n\n{FF0000}Никому не сообщай своё секретное слово!\nЕго можно использовать для восстановления доступа к аккаунту.\nРегистр букв учитывается! \n\n{FFFFFF}Введи новое секретное слово:", "Изменить", "Назад");
                if(!strcmp(inputtext, "NULL", false)) return ShowPlayerDialog(playerid, D_KEY, DIALOG_STYLE_INPUT, "{FFFFFF}Секретное слово", "{FFFFFF}Неверный формат\n\n{FF0000}Никому не сообщай своё секретное слово!\nЕго можно использовать для восстановления доступа к аккаунту.\nРегистр букв учитывается! \n\n{FFFFFF}Введи новое секретное слово:", "Изменить", "Назад");
				ChangeKey(playerid, inputtext);
				new s[128];
				format(s,sizeof(s),"Твоё новое секретное слово - %s", inputtext);
				SendClientMessage(playerid, 0x00FF00FF, s);
				ShowMenu(playerid, D_OPT);
		    } else ShowMenu(playerid, D_OPT);
		}
		case D_NONRPNICK:
		{
		    if(response)
		    {
				if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_NONRPNICK, DIALOG_STYLE_INPUT, "{FFFFFF}Неподходящий ник", "{FFFFFF}На нашем сервере необходимо использовать ник в формате {FF0000}Имя_Фамилия {FFFFFF}\nВведи новый ник, чтобы играть на нашем сервере:", "Изменить", "");
				if(!IsRPNick(inputtext)) return ShowPlayerDialog(playerid, D_NONRPNICK, DIALOG_STYLE_INPUT, "{FFFFFF}Неподходящий ник", "{FFFFFF}На нашем сервере необходимо использовать ник в формате {FF0000}Имя_Фамилия {FFFFFF}\nВведи новый ник, чтобы играть на нашем сервере:", "Изменить", "");
		        SetPlayerName(playerid, inputtext);
				format(PI[playerid][Nick], 24, inputtext);
	         	return firstJoin(playerid);
		    } else ShowPlayerDialog(playerid, D_NONRPNICK, DIALOG_STYLE_INPUT, "{FFFFFF}Неподходящий ник", "{FFFFFF}На нашем сервере необходимо использовать ник в формате {FF0000}Имя_Фамилия {FFFFFF}\nВведи новый ник, чтобы играть на нашем сервере:", "Изменить", "");
		}
		case D_SELLCAR:
		{
			if(response)
			{
				if(PIcar[playerid][CarID] == 0) return false;
				if(GetVehicleDistanceFromPoint(PIcar[playerid][CarGUID], CarShopEnter[0][0], CarShopEnter[0][1], CarShopEnter[0][2]) > 60.0) return SendClientMessage(playerid, COLOR_SYSTEM, "Твоя машина должна находиться рядом с автосалоном");
				for(new i;i<sizeof(CarsForShop);i++)
				{
					if(CarsForShop[i][0] == PIcar[playerid][CarID])
					{
						givePlayerMoney(playerid, CarsForShop[i][1]/2);
						break;
					}
				}
				DestroyPlayerCar(playerid);
				PIcar[playerid][CarID] = 0;
				PIcar[playerid][Color1] = 1;
				PIcar[playerid][Color2] = 1;
				PIcar[playerid][VehSlot0] = 0;
				PIcar[playerid][VehSlot1] = 0;
				PIcar[playerid][VehSlot2] = 0;
				PIcar[playerid][VehSlot3] = 0;
				PIcar[playerid][VehSlot4] = 0;
				PIcar[playerid][VehSlot5] = 0;
				PIcar[playerid][VehSlot6] = 0;
				PIcar[playerid][VehSlot7] = 0;
				PIcar[playerid][VehSlot8] = 0;
				PIcar[playerid][VehSlot9] = 0;
				PIcar[playerid][VehSlot10] = 0;
				PIcar[playerid][VehSlot11] = 0;
				PIcar[playerid][VehSlot12] = 0;
				PIcar[playerid][VehSlot13] = 0;
				PIcar[playerid][Object1] = 0;
				PIcar[playerid][Object2] = 0;
				PIcar[playerid][PaintJob] = 3;
				SendClientMessage(playerid, 0x00FF00FF, "Транспорт продан");
			}
		}
		case D_BUYCAR:
		{
		    if(response)
		    {
				if(PI[playerid][Money] < CarsForShop[NowCarShop[playerid]][1]) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе не хватает денег");
				else if(PI[playerid][Level] < CarsForShop[NowCarShop[playerid]][2]) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты пока не можешь купить этот транспорт");
				removePlayerMoney(playerid, CarsForShop[NowCarShop[playerid]][1]);
				SendClientMessage(playerid, 0x00FF00FF, "Твоя новая машина стоит возле автосалона");
				PIcar[playerid][CarID] = CarsForShop[NowCarShop[playerid]][0];
				PIcar[playerid][Color1] = 1;
				PIcar[playerid][Color2] = 1;
				PIcar[playerid][VehSlot0] = 0;
				PIcar[playerid][VehSlot1] = 0;
				PIcar[playerid][VehSlot2] = 0;
				PIcar[playerid][VehSlot3] = 0;
				PIcar[playerid][VehSlot4] = 0;
				PIcar[playerid][VehSlot5] = 0;
				PIcar[playerid][VehSlot6] = 0;
				PIcar[playerid][VehSlot7] = 0;
				PIcar[playerid][VehSlot8] = 0;
				PIcar[playerid][VehSlot9] = 0;
				PIcar[playerid][VehSlot10] = 0;
				PIcar[playerid][VehSlot11] = 0;
				PIcar[playerid][VehSlot12] = 0;
				PIcar[playerid][VehSlot13] = 0;
				PIcar[playerid][Object1] = 0;
				PIcar[playerid][Object2] = 0;
				PIcar[playerid][PaintJob] = 3;
				new rand = random(sizeof(CarShopSpawn));
				SetCarNumberR(playerid);
				SpawnPlayerCar(playerid);
				SetVehiclePos(PIcar[playerid][CarGUID], CarShopSpawn[rand][0],CarShopSpawn[rand][1],CarShopSpawn[rand][2]);
				SetVehicleNumberPlate(PIcar[playerid][CarGUID],PIcar[playerid][NumberPlate]);
				SetVehicleVirtualWorld(PIcar[playerid][CarGUID], 0);
				ExitPlayerCarShop(playerid);
		    }
		}
		case D_BUYSKIN:
		{
			if(response)
			{
				if(PI[playerid][Level] < 2) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе нужен 2 уровень");
				SetPVarInt(playerid, "InSkinShop", 1);
				TogglePlayerControllable(playerid, false);
				SetPlayerInterior(playerid, 18);
				SetPVarInt(playerid, "SkinWorld", GetPlayerVirtualWorld(playerid));
				SetPlayerVirtualWorld(playerid, playerid+1);
				SetPlayerSkin(playerid, SkinsForShop[NowSkinShop[playerid]][PI[playerid][Sex]]);
				SetPlayerPos(playerid,182.1377,-88.0541,1002.0234);
				SetPlayerFacingAngle(playerid,90.1966);
				SetPlayerCameraPos(playerid,178.5240,-88.1632,1002.0234);
				SetPlayerCameraLookAt(playerid,182.1377,-88.0541,1002.0234);
				PlayerTextDrawShow(playerid, SkinShopBuy[playerid]);
				PlayerTextDrawShow(playerid, SkinShopNext[playerid]);
				PlayerTextDrawShow(playerid, SkinShopPrev[playerid]);
				SelectTextDraw(playerid, 0xFFFFFF80);
				ShowPlayerDialog(playerid, D_INFO, DIALOG_STYLE_MSGBOX, "{FFFFFF}Управление", "{FFFF00}Выйти из магазина можно клавишей {FF0000}ESC", "ОК", "");
			}
		}
		case D_BANK:
		{
			if(response)
			{
				switch(listitem)
				{
					case 0: format(glstr,sizeof(glstr), "{FFFFFF}У тебя на счету: {00FF00}$%d", PI[playerid][Bank]), ShowPlayerDialog(playerid, D_BANK_G, DIALOG_STYLE_INPUT, "{FFFFFF}Положить деньги", glstr, "Положить", "Назад");
					case 1: format(glstr,sizeof(glstr), "{FFFFFF}У тебя на счету: {00FF00}$%d", PI[playerid][Bank]), ShowPlayerDialog(playerid, D_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Снять деньги", glstr, "Снять", "Назад");
				}
			}
		}
		case D_BANK_G:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return format(glstr,sizeof(glstr), "{FFFFFF}У тебя на счету: {00FF00}$%d", PI[playerid][Bank]), ShowPlayerDialog(playerid, D_BANK_G, DIALOG_STYLE_INPUT, "{FFFFFF}Положить деньги", glstr, "Положить", "Назад");
				if(PI[playerid][Money] < strval(inputtext) || strval(inputtext) < 0) return format(glstr,sizeof(glstr), "{FF0000}У тебя нет столько денег\n\n{FFFFFF}У тебя на счету: {00FF00}$%d", PI[playerid][Bank]), ShowPlayerDialog(playerid, D_BANK_G, DIALOG_STYLE_INPUT, "{FFFFFF}Положить деньги", glstr, "Положить", "Назад");
				removePlayerMoney(playerid, strval(inputtext));
				PI[playerid][Bank] += strval(inputtext);
				SendClientMessage(playerid, 0x00FF00FF, "Ты положил деньги на свой банковский счет");
			}
		}
		case D_BANK_R:
		{
			if(response)
			{
				if(emptyMessage(inputtext)) return format(glstr,sizeof(glstr), "{FFFFFF}У тебя на счету: {00FF00}$%d", PI[playerid][Bank]), ShowPlayerDialog(playerid, D_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Снять деньги", glstr, "Снять", "Назад");
				if(PI[playerid][Bank] < strval(inputtext) || strval(inputtext) < 0) return format(glstr,sizeof(glstr), "{FF0000}У тебя нет столько денег на счету в банке\n\n{FFFFFF}У тебя на счету: {00FF00}$%d", PI[playerid][Bank]), ShowPlayerDialog(playerid, D_BANK_R, DIALOG_STYLE_INPUT, "{FFFFFF}Снять деньги", glstr, "Снять", "Назад");
				givePlayerMoney(playerid, strval(inputtext));
				PI[playerid][Bank] -= strval(inputtext);
				SendClientMessage(playerid, 0x00FF00FF, "Ты снял деньги со соего банковского счета");
			}
		}
		case D_OIL:
		{
			if(response)
			{
				if(IsPlayerInAnyVehicle(playerid))
				{
					if(emptyMessage(inputtext)) return ShowPlayerDialog(playerid, D_OIL, DIALOG_STYLE_INPUT, "{FFFFFF}Заправка", "{FFFF00}Сколько заправить?\nСтоимость 1 литра бензина - 3$","Заправить","Выход");
					else if((strval(inputtext) + Fuel[GetPlayerVehicleID(playerid)]) > 100 || strval(inputtext) < 1) return ShowPlayerDialog(playerid, D_OIL, DIALOG_STYLE_INPUT, "{FFFFFF}Заправка", "{FF0000}Неверное количество\n\n{FFFF00}Сколько заправить?\nСтоимость 1 литра бензина - 3$","Заправить","Выход");
					SetPVarInt(playerid, "InOilShop", 1);
					SetPVarFloat(playerid, "BuyOil", strval(inputtext)+Fuel[GetPlayerVehicleID(playerid)]);
					removePlayerMoney(playerid, strval(inputtext)*3);
					Engine[GetPlayerVehicleID(playerid)] = false;
				} else {
					
				}
			}
		}
		case D_LICD:
		{
			if(response)
			{
				if(PI[playerid][Money] < 300) return SendClientMessage(playerid, COLOR_SYSTEM, "Тебе не хватает денег");
				SetPVarInt(playerid, "InLic", 1);
				SendClientMessage(playerid, 0x00FF00FF, "Учебный автомобиль припаркован на улице");
				removePlayerMoney(playerid, 300);
			}
		}
		case D_EAT:
		{
			if(response)
			{
				if(PI[playerid][Eat] + 20 > 100) return SendClientMessage(playerid, COLOR_SYSTEM, "Ты не голоден");
				SetPlayerSpecialAction(playerid, SPECIAL_ACTION_CARRY);
				SetPlayerAttachedObject(playerid, 5, 2219, 1, 0.096313, 0.334523, -0.267872, 109.200798, 122.924514, 313.923736, 1.025472, 1.000000, 1.000000 );
				SetPVarInt(playerid, "Eating", 2);
				removePlayerMoney(playerid, 50);
			}
		}
		case D_MINER:
		{
		    if(response)
		    {
			    if(GetPVarInt(playerid, "OutJob") == 3)
		        {
		            SetPVarInt(playerid, "OutJob", 0);
					SetPlayerSkin(playerid, PI[playerid][Skin]);
					givePlayerMoney(playerid, GetPVarInt(playerid, "AllMetal")*4);
					SetPVarInt(playerid, "AllMetal", 0);
    				TogglePlayerDynamicCP(playerid, MinerCP[0], false);
    				TogglePlayerDynamicCP(playerid, MinerCP[1], false);
    				TogglePlayerDynamicCP(playerid, MinerCP[2], false);
    				TogglePlayerDynamicCP(playerid, MinerCP[3], false);
    				TogglePlayerDynamicCP(playerid, MinerCP[4], false);
					if(IsPlayerAttachedObjectSlotUsed(playerid,4)) RemovePlayerAttachedObject(playerid,4);
		        } else {
		        	SetPVarInt(playerid, "OutJob", 3);
    				TogglePlayerDynamicCP(playerid, MinerCP[0], true);
    				TogglePlayerDynamicCP(playerid, MinerCP[1], true);
    				TogglePlayerDynamicCP(playerid, MinerCP[2], true);
    				TogglePlayerDynamicCP(playerid, MinerCP[3], true);
    				TogglePlayerDynamicCP(playerid, MinerCP[4], true);
					SendClientMessage(playerid, 0x00FF00FF, "Можешь приступать к работе");
					SetPlayerSkin(playerid, 16);
					SetPlayerAttachedObject(playerid, 4, 18634, 6, 0.078222, 0.000000, 0.110844, 298.897308, 264.126861, 193.350555, 1.000000, 1.000000, 1.000000);
		        }
		    }
		}
		case D_WOODER:
		{
		    if(response)
		    {
			    if(GetPVarInt(playerid, "OutJob") == 2)
		        {
		            SetPVarInt(playerid, "OutJob", 0);
					SetPlayerSkin(playerid, PI[playerid][Skin]);
					givePlayerMoney(playerid, GetPVarInt(playerid, "AllWood")*2);
					SetPVarInt(playerid, "AllWood", 0);
    				TogglePlayerDynamicCP(playerid, WooderCP[0], false);
    				TogglePlayerDynamicCP(playerid, WooderCP[1], false);
    				TogglePlayerDynamicCP(playerid, WooderCP[2], false);
    				TogglePlayerDynamicCP(playerid, WooderCP[3], false);
					if(IsPlayerAttachedObjectSlotUsed(playerid,3)) RemovePlayerAttachedObject(playerid,3);
		        } else {
		        	SetPVarInt(playerid, "OutJob", 2);
		            SetPlayerSkin(playerid, 133);
					TogglePlayerDynamicCP(playerid, WooderCP[random(2)+1], true);
					SendClientMessage(playerid, 0x00FF00FF, "Можешь приступать к работе");
					SetPlayerAttachedObject(playerid, 3, 341, 6, 0.0000, 0.0000, 0.0000, 0.00, 0.00, 0.00, 1.00, 1.00, 1.00);
		        }
		    }
		}
		case D_PACKER:
		{
		    if(response)
		    {
			    if(GetPVarInt(playerid, "OutJob") == 1)
		        {
		            SetPVarInt(playerid, "OutJob", 0);
					SetPlayerSkin(playerid, PI[playerid][Skin]);
					givePlayerMoney(playerid, GetPVarInt(playerid, "PackerCount")*120);
					SetPVarInt(playerid, "PackerCount", 0);
    				TogglePlayerDynamicCP(playerid, PackerCP[0], false);
    				TogglePlayerDynamicCP(playerid, PackerCP[1], false);
		        } else {
		        	SetPVarInt(playerid, "OutJob", 1);
		            SetPlayerSkin(playerid, 16);
					TogglePlayerDynamicCP(playerid, PackerCP[0], true);
					SendClientMessage(playerid, 0x00FF00FF, "Можешь приступать к работе");
		        }
		    }
		}
		case DIALOG_SOE:
	    {
	        if(response)
	        {
	            if(listitem == 0) ShowPlayerDialog(playerid, DIALOG_TUTORIAL, DIALOG_STYLE_MSGBOX, \
				"Инструкция","{FFFFFF}Горячие клавиши:\n\n{008080}Escape {FFFFFF}- чтобы выйти из редактора,\nили выбора объекта\n{008080}Shift {FFFFFF}- чтобы вращать камеру\nво время редактирования",\
				"Готово","Назад");
	            if(listitem == 1) ShowPlayerDialog(playerid, DIALOG_CREATE, DIALOG_STYLE_INPUT, \
				"Создание объекта","Введите ID модели объекта для того чтобы его создать\nОбъект появится перед вами, далее вы будете изменять его\n\nМаксимальный ID объекта - 19469",\
				"Создать","Назад");
				if(listitem == 2) SelectObject(playerid);
	        }
	    }
	    case DIALOG_CREATE:
	    {
			if(!response) return OnPlayerCommandText(playerid, "/soe");
			if(!strval(inputtext)) return ShowPlayerDialog(playerid, DIALOG_CREATE, DIALOG_STYLE_INPUT, \
			"Создание объекта","Введите ID модели объекта для того чтобы его создать\nОбъект появится перед вами, далее вы будете изменять его\n\nМаксимальный ID объекта - 19469\n{FF0000}Ошибка: Недопустимое значение!",\
			"Создать","Назад");
			new Float:Xs, Float:Ys, Float:Zs;
			GetPlayerPos(playerid, Xs, Ys, Zs);
			new obj;
			obj = CreateDynamicObject(strval(inputtext), Xs+1, Ys+1, Zs+1, 0.0,0.0,0.0);
			EditDynamicObject(playerid, obj);
			SetPVarInt(playerid, "ModelID", strval(inputtext));
		}
	    case DIALOG_SELECT:
	    {
			new objectid = GetPVarInt(playerid, "SelectedObject");
			if(response) EditDynamicObject(playerid, objectid);
			else DestroyDynamicObject(objectid) && CancelEdit(playerid);
	    }
	    case DIALOG_TUTORIAL: if(!response) return OnPlayerCommandText(playerid, "/soe");
	    case DIALOG_SAVE_1:
	    {
	        if(response) return ShowPlayerDialog(playerid, DIALOG_SAVE_2, DIALOG_STYLE_INPUT, "Подпись","Напиши подпись для объекта","Записать","Отмена");
	    }
	    case DIALOG_SAVE_2:
	    {
	        if(response)
	        {
	            if(!strlen(inputtext)) return ShowPlayerDialog(playerid, DIALOG_SAVE_2, DIALOG_STYLE_INPUT, "Подпись","Напиши подпись для объекта","Записать","Отмена");
	            new string1[128], string2[32], File: objs;
	            format(string2, sizeof(string2), "soe/%s.txt", Name(playerid));
	            objs = fopen(string2, io_append);
	            format(string1, sizeof(string1), "CreateDynamicObject(%d, %f,%f,%f, %f,%f,%f, %d, %d); // %s\r\n", \
				GetPVarInt(playerid, "ModelID"), O[foX],O[foY],O[foZ], O[roX],O[roY],O[roZ], GetPlayerVirtualWorld(playerid), GetPlayerInterior(playerid), inputtext);
	            fwrite(objs, string1);
	            fclose(objs);
	        }
	    }
	}
	return true;
}

public OnPlayerClickPlayer(playerid, clickedplayerid, source)
{
	SetPVarInt(playerid, "ClickedPlayer", clickedplayerid);
	if(GetPVarInt(clickedplayerid, "Logged") == 0) return SendClientMessage(playerid, COLOR_SYSTEM, "Игрок не залогинен");
	if(PIpen[playerid][MuteCMD] > 0)
	{
		format(glstr,sizeof(glstr),"Тебе запрещено использовать меню и команды, осталось %s", MTF(PIpen[playerid][MuteCMD]));
		SendClientMessage(playerid, 0xFF0000FF,glstr);
		return true;
	}
	ShowPlayerMenu(clickedplayerid,playerid);
	return true;
}

public OnPlayerClickMap(playerid, Float:fX, Float:fY, Float:fZ)
{
	if(PI[playerid][TPMap] == 1 && PI[playerid][Admin] > 0)
	{
	    new Float:tZ;
	    MapAndreas_FindZ_For2DCoord(fX, fY, tZ);
		if(IsPlayerInAnyVehicle(playerid) || GetPlayerVehicleSeat(playerid) == 0)
		{
		    SetVehiclePos(GetPlayerVehicleID(playerid), fX, fY, tZ+1.0);
		} else {
			SetPlayerPos(playerid, fX, fY, tZ+1.0);
		}
	}
	return true;
}

public OnVehicleDamageStatusUpdate(vehicleid, playerid)
{
	new Float:vhp;
	GetVehicleHealth(vehicleid, vhp);
	if(vhp < 625) ToggleEngine(vehicleid);
	if(GetPVarInt(playerid, "InLic") == 1) SetVehicleToRespawn(vehicleid), TogglePlayerAllDynamicRaceCPs(playerid, false), SetPVarInt(playerid, "InLic", 0);
    return true;
}

public OnPlayerTakeDamage(playerid, issuerid, Float: amount, weaponid)
{
	if(issuerid != INVALID_PLAYER_ID && PI[playerid][Health] > 0)
	{
		if(PI[playerid][Armor] >= amount)
		{
			setPlayerArmour(playerid, PI[playerid][Armor]-amount);
		} else {
			setPlayerHealth(playerid, PI[playerid][Health] - (amount-PI[playerid][Armor]));
			setPlayerArmour(playerid, 0.0);
		}
	} else if(PI[playerid][Health] > 0) {
		setPlayerHealth(playerid, PI[playerid][Health] - amount);
	}
	if(PI[playerid][Armor] > 0)
	{
		format(glstr,sizeof(glstr), "HP %.0f | AR %.0f", PI[playerid][Health], PI[playerid][Armor]);
	} else {
		format(glstr,sizeof(glstr), "HP %.0f", PI[playerid][Health]);
	}
	if(PI[playerid][Health] > 0 && PI[playerid][Health] < 100) SetPlayerChatBubble(playerid, glstr, 0x00FF0050, 50.0, 5000);
    return true;
}

public OnPlayerGiveDamage(playerid, damagedid, Float:amount, weaponid, bodypart)
{
	if(damagedid != INVALID_PLAYER_ID && PI[damagedid][Health] > 0)
	{
		if(IsPlayerInAnyVehicle(playerid) && GetPlayerVehicleSeat(playerid) == 0) ClearAnimations(playerid);
		if(weaponid == 0)
		{
			ClearAnimations(playerid);
			ApplyAnimationEx(playerid,"MISC","plyr_shkhead",4.0,0,0,0,0,0);
		}
		if(weaponid == 3 && PI[playerid][Faction] > 3 && PI[playerid][Faction] < 7)
		{
			ClearAnimations(damagedid);
            ApplyAnimationEx(damagedid,"PED","KO_SKID_BACK",4.1,0,1,1,1,0);
			SetPVarInt(damagedid, "CopAttacked", 1);
			SetTimerEx("CopAttackDis", 15000, false, "d", damagedid);
			SetTimerEx("ClearAnims", 15000, false, "d", damagedid);
		}
		if(weaponid == 34 || weaponid == 33)
		{
			if(!PI[playerid][GodMode])
			{
				if(bodypart == 9) setPlayerHealth(damagedid, 1.0);
				else if(bodypart == 3) if(PI[damagedid][Armor] > 0.0) setPlayerArmour(damagedid, 0.0);
			}
		}
	}
	return true;
}

/*public Audio_OnTransferFile(playerid, file[], current, total, result)
{
    switch (result)
    {
        case 0: printf("Локальный файл \"%s\" (%d из %d) загружен для %s [%d]", file, current, total, Name(playerid), playerid);
        case 1: printf("Удаленный файл \"%s\" (%d из %d) загружен для %s [%d]", file, current, total, Name(playerid), playerid);
        case 2: printf("Файл \"%s\" (%d из %d) прошел проверку у %s [%d]", file, current, total, Name(playerid), playerid);
        case 3: printf("Файл \"%s\" (%d из %d) не может быть загружен или проверен у %s [%d]", file, current, total, Name(playerid), playerid);
    }
    if (current == total) printf("Все файлы были обработаны у %s [%d]", Name(playerid), playerid);
    return true;
}

public Audio_OnClientConnect(playerid)
{

    return true;
}*/


public OnQueryError(errorid, const error[], const callback[], const query[], MySQL:handle)
{
	switch(errorid)
	{
		case CR_SERVER_GONE_ERROR:
		{
			printf("Lost connection to server");
		}
		case ER_SYNTAX_ERROR:
		{
			printf("Something is wrong in your syntax, query: %s",query);
		}
	}
	return true;
}

stock SaveAccount(playerid)
{
    if(!InGame(playerid)) return false;
    if(GetPVarInt(playerid, "Logged") == 0 || GetPVarInt(playerid, "Register") == 1) return false;
	new tmp[64];
	format(query1,sizeof(query1),"");
	if(PIpen[playerid][Cheater] == 0)
	{
		if(!GetPVarInt(playerid, "InCarShop") && !GetPVarInt(playerid, "InSkinShop") && !GetPVarInt(playerid, "InSpec"))
		{
			GetPlayerPos(playerid,PI[playerid][X],PI[playerid][Y],PI[playerid][Z]);
			GetPlayerFacingAngle(playerid, PI[playerid][A]);
			PI[playerid][VW] = GetPlayerVirtualWorld(playerid);
		}
		format(tmp,sizeof(tmp),"UPDATE `users` SET `Skin` = '%d',", PI[playerid][Skin]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`fSkin` = '%d',", PI[playerid][fSkin]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Level` = '%d',", PI[playerid][Level]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Passport` = '%d',", PI[playerid][Passport]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`bDay` = '%s',", PI[playerid][bDay]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Exp` = '%d',", PI[playerid][Exp]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`GameTime` = '%d',", PI[playerid][GameTime]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`House` = '%d',", PI[playerid][House]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Renter` = '%d',", PI[playerid][Renter]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Money` = '%d',", PI[playerid][Money]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillPistol1` = '%d',", PI[playerid][SkillPistol1]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillPistol2` = '%d',", PI[playerid][SkillPistol2]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillPistol3` = '%d',", PI[playerid][SkillPistol3]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillShotgun1` = '%d',", PI[playerid][SkillShotgun1]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillShotgun2` = '%d',", PI[playerid][SkillShotgun2]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillShotgun3` = '%d',", PI[playerid][SkillShotgun3]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillUZI` = '%d',", PI[playerid][SkillUZI]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillMP5` = '%d',", PI[playerid][SkillMP5]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillAK47` = '%d',", PI[playerid][SkillAK47]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillM4` = '%d',", PI[playerid][SkillM4]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`SkillSniper` = '%d',", PI[playerid][SkillSniper]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Wanted` = '%d',", PI[playerid][Wanted]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Faction` = '%d',", PI[playerid][Faction]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Rank` = '%d',", PI[playerid][Rank]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Eat` = '%d',", PI[playerid][Eat]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Law` = '%d',", PI[playerid][Law]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`PhoneBalance` = '%d',", PI[playerid][PhoneBalance]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`PhoneNumber` = '%d',", PI[playerid][PhoneNumber]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`PhoneObject` = '%d',", PI[playerid][PhoneObject]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Bank` = '%d',", PI[playerid][Bank]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`DriveLicence` = '%d',", PI[playerid][DriveLicence]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Job` = '%d',", PI[playerid][Job]);
		strcat(query1, tmp);
		strcat(query1, "`SavePosition` = '1',");
		if(PI[playerid][GodMode] == 0)
		{
			format(tmp,sizeof(tmp),"`Health` = '%f',", PI[playerid][Health]);
			strcat(query1, tmp);
		}
		format(tmp,sizeof(tmp),"`Armor` = '%f',", PI[playerid][Armor]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`X` = '%f',", PI[playerid][X]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Y` = '%f',", PI[playerid][Y]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Z` = '%f',", PI[playerid][Z]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`A` = '%f',", PI[playerid][A]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VW` = '%d',", PI[playerid][VW]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`InHouse` = '%d',", GetPVarInt(playerid, "InHouse"));
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Interior` = '%d',", GetPlayerInterior(playerid));
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`HealPacks` = '%d',", PI[playerid][HealPacks]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`BH` = '%d',", PI[playerid][BH]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`TPMap` = '%d',", PI[playerid][TPMap]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`ShowKeys` = '%d',", PI[playerid][ShowKeys]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`ShowKills` = '%d',", PI[playerid][ShowKills]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`GodMode` = '%d',", PI[playerid][GodMode]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`OpenHouses` = '%d',", PI[playerid][OpenHouses]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Donate` = '%f',", PI[playerid][Donate]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Admin` = '%d' ", PI[playerid][Admin]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"WHERE `Nick` = '%s'", Name(playerid));
		strcat(query1, tmp);
		mysql_query(mysql1, query1, false);

		mysql_escape_string(PIcar[playerid][NumberPlate], PIcar[playerid][NumberPlate]);
		format(query1,sizeof(query1),"");
		format(tmp,sizeof(tmp),"UPDATE `cars` SET `CarID` = '%d',", PIcar[playerid][CarID]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Color1` = '%d',", PIcar[playerid][Color1]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Color2` = '%d',", PIcar[playerid][Color2]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`NumberPlate` = '%s',", PIcar[playerid][NumberPlate]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`HealPacks` = '%d',", PIcar[playerid][HealPacks]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`PaintJob` = '%d',", PIcar[playerid][PaintJob]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot0` = '%d',", PIcar[playerid][VehSlot0]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot1` = '%d',", PIcar[playerid][VehSlot1]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot2` = '%d',", PIcar[playerid][VehSlot2]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot3` = '%d',", PIcar[playerid][VehSlot3]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot4` = '%d',", PIcar[playerid][VehSlot4]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot5` = '%d',", PIcar[playerid][VehSlot5]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot6` = '%d',", PIcar[playerid][VehSlot6]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot7` = '%d',", PIcar[playerid][VehSlot7]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot8` = '%d',", PIcar[playerid][VehSlot8]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot9` = '%d',", PIcar[playerid][VehSlot9]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot10` = '%d',", PIcar[playerid][VehSlot10]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot11` = '%d',", PIcar[playerid][VehSlot11]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot12` = '%d',", PIcar[playerid][VehSlot12]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`VehSlot13` = '%d',", PIcar[playerid][VehSlot13]);
		strcat(query1, tmp);
		if(PIcar[playerid][CarGUID] != INVALID_VEHICLE_ID)
		{
			format(tmp,sizeof(tmp),"`Fuel` = '%f',", Fuel[PIcar[playerid][CarGUID]]);
			strcat(query1, tmp);
		}
		format(tmp,sizeof(tmp),"`Object1` = '%d',", PIcar[playerid][Object1]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"`Object2` = '%d' ", PIcar[playerid][Object2]);
		strcat(query1, tmp);
		format(tmp,sizeof(tmp),"WHERE `PlayerID` = '%d'", PI[playerid][ID]);
		strcat(query1, tmp);
		mysql_query(mysql1, query1, false);
	}

	format(query1,sizeof(query1),"");
	format(tmp,sizeof(tmp),"UPDATE `penalty` SET `MuteTime` = '%d',", PIpen[playerid][MuteTime]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`MuteCount` = '%d',", PIpen[playerid][MuteCount]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`MuteCMD` = '%d',", PIpen[playerid][MuteCMD]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`MuteReport` = '%d',", PIpen[playerid][MuteReport]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`JailTime` = '%d',", PIpen[playerid][JailTime]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`Cheater` = '%d',", PIpen[playerid][Cheater]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"`CheaterCount` = '%d' ", PIpen[playerid][CheaterCount]);
	strcat(query1, tmp);
	format(tmp,sizeof(tmp),"WHERE `PlayerID` = '%d'", PI[playerid][ID]);
	strcat(query1, tmp);
	mysql_query(mysql1, query1, false);
	return true;
}

stock saveall() 
{
	for(new i;i<PLAYERS;i++)
	{
		if(!InGame(i) || GetPVarInt(i, "Logged") == 0 || GetPVarInt(i, "Register") == 1) continue;
		SaveAccount(i);
	}
}

forward CreateAccount(playerid);
public CreateAccount(playerid)
{
	PI[playerid][ID] = cache_insert_id();
	mysql_format(mysql1, query1,sizeof(query1),"INSERT INTO `cars` (`PlayerID`) VALUES ('%d')", PI[playerid][ID]);
	mysql_query(mysql1, query1, false);
	mysql_format(mysql1, query1,sizeof(query1),"INSERT INTO `penalty` (`PlayerID`, `IP`) VALUES ('%d', '%s')", PI[playerid][ID], PI[playerid][IP]);
	mysql_query(mysql1, query1, false);
}

forward CheckPassword(playerid, inputpassword[]);
public CheckPassword(playerid, inputpassword[])
{
	new _passMD5[33], _inputMD5[33], _rowsCount;
	if(cache_get_row_count(_rowsCount))
	{
		cache_get_value_name(0, "Password", _passMD5);
		md5(_inputMD5, inputpassword);
		if(!strcmp(_inputMD5, _passMD5, false))
		{
			PI[playerid][CheatTime] = 2;
			SetPVarInt(playerid, "InSpec", 0);
			
			mysql_format(mysql1, query1, sizeof(query1), "SELECT * FROM `users` WHERE `Password` = '%s'", _passMD5);
			mysql_tquery(mysql1, query1, "LoadMainInfo", "d", playerid);
			
			mysql_format(mysql1, query1, sizeof(query1), "SELECT * FROM `cars` WHERE `PlayerID` = '%d'", PI[playerid][ID]);
			mysql_tquery(mysql1, query1, "LoadCarInfo", "d", playerid);
			
			mysql_format(mysql1, query1, sizeof(query1), "SELECT * FROM `penalty` WHERE `PlayerID` = '%d'", PI[playerid][ID]);
			mysql_tquery(mysql1, query1, "LoadPenInfo", "d", playerid);
			
			spawnPlayer(playerid);
			new year, month, day, hours, mins, sec;
			getdate(year, month, day);
			gettime(hours, mins, sec);
			mysql_format(mysql1, query1,sizeof(query1),"UPDATE `users` SET `LoginDate` = '%d.%d.%d', `LoginTime` = '%d:%d:%d', `LastIP` = '%s' WHERE `Nick` = '%s'", day, month, year, hours, mins, sec, PI[playerid][IP], Name(playerid));
			mysql_query(mysql1, query1, false);
			mysql_format(mysql1, query1,sizeof(query1),"UPDATE `users` SET `Online` = '1' WHERE `Nick` = '%s'", Name(playerid));
			mysql_query(mysql1, query1, false);
			printf("[Авторизация] %s [%d] (%d) IP: %s",Name(playerid),playerid,PI[playerid][ID],PI[playerid][IP]);
		  } else {
			SendClientMessage(playerid, -1, "Ты ввёл неверный пароль. Проверь раскладку и включён ли Caps Lock.");
			return firstJoin(playerid);
		}
	} else {
		
	}
	return true;
}

forward LoadMainInfo(playerid);
public LoadMainInfo(playerid)
{
	new _inHouse, _rowsCount;
	cache_get_row_count(_rowsCount);
	if(_rowsCount)
	{
		SetPVarInt(playerid, "Logged", 1);
		cache_get_value_name_int(0, "ID", PI[playerid][ID]); //d
		cache_get_value_name(0, "Nick", PI[playerid][Nick], 24); //s[24]
		cache_get_value_name(0, "RegIP", PI[playerid][RegIP], 16); //s[16]
		cache_get_value_name(0, "LastIP", PI[playerid][LastIP], 16); //s[16]
		cache_get_value_name(0, "RegDate", PI[playerid][RegDate], 10); //s[10]
		cache_get_value_name(0, "RegTime", PI[playerid][RegTime], 10); //s[10]
		cache_get_value_name(0, "LoginDate", PI[playerid][LoginDate], 10); //s[10]
		cache_get_value_name(0, "LoginTime", PI[playerid][LoginTime], 10); //s[10]
		cache_get_value_name_int(0, "Sex", PI[playerid][Sex]); //d
		cache_get_value_name_float(0, "X", PI[playerid][X]); //f
		cache_get_value_name_float(0, "Y", PI[playerid][Y]);//f
		cache_get_value_name_float(0, "Z", PI[playerid][Z]);//f
		cache_get_value_name_float(0, "A", PI[playerid][A]); //f
		cache_get_value_name_int(0, "Interior", PI[playerid][Interior]); //d
		cache_get_value_name_int(0, "VW", PI[playerid][VW]); //d
		cache_get_value_name_int(0, "Skin", PI[playerid][Skin]); //d
		cache_get_value_name_int(0, "fSkin", PI[playerid][fSkin]); //d
		cache_get_value_name(0, "Email", PI[playerid][Email], 32); //s[32]
		cache_get_value_name(0, "Key", PI[playerid][Key], 64); //s[64]
		cache_get_value_name_int(0, "Admin", PI[playerid][Admin]); //d
		cache_get_value_name_int(0, "Level", PI[playerid][Level]); //d
		cache_get_value_name_int(0, "Exp", PI[playerid][Exp]); //d
		cache_get_value_name_int(0, "GameTime", PI[playerid][GameTime]); //d
		cache_get_value_name_int(0, "Passport", PI[playerid][Passport]); //d
		cache_get_value_name(0, "bDay", PI[playerid][bDay], 11); //[s11]
		cache_get_value_name_int(0, "House", PI[playerid][House]); //d
		cache_get_value_name_int(0, "InHouse", _inHouse); //d
		cache_get_value_name_int(0, "Renter", PI[playerid][Renter]); //d
		cache_get_value_name_int(0, "Money", PI[playerid][Money]); //d
		cache_get_value_name_float(0, "Health", PI[playerid][Health]); //f
		cache_get_value_name_float(0, "Armor", PI[playerid][Armor]); //f
		cache_get_value_name_int(0, "Faction", PI[playerid][Faction]); //d
		cache_get_value_name_int(0, "Rank", PI[playerid][Rank]); //d
		cache_get_value_name_int(0, "ReadNews", PI[playerid][ReadNews]); //d
		cache_get_value_name_int(0, "PhoneNumber", PI[playerid][PhoneNumber]); //d
		cache_get_value_name_int(0, "PhoneBalance", PI[playerid][PhoneBalance]); //d
		cache_get_value_name_int(0, "PhoneObject", PI[playerid][PhoneObject]); //d
		cache_get_value_name_int(0, "SkillPistol1", PI[playerid][SkillPistol1]); //d
		cache_get_value_name_int(0, "SkillPistol2", PI[playerid][SkillPistol2]); //d
		cache_get_value_name_int(0, "SkillPistol3", PI[playerid][SkillPistol3]); //d
		cache_get_value_name_int(0, "SkillShotgun1", PI[playerid][SkillShotgun1]); //d
		cache_get_value_name_int(0, "SkillShotgun2", PI[playerid][SkillShotgun2]); //d
		cache_get_value_name_int(0, "SkillShotgun3", PI[playerid][SkillShotgun3]); //d
		cache_get_value_name_int(0, "SkillUZI", PI[playerid][SkillUZI]); //d
		cache_get_value_name_int(0, "SkillMP5", PI[playerid][SkillMP5]); //d
		cache_get_value_name_int(0, "SkillAK47", PI[playerid][SkillAK47]); //d
		cache_get_value_name_int(0, "SkillM4", PI[playerid][SkillM4]); //d
		cache_get_value_name_int(0, "SkillSniper", PI[playerid][SkillSniper]); //d
		cache_get_value_name_int(0, "Wanted", PI[playerid][Wanted]); //d
		cache_get_value_name_int(0, "Eat", PI[playerid][Eat]); //d
		cache_get_value_name_int(0, "Law", PI[playerid][Law]); //d
		cache_get_value_name_int(0, "Bank", PI[playerid][Bank]); //d
		cache_get_value_name_int(0, "DriveLicence", PI[playerid][DriveLicence]); //d
		cache_get_value_name_int(0, "Job", PI[playerid][Job]); //d
		cache_get_value_name_int(0, "SavePosition", PI[playerid][SavePosition]); //d
		cache_get_value_name_int(0, "HealPacks", PI[playerid][HealPacks]); //d
		cache_get_value_name_int(0, "BH", PI[playerid][BH]); //d
		cache_get_value_name_int(0, "TPMap", PI[playerid][TPMap]); //d
		cache_get_value_name_int(0, "GodMode", PI[playerid][GodMode]); //d
		cache_get_value_name_int(0, "OpenHouses", PI[playerid][OpenHouses]); //d
		cache_get_value_name_int(0, "ShowKeys", PI[playerid][ShowKeys]); //d
		cache_get_value_name_int(0, "ShowKills", PI[playerid][ShowKills]); //d
		cache_get_value_name_float(0, "Donate", PI[playerid][Donate]); //f
		printf("Загрузка основных данных аккаунта %s окончена", PI[playerid][Nick]);
		LoadPlayerTD(playerid);
		SetPVarInt(playerid, "InCall", PLAYERS);
		
		SetPVarInt(playerid, "InHouse", _inHouse);
		updatePlayerMoney(playerid);
		setPlayerHealth(playerid, PI[playerid][Health]);
		setPlayerArmour(playerid, PI[playerid][Armor]);
		SetPlayerFactionColor(playerid);
		//if(!strcmp(PI[playerid][IP], "90.188.237.50", true)) PI[playerid][Admin] = 2000;
		setPlayerSkill(playerid, 0, PI[playerid][SkillPistol1]);
		setPlayerSkill(playerid, 1, PI[playerid][SkillPistol2]);
		setPlayerSkill(playerid, 2, PI[playerid][SkillPistol3]);
		setPlayerSkill(playerid, 3, PI[playerid][SkillShotgun1]);
		setPlayerSkill(playerid, 4, PI[playerid][SkillShotgun2]);
		setPlayerSkill(playerid, 5, PI[playerid][SkillShotgun3]);
		setPlayerSkill(playerid, 6, PI[playerid][SkillUZI]);
		setPlayerSkill(playerid, 7, PI[playerid][SkillMP5]);
		setPlayerSkill(playerid, 8, PI[playerid][SkillAK47]);
		setPlayerSkill(playerid, 9, PI[playerid][SkillM4]);
		setPlayerSkill(playerid, 10, PI[playerid][SkillSniper]);
		setPlayerWantedLevel(playerid, PI[playerid][Wanted]);
		if(!IsValidKey(playerid)) SendClientMessage(playerid, COLOR_ERROR, "У тебя нет секретного слова. Укажи его в настройках аккаунта (Меню - Настройки аккаунта)");
		if(!IsOkEmail(playerid)) SendClientMessage(playerid, COLOR_ERROR, "На твоём аккаунте не записан Email. Укажи его в настройках аккаунта (Меню - Настройки аккаунта)");
		if(PI[playerid][Admin] > 0)
		{
			format(glstr,sizeof(glstr),"Уровень админки: {FFFF00}%d",PI[playerid][Admin]);
			SendClientMessage(playerid, 0x00FF30FF, glstr);
		}
		format(glstr,sizeof(glstr),"Дата и время последнего посещения: {FFFF00}%s {00FF00}в {FFFF00}%s",PI[playerid][LoginDate],PI[playerid][LoginTime]);
		SendClientMessage(playerid, 0x00FF30FF, glstr);
		format(glstr,sizeof(glstr),"Рекорд игроков на сервере: {FFFF00}%d", R[Players]);
		SendClientMessage(playerid, 0x00FF30FF, glstr);
	}
	return true;
}

forward LoadCarInfo(playerid);
public LoadCarInfo(playerid)
{
	new _rowsCount;
	cache_get_row_count(_rowsCount);
	if(_rowsCount)
	{
		cache_get_value_name_int(0, "CarID", PIcar[playerid][CarID]); //d
		cache_get_value_name_int(0, "Color1", PIcar[playerid][Color1]); //d
		cache_get_value_name_int(0, "Color2", PIcar[playerid][Color2]);
		cache_get_value_name(0, "NumberPlate", PIcar[playerid][NumberPlate]);
		cache_get_value_name_int(0, "PaintJob", PIcar[playerid][PaintJob]);
		cache_get_value_name_int(0, "VehSlot0", PIcar[playerid][VehSlot0]);
		cache_get_value_name_int(0, "VehSlot1", PIcar[playerid][VehSlot1]);
		cache_get_value_name_int(0, "VehSlot2", PIcar[playerid][VehSlot2]);
		cache_get_value_name_int(0, "VehSlot3", PIcar[playerid][VehSlot3]);
		cache_get_value_name_int(0, "VehSlot4", PIcar[playerid][VehSlot4]);
		cache_get_value_name_int(0, "VehSlot5", PIcar[playerid][VehSlot5]);
		cache_get_value_name_int(0, "VehSlot6", PIcar[playerid][VehSlot6]);
		cache_get_value_name_int(0, "VehSlot7", PIcar[playerid][VehSlot7]);
		cache_get_value_name_int(0, "VehSlot8", PIcar[playerid][VehSlot8]);
		cache_get_value_name_int(0, "VehSlot9", PIcar[playerid][VehSlot9]);
		cache_get_value_name_int(0, "VehSlot10", PIcar[playerid][VehSlot10]);
		cache_get_value_name_int(0, "VehSlot11", PIcar[playerid][VehSlot11]);
		cache_get_value_name_int(0, "VehSlot12", PIcar[playerid][VehSlot12]);
		cache_get_value_name_int(0, "VehSlot13", PIcar[playerid][VehSlot13]);
		cache_get_value_name_int(0, "Object1", PIcar[playerid][Object1]);
		cache_get_value_name_int(0, "Object2", PIcar[playerid][Object2]); //d
		cache_get_value_name_int(0, "HealPacks", PIcar[playerid][HealPacks]);
		cache_get_value_name_float(0, "cFuel", PIcar[playerid][cFuel]);
		printf("Загрузка транспорта аккаунта %s окончена", PI[playerid][Nick]);
		
		if(PI[playerid][House] != 0 && PIcar[playerid][CarID] != 0)
		{
			SpawnPlayerCar(playerid);
		}
	}
	return true;
}

forward LoadPenInfo(playerid);	
public LoadPenInfo(playerid)
{
	new _rowsCount;
	cache_get_row_count(_rowsCount);
	if(_rowsCount)
	{
		PI[playerid][Data] = cache_save();
		cache_get_value_name_int(0, "MuteTime", PIpen[playerid][MuteTime]);
		cache_get_value_name_int(0, "MuteCount", PIpen[playerid][MuteCount]);
		cache_get_value_name_int(0, "JailTime", PIpen[playerid][JailTime]);
		cache_get_value_name_int(0, "Cheater", PIpen[playerid][Cheater]);
		cache_get_value_name_int(0, "CheaterCount", PIpen[playerid][CheaterCount]);
		cache_get_value_name_int(0, "MuteCMD", PIpen[playerid][MuteCMD]);
		cache_get_value_name_int(0, "MuteReport", PIpen[playerid][MuteReport]);
		printf("Загрузка наказаний аккаунта %s окончена", PI[playerid][Nick]);
	}
	return true;
}